// AnimBlueprintGeneratedClass AB_Slasher_SubGraph_Locomotion_Override_28.AB_Slasher_SubGraph_Locomotion_Override_27_C
// Size: 0x1d81 (Inherited: 0x610)
struct UAB_Slasher_SubGraph_Locomotion_Override_27_C : UKillerLocomotionSubAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x610(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x618(0x38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x650(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x678(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x6a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x6c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x6f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x718(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x740(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x768(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x790(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x7b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x7e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x808(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x830(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x8b0(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x8e8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x968(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xa50(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0xaf0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xbd8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xc58(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xcf8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xd98(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xdd0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xe50(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xf10(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xf90(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xfc8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x1048(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x10e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1168(0x38)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x11a0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1260(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x12e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1360(0x38)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x1398(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1480(0x38)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x14b8(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x15a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1640(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x16c0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1760(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x17e0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1880(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1920(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1a08(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1aa8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1b28(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1c10(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1c48(0xb0)
	bool _isCarrying; // 0x1cf8(0x01)
	enum class EInteractionAnimation _interactionType; // 0x1cf9(0x01)
	bool _isInAir; // 0x1cfa(0x01)
	bool _isIdle; // 0x1cfb(0x01)
	bool _isAttacking; // 0x1cfc(0x01)
	char pad_1CFD[0x3]; // 0x1cfd(0x03)
	float _animSpeed; // 0x1d00(0x04)
	float _animDirection; // 0x1d04(0x04)
	struct UAnimSequence* Stand; // 0x1d08(0x08)
	struct UAnimSequence* Idle; // 0x1d10(0x08)
	struct UBlendSpace* BS_Locomotion; // 0x1d18(0x08)
	struct UBlendSpace* BS_Locomotion_FPV; // 0x1d20(0x08)
	struct UAnimSequence* Idle_FPV; // 0x1d28(0x08)
	struct UBlendSpace* BS_Carry_Locomotion; // 0x1d30(0x08)
	struct UAnimSequence* EndGameWalk; // 0x1d38(0x08)
	struct UAnimSequence* Search_Locker; // 0x1d40(0x08)
	struct ASlasherPlayer* _mySlasher; // 0x1d48(0x08)
	bool _carryFPVRightArm; // 0x1d50(0x01)
	char pad_1D51[0x7]; // 0x1d51(0x07)
	struct UBlendSpace* BS_Carry_locomotion_FPV; // 0x1d58(0x08)
	struct UAnimSequence* Search_Locker_FPV; // 0x1d60(0x08)
	bool _fPV; // 0x1d68(0x01)
	char pad_1D69[0x3]; // 0x1d69(0x03)
	float _lateralVelocity; // 0x1d6c(0x04)
	float _forwardVelocity; // 0x1d70(0x04)
	bool _newLocomotion; // 0x1d74(0x01)
	char pad_1D75[0x3]; // 0x1d75(0x03)
	float Lateral_Direction; // 0x1d78(0x04)
	float Forward_Speed; // 0x1d7c(0x04)
	bool _AltFPV; // 0x1d80(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function AB_Slasher_SubGraph_Locomotion_Override_28.AB_Slasher_SubGraph_Locomotion_Override_27_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x5e02c90
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_27_AnimGraphNode_LayeredBoneBlend_2CAC3EE242984002EAA626A2755F3DFD(); // Function AB_Slasher_SubGraph_Locomotion_Override_28.AB_Slasher_SubGraph_Locomotion_Override_27_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_27_AnimGraphNode_LayeredBoneBlend_2CAC3EE242984002EAA626A2755F3DFD // (BlueprintEvent) // @ game+0x5e02c90
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_27_AnimGraphNode_LayeredBoneBlend_84430B914EB49412F35DEE9834C2D039(); // Function AB_Slasher_SubGraph_Locomotion_Override_28.AB_Slasher_SubGraph_Locomotion_Override_27_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_27_AnimGraphNode_LayeredBoneBlend_84430B914EB49412F35DEE9834C2D039 // (BlueprintEvent) // @ game+0x5e02c90
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_27_AnimGraphNode_TransitionResult_7A683278435BE62D2A76EFA6C071ABE9(); // Function AB_Slasher_SubGraph_Locomotion_Override_28.AB_Slasher_SubGraph_Locomotion_Override_27_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_27_AnimGraphNode_TransitionResult_7A683278435BE62D2A76EFA6C071ABE9 // (BlueprintEvent) // @ game+0x5e02c90
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_27_AnimGraphNode_TransitionResult_855C7BAF4385F29BAC08FFA447FD62FC(); // Function AB_Slasher_SubGraph_Locomotion_Override_28.AB_Slasher_SubGraph_Locomotion_Override_27_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_27_AnimGraphNode_TransitionResult_855C7BAF4385F29BAC08FFA447FD62FC // (BlueprintEvent) // @ game+0x5e02c90
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_27_AnimGraphNode_TransitionResult_094EF4A640160539B492EEA7609993E5(); // Function AB_Slasher_SubGraph_Locomotion_Override_28.AB_Slasher_SubGraph_Locomotion_Override_27_C.EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_27_AnimGraphNode_TransitionResult_094EF4A640160539B492EEA7609993E5 // (BlueprintEvent) // @ game+0x5e02c90
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function AB_Slasher_SubGraph_Locomotion_Override_28.AB_Slasher_SubGraph_Locomotion_Override_27_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_28(int32_t EntryPoint); // Function AB_Slasher_SubGraph_Locomotion_Override_28.AB_Slasher_SubGraph_Locomotion_Override_27_C.ExecuteUbergraph_AB_Slasher_SubGraph_Locomotion_Override_28 // (Final|UbergraphFunction) // @ game+0x5e02c90
};

