// UserDefinedStruct ASet_Slasher_27_BaseAttack.ASet_Slasher_27_BaseAttack
// Size: 0xa0 (Inherited: 0x00)
struct FASet_Slasher_27_BaseAttack {
	struct UAnimSequence* Attack_In_2_EFFD81524E6D489D83C701B1570545D7; // 0x00(0x08)
	struct UAnimSequence* Attack_In_FPV_53_1A95D22246B6351774BFB6A090DF530E; // 0x08(0x08)
	struct UAnimSequence* Attack_In_Carry_54_D1C7D07840D53D761D59DE9B4862DC72; // 0x10(0x08)
	struct UAnimSequence* Attack_In_Carry_FPV_55_FB52EE0F4A51D188974C1E8FA01AEFB2; // 0x18(0x08)
	struct UAnimSequence* Attack_Swing_10_17697BCF430A365E92517B9D8517BFF6; // 0x20(0x08)
	struct UAnimSequence* Attack_Swing_FPV_60_43BC6ABE418BFE02C993689068B449CB; // 0x28(0x08)
	struct UAnimSequence* Attack_Swing_Carry_61_5D12817240E475C2F3B0BAB0349AA65D; // 0x30(0x08)
	struct UAnimSequence* Attack_Swing_Carry_FPV_62_46A2151B45A4CE4C050A6E96098CF298; // 0x38(0x08)
	struct UAnimSequence* Attack_Hit_18_0CC25E314503E95B9D205F87A63C455B; // 0x40(0x08)
	struct UAnimSequence* Attack_Hit_FPV_63_CF2974D74CC745E465881980FD9B6AEB; // 0x48(0x08)
	struct UAnimSequence* Attack_Hit_Carry_65_0438F6E04F347CE21F76F0A35F8C1FA1; // 0x50(0x08)
	struct UAnimSequence* Attack_Hit_Carry_FPV_67_FBFFBFD6496E8EFF244529B0AB881231; // 0x58(0x08)
	struct UAnimSequence* Attack_Miss_26_06667B6247E36E6DD76407B8D0D273EA; // 0x60(0x08)
	struct UAnimSequence* Attack_Miss_FPV_71_43D7163B483524E43EB63DAEA7A73347; // 0x68(0x08)
	struct UAnimSequence* Attack_Miss_Carry_72_FE3BE9E4454D91553E4B2FA8C7FBBF98; // 0x70(0x08)
	struct UAnimSequence* Attack_Miss_Carry_FPV_73_310BBDAF49C65CBE1DC9D1AD202EF943; // 0x78(0x08)
	struct UAnimSequence* Attack_Bow_34_713A54294DEFBC6D8B2E7BA060472B37; // 0x80(0x08)
	struct UAnimSequence* Attack_Bow_FPV_77_62B8B93E4E864F9CD0F91FA1CA90B9C9; // 0x88(0x08)
	struct UAnimSequence* Attack_Bow_Carry_78_0ABE353E4009FB30C94A158DE0BEC18B; // 0x90(0x08)
	struct UAnimSequence* Attack_Bow_Carry_FPV_79_3B66FD974D2F8978925023B8B2B81317; // 0x98(0x08)
};

