// UserDefinedStruct ASet_Slasher_27_Locomotion.ASet_Slasher_27_Locomotion
// Size: 0x98 (Inherited: 0x00)
struct FASet_Slasher_27_Locomotion {
	struct UAnimSequence* Stand_2_3B2E928C4988C5A26B86BF8424E6BC41; // 0x00(0x08)
	struct UAnimSequence* Idle_4_6328A2F8424FF53878DCA991D3524E5D; // 0x08(0x08)
	struct UAnimSequence* Idle_FPV_12_0F2E8166496EE8EFEEB594A7A5F2DF2F; // 0x10(0x08)
	struct UBlendSpace* BS_Locomotion_7_9C21B5A245AFB28C8D17E28F36D0D9B8; // 0x18(0x08)
	struct UBlendSpace* BS_Locomotion_FPV_9_E9BF61EA4981B08D98C7388F62709196; // 0x20(0x08)
	struct UBlendSpace* BS_Carry_Locomotion_15_E7DBF6714CE3714CA4466C9F0623BADA; // 0x28(0x08)
	struct UBlendSpace* BS_Carry_Locomotion_FPV_46_0488917444E7A4D5A24E1FA0F1BE80A8; // 0x30(0x08)
	struct UAnimSequence* End_Game_Walk_18_3B56BD9843A973929F9C3988155F9E33; // 0x38(0x08)
	struct UAnimSequence* Search_Locker_20_17C21A1D41ED7FD778EF8F80B13DDD22; // 0x40(0x08)
	struct UAnimSequence* Land_Light_22_AB1CEA0D44A24466524BD2AF64864915; // 0x48(0x08)
	struct UAnimSequence* Land_Light_FPV_24_E4110DFE41E5829161139CA4181FF0CE; // 0x50(0x08)
	struct UBlendSpace1D* BS_Land_28_6DF82D5440FE21353642E8AE2490A437; // 0x58(0x08)
	struct UBlendSpace1D* BS_Land_FPV_30_7C75AC0E450FA49FE64FCAAF3B5A7BD9; // 0x60(0x08)
	struct UAnimSequence* Walk_To_Fall_33_A5C5BCB143C80C885059568C4903F37C; // 0x68(0x08)
	struct UAnimSequence* Walk_To_Fall_FPV_39_41B9CFBD40D5BCA8F0086D92DBA1DE50; // 0x70(0x08)
	struct UAnimSequence* Carry_Idle_40_C930FC4A43802CA008EB9EA4D8CAE6D1; // 0x78(0x08)
	struct UAnimSequence* Carry_Idle_FPV_41_061F9E3F4617FE2356D0DDAEEF515C61; // 0x80(0x08)
	struct UAnimSequence* Falling_42_B6B41C744ECDDAD8730F2BB7C991C452; // 0x88(0x08)
	struct UAnimSequence* Falling_FPV_43_9ABB0E3C49DA478276C4AF94E24E2A23; // 0x90(0x08)
};

