// BlueprintGeneratedClass BP_Slasher_Character.BP_Slasher_Character_C
// Size: 0x19fd (Inherited: 0x1670)
struct ABP_Slasher_Character_C : ASlasherPlayer {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1670(0x08)
	struct USlasherFootstepPerceptionComponent_C* SlasherFootstepPerceptionComponent; // 0x1678(0x08)
	struct USignificanceManagerComponent* SignificanceManager; // 0x1680(0x08)
	struct USlasherTerrorRadiusEmitterComponent* SlasherTerrorRadiusEmitter; // 0x1688(0x08)
	struct UBPNearestOutsideMapBoundsLocator_C* BPNearestOutsideMapBoundsLocator; // 0x1690(0x08)
	struct UPositionLagCompensationComponent* PositionLagCompensation; // 0x1698(0x08)
	struct UCharacterOptimizer* CharacterOptimizer; // 0x16a0(0x08)
	struct UWiggleMotionComponent* WiggleMotion; // 0x16a8(0x08)
	struct UEtherealComponent* Ethereal; // 0x16b0(0x08)
	struct UKillerFlashlightSFXComponent* KillerFlashlightSFX; // 0x16b8(0x08)
	struct UInteractionAnalyticsComponent* InteractionAnalytics; // 0x16c0(0x08)
	struct UBlindFlashlightTargetFXComponent* BlindFlashlightTargetFX; // 0x16c8(0x08)
	struct UFlashlightableComponent* BodyFlashlightable; // 0x16d0(0x08)
	struct UFlashlightableComponent* EyesFlashlightable; // 0x16d8(0x08)
	struct UBP_KillerLeftFootGroundDetector_C* LeftFootGroundDetector; // 0x16e0(0x08)
	struct UBP_KillerRightFootGroundDetector_C* RightFootGroundDetector; // 0x16e8(0x08)
	struct UQuestEventsHandler* QuestEventsHandler; // 0x16f0(0x08)
	struct UBP_RedStainComponent_C* RedStainComponent; // 0x16f8(0x08)
	struct UGameEventListenerCollectionComponent* GameEventListenerCollection; // 0x1700(0x08)
	struct UCapsulePlayerOverlapComponent* pawnDetector; // 0x1708(0x08)
	struct UScreenSpaceLocationComponent* ScreenSpaceLocation_MiddleT; // 0x1710(0x08)
	struct UParticleSystemComponent* P_Vignette_EndGame_Top; // 0x1718(0x08)
	struct UEndGameEffectsComponent_C* EndGameEffectsComponent; // 0x1720(0x08)
	struct UCameraComponent* Camera1; // 0x1728(0x08)
	struct USlasherOutlineUpdateStrategy* SlasherOutlineUpdateStrategy; // 0x1730(0x08)
	struct UCustomizedAudioComponent* CustomizedAudio; // 0x1738(0x08)
	struct UPostProcessComponent* BlindedPostProcess_new; // 0x1740(0x08)
	struct UStaticMeshComponent* AttackZone_004; // 0x1748(0x08)
	struct USphereComponent* audioAmbientDetector; // 0x1750(0x08)
	struct UStaticMeshComponent* AttackZone_Wedge_Large; // 0x1758(0x08)
	struct UStaticMeshComponent* AttackZone_Wedge_Standard; // 0x1760(0x08)
	struct UPostProcessComponent* VignetteBloodlust; // 0x1768(0x08)
	struct UFirecrackerEffectHandlerComponent* FirecrackerEffectHandler; // 0x1770(0x08)
	struct UStaticMeshComponent* AttackZoneHigh_003; // 0x1778(0x08)
	struct UStaticMeshComponent* AttackZoneHigh_002; // 0x1780(0x08)
	struct UStaticMeshComponent* AttackZoneHigh_001; // 0x1788(0x08)
	struct UBoxComponent* ObstructionShape; // 0x1790(0x08)
	struct UStaticMeshComponent* AttackZone_003; // 0x1798(0x08)
	struct UStaticMeshComponent* AttackZone_002; // 0x17a0(0x08)
	struct UStaticMeshComponent* AttackZone_001; // 0x17a8(0x08)
	struct USceneComponent* attackZonePivot; // 0x17b0(0x08)
	struct UAkComponent* Ak_Audio_Killer; // 0x17b8(0x08)
	struct UBoxComponent* ChainsawObstruction; // 0x17c0(0x08)
	struct UCapsuleComponent* InteractionDetector; // 0x17c8(0x08)
	struct USceneComponent* CamperDropOffPoint; // 0x17d0(0x08)
	struct UDBDOutlineComponent* DBDOutline; // 0x17d8(0x08)
	struct UCustomizedSkeletalMesh* CustomizedSkeletalMesh; // 0x17e0(0x08)
	struct UBP_Mesh2SoundPlayer_C* BP_Mesh2SoundPlayer; // 0x17e8(0x08)
	struct UBoxComponent* BlinkAttackLockZone; // 0x17f0(0x08)
	struct UScreenSpaceLocationComponent* ScreenSpaceLocation_LeftT; // 0x17f8(0x08)
	struct UScreenSpaceLocationComponent* ScreenSpaceLocation_RightT; // 0x1800(0x08)
	struct UParticleSystemComponent* P_Vignette_LeftB; // 0x1808(0x08)
	struct UScreenSpaceLocationComponent* ScreenSpaceLocation_LeftB; // 0x1810(0x08)
	struct UParticleSystemComponent* P_Vignette_RightB; // 0x1818(0x08)
	struct UScreenSpaceLocationComponent* ScreenSpaceLocation_RightB; // 0x1820(0x08)
	struct ULoudNoiseHUDIndicator* LoudNoiseHUDIndicator; // 0x1828(0x08)
	struct UParticleSystemComponent* Fx_FSbloodfx; // 0x1830(0x08)
	float Timeline_0_Distortion_55E19FBE44A263E2F58D6CBD8B8F6FF5; // 0x1838(0x04)
	float Timeline_0_Fade_55E19FBE44A263E2F58D6CBD8B8F6FF5; // 0x183c(0x04)
	enum class ETimelineDirection Timeline_0__Direction_55E19FBE44A263E2F58D6CBD8B8F6FF5; // 0x1840(0x01)
	char pad_1841[0x7]; // 0x1841(0x07)
	struct UTimelineComponent* Timeline_1; // 0x1848(0x08)
	float TML_LungeAttack_Vignette_C6A1D26A45B8D21BE38076A15A900F67; // 0x1850(0x04)
	enum class ETimelineDirection TML_LungeAttack__Direction_C6A1D26A45B8D21BE38076A15A900F67; // 0x1854(0x01)
	char pad_1855[0x3]; // 0x1855(0x03)
	struct UTimelineComponent* TML_LungeAttack; // 0x1858(0x08)
	float BloodSplatterOpacityAnim_NewTrack_0_C8565C8848DC851A61C85CA0D1C69D9F; // 0x1860(0x04)
	enum class ETimelineDirection BloodSplatterOpacityAnim__Direction_C8565C8848DC851A61C85CA0D1C69D9F; // 0x1864(0x01)
	char pad_1865[0x3]; // 0x1865(0x03)
	struct UTimelineComponent* BloodSplatterOpacityAnim; // 0x1868(0x08)
	float BloodSplatterFrameAnim_NewTrack_0_89AF70DC41EF75E7CD3BF6B72CCE267B; // 0x1870(0x04)
	enum class ETimelineDirection BloodSplatterFrameAnim__Direction_89AF70DC41EF75E7CD3BF6B72CCE267B; // 0x1874(0x01)
	char pad_1875[0x3]; // 0x1875(0x03)
	struct UTimelineComponent* BloodSplatterFrameAnim; // 0x1878(0x08)
	float Bloodlust_Timeline_Blend_7510578B48E7070D9984B9923F94253F; // 0x1880(0x04)
	enum class ETimelineDirection Bloodlust_Timeline__Direction_7510578B48E7070D9984B9923F94253F; // 0x1884(0x01)
	char pad_1885[0x3]; // 0x1885(0x03)
	struct UTimelineComponent* Bloodlust Timeline; // 0x1888(0x08)
	float Timeline_1_Dissolve_99584B454ECDABDE86BE6E8CD0241B00; // 0x1890(0x04)
	enum class ETimelineDirection Timeline_1__Direction_99584B454ECDABDE86BE6E8CD0241B00; // 0x1894(0x01)
	char pad_1895[0x3]; // 0x1895(0x03)
	struct UTimelineComponent* Timeline_2; // 0x1898(0x08)
	float BaseTurnRate; // 0x18a0(0x04)
	float BaseLookUpRate; // 0x18a4(0x04)
	char pad_18A8[0x8]; // 0x18a8(0x08)
	struct FTransform CenterOfWorld; // 0x18b0(0x30)
	bool Attack; // 0x18e0(0x01)
	char pad_18E1[0x3]; // 0x18e1(0x03)
	float IsTurning; // 0x18e4(0x04)
	struct UMaterialInstanceDynamic* CharacterHeadMesh; // 0x18e8(0x08)
	struct USkinnedMeshComponent* MeshMachette; // 0x18f0(0x08)
	struct UMaterialInstanceDynamic* Trap Material; // 0x18f8(0x08)
	bool TrapPlacementValid; // 0x1900(0x01)
	char pad_1901[0x3]; // 0x1901(0x03)
	float Trap Indicator Offset; // 0x1904(0x04)
	float BaseMaxWalkSpeed; // 0x1908(0x04)
	float baseTerrorRadius; // 0x190c(0x04)
	struct ACamperPlayer* SurvivorBeingKilled; // 0x1910(0x08)
	struct FString DissolveMaterialGroupName; // 0x1918(0x10)
	struct FString FirstPersonMaterialGroupName; // 0x1928(0x10)
	struct FString DissolveGroupName; // 0x1938(0x10)
	struct FString FirstPersonDissolve; // 0x1948(0x10)
	struct FString FirstPersonGroupName; // 0x1958(0x10)
	bool IsDissolving; // 0x1968(0x01)
	char pad_1969[0x3]; // 0x1969(0x03)
	struct FName Weapon; // 0x196c(0x0c)
	bool RootMeshIsHeadOnly; // 0x1978(0x01)
	char pad_1979[0x3]; // 0x1979(0x03)
	struct FVector TrapPlacementRaycastStart; // 0x197c(0x0c)
	struct FVector TrapPlacementRaycastEnd; // 0x1988(0x0c)
	char pad_1994[0x4]; // 0x1994(0x04)
	struct UMaterialInstanceDynamic* MID_Damage; // 0x1998(0x08)
	struct UMaterialInstanceDynamic* MID_LockOn; // 0x19a0(0x08)
	struct UCurveFloat* BlindnessCurve; // 0x19a8(0x08)
	struct UCurveFloat* BlindnessMaterialCurve; // 0x19b0(0x08)
	struct UMaterialInstanceDynamic* PP_Stun; // 0x19b8(0x08)
	struct UMaterialInstanceDynamic* PP_Smoke; // 0x19c0(0x08)
	struct UMaterialInstanceDynamic* PP_Chase; // 0x19c8(0x08)
	struct UMaterialInstanceDynamic* PP Flashlight; // 0x19d0(0x08)
	struct UMaterialInstanceDynamic* PP_SlasherBlood; // 0x19d8(0x08)
	float DOF Focus Point; // 0x19e0(0x04)
	char pad_19E4[0x4]; // 0x19e4(0x04)
	struct UMaterialInstanceDynamic* PP_LungeAttack; // 0x19e8(0x08)
	struct FName CameraSocketName; // 0x19f0(0x0c)
	bool IsSnowmanActive?; // 0x19fc(0x01)

	void GetTrapPlacementLocation_World(struct FVector& World Location); // Function BP_Slasher_Character.BP_Slasher_Character_C.GetTrapPlacementLocation_World // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x5e02c90
	void GetSlasherAudioComponent(struct UAkComponent*& Audio Component); // Function BP_Slasher_Character.BP_Slasher_Character_C.GetSlasherAudioComponent // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x5e02c90
	void IsTrapPlacementValid(bool& Result); // Function BP_Slasher_Character.BP_Slasher_Character_C.IsTrapPlacementValid // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x5e02c90
	void SetAudioSwitchSubKillerState(struct FString switchState); // Function BP_Slasher_Character.BP_Slasher_Character_C.SetAudioSwitchSubKillerState // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x5e02c90
