// Class ChaosNiagara.NiagaraDataInterfaceChaosDestruction
// Size: 0x240 (Inherited: 0x40)
struct UNiagaraDataInterfaceChaosDestruction : UNiagaraDataInterface {
	struct TSet<struct AChaosSolverActor*> ChaosSolverActorSet; // 0x40(0x50)
	enum class EDataSourceTypeEnum DataSourceType; // 0x90(0x01)
	char pad_91[0x3]; // 0x91(0x03)
	int32_t DataProcessFrequency; // 0x94(0x04)
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x98(0x04)
	bool DoSpawn; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	struct FVector2D SpawnMultiplierMinMax; // 0xa0(0x08)
	float SpawnChance; // 0xa8(0x04)
	struct FVector2D ImpulseToSpawnMinMax; // 0xac(0x08)
	struct FVector2D SpeedToSpawnMinMax; // 0xb4(0x08)
	struct FVector2D MassToSpawnMinMax; // 0xbc(0x08)
	struct FVector2D ExtentMinToSpawnMinMax; // 0xc4(0x08)
	struct FVector2D ExtentMaxToSpawnMinMax; // 0xcc(0x08)
	struct FVector2D VolumeToSpawnMinMax; // 0xd4(0x08)
	struct FVector2D SolverTimeToSpawnMinMax; // 0xdc(0x08)
	int32_t SurfaceTypeToSpawn; // 0xe4(0x04)
	enum class ELocationFilteringModeEnum LocationFilteringMode; // 0xe8(0x01)
	enum class ELocationXToSpawnEnum LocationXToSpawn; // 0xe9(0x01)
	char pad_EA[0x2]; // 0xea(0x02)
	struct FVector2D LocationXToSpawnMinMax; // 0xec(0x08)
	enum class ELocationYToSpawnEnum LocationYToSpawn; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	struct FVector2D LocationYToSpawnMinMax; // 0xf8(0x08)
	enum class ELocationZToSpawnEnum LocationZToSpawn; // 0x100(0x01)
	char pad_101[0x3]; // 0x101(0x03)
	struct FVector2D LocationZToSpawnMinMax; // 0x104(0x08)
	enum class EDataSortTypeEnum DataSortingType; // 0x10c(0x01)
	bool bGetExternalCollisionData; // 0x10d(0x01)
	bool DoSpatialHash; // 0x10e(0x01)
	char pad_10F[0x1]; // 0x10f(0x01)
	struct FVector SpatialHashVolumeMin; // 0x110(0x0c)
	struct FVector SpatialHashVolumeMax; // 0x11c(0x0c)
	struct FVector SpatialHashVolumeCellSize; // 0x128(0x0c)
	int32_t MaxDataPerCell; // 0x134(0x04)
	bool bApplyMaterialsFilter; // 0x138(0x01)
	char pad_139[0x7]; // 0x139(0x07)
	struct TSet<struct UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x140(0x50)
	bool bGetExternalBreakingData; // 0x190(0x01)
	bool bGetExternalTrailingData; // 0x191(0x01)
	char pad_192[0x2]; // 0x192(0x02)
	struct FVector2D RandomPositionMagnitudeMinMax; // 0x194(0x08)
	float InheritedVelocityMultiplier; // 0x19c(0x04)
	enum class ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x1a0(0x01)
	char pad_1A1[0x3]; // 0x1a1(0x03)
	struct FVector2D RandomVelocityMagnitudeMinMax; // 0x1a4(0x08)
	float SpreadAngleMax; // 0x1ac(0x04)
	struct FVector VelocityOffsetMin; // 0x1b0(0x0c)
	struct FVector VelocityOffsetMax; // 0x1bc(0x0c)
	struct FVector2D FinalVelocityMagnitudeMinMax; // 0x1c8(0x08)
	float MaxLatency; // 0x1d0(0x04)
	enum class EDebugTypeEnum DebugType; // 0x1d4(0x01)
	char pad_1D5[0x3]; // 0x1d5(0x03)
	int32_t LastSpawnedPointID; // 0x1d8(0x04)
	float LastSpawnTime; // 0x1dc(0x04)
	char pad_1E0[0x10]; // 0x1e0(0x10)
	float SolverTime; // 0x1f0(0x04)
	float TimeStampOfLastProcessedData; // 0x1f4(0x04)
	char pad_1F8[0x48]; // 0x1f8(0x48)
};

// Class ChaosNiagara.NiagaraDataInterfacePhysicsField
// Size: 0x40 (Inherited: 0x40)
struct UNiagaraDataInterfacePhysicsField : UNiagaraDataInterface {
};

