// Class DeadByDaylight.InteractionDefinition
// Size: 0x630 (Inherited: 0x220)
struct UInteractionDefinition : USceneComponent {
	char pad_220[0x38]; // 0x220(0x38)
	struct FString InteractionID; // 0x258(0x10)
	float SnapTime; // 0x268(0x04)
	bool ResetCameraDuringSnap; // 0x26c(0x01)
	bool IsInteractionCancelled; // 0x26d(0x01)
	bool AllowStartInteractionFromHeldInput; // 0x26e(0x01)
	bool StopInteractionOnMontageComplete; // 0x26f(0x01)
	bool StopInteractionOnMontageBlendingOut; // 0x270(0x01)
	bool StopInteractionOnTimerExpire; // 0x271(0x01)
	bool StopInteractionOnHeightDelta; // 0x272(0x01)
	bool StopEnterMontageOnExit; // 0x273(0x01)
	bool StopUpdateMontageOnExit; // 0x274(0x01)
	bool IgnoreStrafeAnimFix; // 0x275(0x01)
	enum class EInteractionAnimation InteractionAnimation; // 0x276(0x01)
	bool CamperCanInteract; // 0x277(0x01)
	bool SlasherCanInteract; // 0x278(0x01)
	bool AllowInputPersistence; // 0x279(0x01)
	bool snapPosition; // 0x27a(0x01)
	bool snapRotation; // 0x27b(0x01)
	float SnapStopDistance; // 0x27c(0x04)
	bool TestClearPathDuringSnap; // 0x280(0x01)
	bool MustBeClosestPlayerToSnapPoint; // 0x281(0x01)
	bool CheckInteractableIsInPlayerView; // 0x282(0x01)
	char pad_283[0x1]; // 0x283(0x01)
	float CheckInteractableInViewSphereSweepRadius; // 0x284(0x04)
	struct FVector CheckInteractableInViewOffset; // 0x288(0x0c)
	float CheckInteractableInViewOffsetDistanceToHitPoint; // 0x294(0x04)
	bool IsInterruptibleIfTestClearPathDuringSnapFails; // 0x298(0x01)
	bool TestPlayerOrientationOnSnap; // 0x299(0x01)
	bool ScaleEnterAnimationToTime; // 0x29a(0x01)
	bool ScaleMainAnimationToTime; // 0x29b(0x01)
	bool ScaleExitAnimationToTime; // 0x29c(0x01)
	enum class ESnapBackType SnapBackType; // 0x29d(0x01)
	enum class ESnapBackPositionType SnapBackPositionType; // 0x29e(0x01)
	char pad_29F[0x1]; // 0x29f(0x01)
	struct FVector2D SnapBackPositionOffset; // 0x2a0(0x08)
	bool SnapToInitialRotationDuringSnapBack; // 0x2a8(0x01)
	bool UseStartSnapTimeForSnapExitTime; // 0x2a9(0x01)
	bool CanInteractWhileIncapacitated; // 0x2aa(0x01)
	bool CanInteractWhileCloaked; // 0x2ab(0x01)
	bool CanInteractWhileAttacking; // 0x2ac(0x01)
	bool CanInteractWhileChainLinked; // 0x2ad(0x01)
	bool CanInteractWhileShocked; // 0x2ae(0x01)
	bool CanInteractWhileUnhookingSelf; // 0x2af(0x01)
	bool CanInteractWhileCarrying; // 0x2b0(0x01)
	bool AllowNavigation; // 0x2b1(0x01)
	bool AllowNavigationInput; // 0x2b2(0x01)
	bool AllowRotation; // 0x2b3(0x01)
	bool UseCameraMontageMode; // 0x2b4(0x01)
	bool OwnerBlocksAttack; // 0x2b5(0x01)
	bool IsHighPriority; // 0x2b6(0x01)
	bool AllowOverridingWhenNotForced; // 0x2b7(0x01)
	bool IgnoreOverlapOnInteractable; // 0x2b8(0x01)
	bool UseAuthoritativeMovement; // 0x2b9(0x01)
	bool CanBeAuthoritativePushedDuringEnter; // 0x2ba(0x01)
	bool CanBeAuthoritativePushedDuringUpdate; // 0x2bb(0x01)
	bool CanBeAuthoritativePushedDuringExit; // 0x2bc(0x01)
	bool CanAuthoritativePush; // 0x2bd(0x01)
	bool CancelOnHit; // 0x2be(0x01)
	bool CancelOnAttack; // 0x2bf(0x01)
	bool HideItem; // 0x2c0(0x01)
	bool AutoBindToParentInteractor; // 0x2c1(0x01)
	bool AutoBindToParentZone; // 0x2c2(0x01)
	char pad_2C3[0x1]; // 0x2c3(0x01)
	float CancelOnMoveInitialDelay; // 0x2c4(0x04)
	float CancelOnMoveInput; // 0x2c8(0x04)
	bool CancelOnMoveInputOnlyWhenRunning; // 0x2cc(0x01)
	char pad_2CD[0x3]; // 0x2cd(0x03)
	struct TArray<float> ProgressBasedSkillChecks; // 0x2d0(0x10)
	bool CanCrouch; // 0x2e0(0x01)
	bool AffectsStillness; // 0x2e1(0x01)
	bool ConsideredIdle; // 0x2e2(0x01)
	bool BlockSelfInteract; // 0x2e3(0x01)
	float InteractionTime; // 0x2e4(0x04)
	enum class EInputInteractionType interactionInputType; // 0x2e8(0x01)
	bool StopInteractionOnInputRelease; // 0x2e9(0x01)
	bool AllowHitMontageWhenInteracting; // 0x2ea(0x01)
	bool ShowBasicInteractionIcon; // 0x2eb(0x01)
	char pad_2EC[0x4]; // 0x2ec(0x04)
	struct TArray<struct UInterruptionDefinition*> _interruptionDefinitions; // 0x2f0(0x10)
	struct FMulticastInlineDelegate OnInteractionEnteredDelegate; // 0x300(0x10)
	char pad_310[0x30]; // 0x310(0x30)
	struct FMulticastInlineDelegate OnInteractionFinishedDelegate; // 0x340(0x10)
	struct FMulticastInlineDelegate OnInteractionInterruptedStartDelegate; // 0x350(0x10)
	struct FMulticastInlineDelegate OnInteractionInterruptedStartedDelegate; // 0x360(0x10)
	struct FMulticastInlineDelegate OnInteractionInterruptedEndDelegate; // 0x370(0x10)
	struct FMulticastInlineDelegate OnInteractionAnimNotify; // 0x380(0x10)
	bool DebugUnavailability; // 0x390(0x01)
	enum class EInputInteractionType SecondaryActionInputType; // 0x391(0x01)
	char pad_392[0x1e]; // 0x392(0x1e)
	struct UCurveFloat* NavigationSpeedCurveEnter; // 0x3b0(0x08)
	struct UCurveFloat* NavigationSpeedCurve; // 0x3b8(0x08)
	struct UCurveFloat* NavigationSpeedCurveExit; // 0x3c0(0x08)
	bool _shouldCheckInteractedUpon; // 0x3c8(0x01)
	enum class EInteractionOwnership OwnershipUsability; // 0x3c9(0x01)
	char pad_3CA[0x2]; // 0x3ca(0x02)
	float ExitInteractionTime; // 0x3cc(0x04)
	bool ApplyModifiersToExitTime; // 0x3d0(0x01)
	char pad_3D1[0x7]; // 0x3d1(0x07)
	struct FText InteractionDescriptionText; // 0x3d8(0x18)
	bool InteractionCanBeToggled; // 0x3f0(0x01)
	bool IsOverridingInputToggleReleasePromptMessage; // 0x3f1(0x01)
	char pad_3F2[0x6]; // 0x3f2(0x06)
	struct FString InputToggleReleasePromptMessage; // 0x3f8(0x10)
	bool IgnoreSprintToCancelSetting; // 0x408(0x01)
	bool ForceWithSprintToCancelSetting; // 0x409(0x01)
	char pad_40A[0x2]; // 0x40a(0x02)
	float InteractionHeightDeltaMax; // 0x40c(0x04)
	float MaximumVelocity; // 0x410(0x04)
	char pad_414[0x4]; // 0x414(0x04)
	struct FAnimationMontageDescriptor EnterMontage; // 0x418(0x20)
	struct FAnimationMontageDescriptor UpdateMontage; // 0x438(0x20)
	struct FAnimationMontageDescriptor ExitMontage; // 0x458(0x20)
	struct TArray<struct FName> EnterMontageVariantCycle; // 0x478(0x10)
	struct TArray<struct FName> UpdateMontageVariantCycle; // 0x488(0x10)
	struct TArray<struct FName> ExitMontageVariantCycle; // 0x498(0x10)
	struct FName SnapSocketName; // 0x4a8(0x0c)
	bool _canBeAttachedToAnyZone; // 0x4b4(0x01)
	bool _isInterruptibleBySacrifice; // 0x4b5(0x01)
	bool IgnoreStun; // 0x4b6(0x01)
	char pad_4B7[0x1]; // 0x4b7(0x01)
	struct FGameplayTagContainer _tags; // 0x4b8(0x20)
	struct FGameplayTag _objectStateTag; // 0x4d8(0x0c)
	char pad_4E4[0x4]; // 0x4e4(0x04)
	struct TMap<struct FName, struct FSecondaryInteractionProperties> _secondaryInteractions; // 0x4e8(0x50)
	bool _useHoldPrompt; // 0x538(0x01)
	bool _allowInteractionInNarrowSpaces; // 0x539(0x01)
	bool _allowIKSensorDuringInteraction; // 0x53a(0x01)
	bool _overrideSlashableRelativeLocation; // 0x53b(0x01)
	struct FVector _slashableRelativeLocation; // 0x53c(0x0c)
	bool _startUpdateMontageDuringEnter; // 0x548(0x01)
	char pad_549[0x7]; // 0x549(0x07)
	struct UInteractor* _interactor; // 0x550(0x08)
	struct TArray<struct UInteractionDefinition*> _mutuallyExclusiveInteractionsClient; // 0x558(0x10)
	struct FActivationDefinition _activationDefinition; // 0x568(0x28)
	struct UPrimitiveComponent* _zone; // 0x590(0x08)
	enum class EInputInteractionType _cancelInputType; // 0x598(0x01)
	char pad_599[0x7]; // 0x599(0x07)
	struct FGameplayTagContainer _preventingTags; // 0x5a0(0x20)
	struct FGameplayTagContainer _disablingTags; // 0x5c0(0x20)
	struct TArray<struct UPlayerInteractionHandler*> _evaluatingInteractionHandlers; // 0x5e0(0x10)
	struct FSecondaryInteractionProperties DEPRECATED_SecondaryInteractionProperties; // 0x5f0(0x38)
	char pad_628[0x8]; // 0x628(0x08)

	void UpdateSlashableLocation(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.UpdateSlashableLocation // (Final|Native|Public|BlueprintCallable) // @ game+0x5541790
	bool ShouldStartUpdateMontageDuringEnter(struct ADBDPlayer* Character); // Function DeadByDaylight.InteractionDefinition.ShouldStartUpdateMontageDuringEnter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55416f0
	void SetSecondaryActionInputType(enum class EInputInteractionType inputType); // Function DeadByDaylight.InteractionDefinition.SetSecondaryActionInputType // (Final|Native|Public|BlueprintCallable) // @ game+0x5541670
	void ResetSlashableLocation(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.ResetSlashableLocation // (Final|Native|Public|BlueprintCallable) // @ game+0x55415e0
	void RemoveExclusiveInteraction(struct UInteractionDefinition* Interaction); // Function DeadByDaylight.InteractionDefinition.RemoveExclusiveInteraction // (Final|Native|Public|BlueprintCallable) // @ game+0x5541550
	void RemoveDisablingTags(struct FGameplayTag tagToRemove); // Function DeadByDaylight.InteractionDefinition.RemoveDisablingTags // (Final|Native|Public|BlueprintCallable) // @ game+0x55414b0
	void OnUpdateMontageStart(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.OnUpdateMontageStart // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnInterruptorUpdateStart(struct UInterruptionDefinition* currentInterruption, struct ADBDPlayer* interruptor, struct ADBDPlayer* interruptee); // Function DeadByDaylight.InteractionDefinition.OnInterruptorUpdateStart // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionUpdateTick(struct ADBDPlayer* Player, float DeltaTime); // Function DeadByDaylight.InteractionDefinition.OnInteractionUpdateTick // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionUpdateStart(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.OnInteractionUpdateStart // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionUpdateMontageReachedMiddle(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.OnInteractionUpdateMontageReachedMiddle // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionUpdateEnd(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.OnInteractionUpdateEnd // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionInterruptStarted(struct ADBDPlayer* Player, struct UInterruptionDefinition* currentInterruption, struct ADBDPlayer* interruptingPlayer); // Function DeadByDaylight.InteractionDefinition.OnInteractionInterruptStarted // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionInterruptStart(struct ADBDPlayer* Player, struct UInterruptionDefinition* currentInterruption, struct ADBDPlayer* interruptingPlayer); // Function DeadByDaylight.InteractionDefinition.OnInteractionInterruptStart // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionInterruptEnd(struct ADBDPlayer* Player, struct UInterruptionDefinition* currentInterruption, struct ADBDPlayer* interruptingPlayer); // Function DeadByDaylight.InteractionDefinition.OnInteractionInterruptEnd // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionInit(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.OnInteractionInit // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionFinished(struct ADBDPlayer* Player, bool hasInteractionStarted); // Function DeadByDaylight.InteractionDefinition.OnInteractionFinished // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionExitTick(struct ADBDPlayer* Player, float DeltaTime); // Function DeadByDaylight.InteractionDefinition.OnInteractionExitTick // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionExitStart(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.OnInteractionExitStart // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionExitEnd(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.OnInteractionExitEnd // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionEnterTick(struct ADBDPlayer* Player, float DeltaTime); // Function DeadByDaylight.InteractionDefinition.OnInteractionEnterTick // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionEnterStart(struct ADBDPlayer* Player, float actualSnapTime); // Function DeadByDaylight.InteractionDefinition.OnInteractionEnterStart // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionEnterEnd(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.OnInteractionEnterEnd // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionCancelled(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.OnInteractionCancelled // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractionAnimNotifyEvent(struct FName NotifyId, struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.OnInteractionAnimNotifyEvent // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	bool IsSupportedCharacterType(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.IsSupportedCharacterType // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5541410
	bool IsInterruptionPossible(struct ADBDPlayer* interruptor, struct ADBDPlayer* interruptee, struct UInterruptionDefinition* interruption); // Function DeadByDaylight.InteractionDefinition.IsInterruptionPossible // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x55412f0
	bool IsInteractionUsingOffering(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.IsInteractionUsingOffering // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x5541250
	bool IsInteractionPossibleClient(struct ADBDPlayer* Player, enum class EInputInteractionType interactionType); // Function DeadByDaylight.InteractionDefinition.IsInteractionPossibleClient // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x5541180
	bool IsInteractionPossibleBP(struct ADBDPlayer* Player, enum class EInputInteractionType interactionType); // Function DeadByDaylight.InteractionDefinition.IsInteractionPossibleBP // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x55410b0
	bool IsInteractionPossible(struct ADBDPlayer* Player, enum class EInputInteractionType interactionType, bool performClientCheck, bool performHeightCheck, bool isBotPredictionCheck); // Function DeadByDaylight.InteractionDefinition.IsInteractionPossible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540ee0
	bool IsInteractionDone(struct ADBDPlayer* Player, enum class EInputInteractionType interactionType); // Function DeadByDaylight.InteractionDefinition.IsInteractionDone // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x5540e10
	bool IsInteractableInPlayerView(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.IsInteractableInPlayerView // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540d70
	bool IsInputPressed(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.IsInputPressed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540cd0
	bool IsCharacterFacingInteractorDirection(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.IsCharacterFacingInteractorDirection // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540c30
	bool IsCancelable(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.IsCancelable // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x5540b90
	void InteractionInterruptedDelegate__DelegateSignature(); // DelegateFunction DeadByDaylight.InteractionDefinition.InteractionInterruptedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x5e02c90
	void InteractionFinishedDelegate__DelegateSignature(); // DelegateFunction DeadByDaylight.InteractionDefinition.InteractionFinishedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x5e02c90
	void InteractionEnteredDelegate__DelegateSignature(struct ADBDPlayer* Player); // DelegateFunction DeadByDaylight.InteractionDefinition.InteractionEnteredDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x5e02c90
	struct FAnimationMontageDescriptor GetUpdateMontage(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetUpdateMontage // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x5540ad0
	float GetUpdateAnimationPlayRate(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetUpdateAnimationPlayRate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540a30
	struct FMontagePlaybackDefinition GetUpdateAnimationPlayBackDefinition(struct ADBDPlayer* Player, bool Follower); // Function DeadByDaylight.InteractionDefinition.GetUpdateAnimationPlayBackDefinition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540920
	float GetSnapTimeAtStart(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetSnapTimeAtStart // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540880
	float GetSnapTime(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetSnapTime // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x55407e0
	struct FName GetSnapSocketName(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetSnapSocketName // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x5540730
	struct FVector GetSnapPointPositionAtStart(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetSnapPointPositionAtStart // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540680
	struct FVector GetSnapPointPosition(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetSnapPointPosition // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x55405d0
	float GetSnapDistanceAtStart(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetSnapDistanceAtStart // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540530
	float GetSnapDistance(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetSnapDistance // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x5540490
	struct FVector GetSlashableRelativeLocation(); // Function DeadByDaylight.InteractionDefinition.GetSlashableRelativeLocation // (Native|Event|Public|HasDefaults|BlueprintEvent|Const) // @ game+0x5540450
	enum class EInputInteractionType GetSecondaryActionInputType(struct UObject* WorldContextObject); // Function DeadByDaylight.InteractionDefinition.GetSecondaryActionInputType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55403b0
	struct FRotator GetRotationToSnapPointAtStart(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetRotationToSnapPointAtStart // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540300
	struct FRotator GetRotationToSnapPoint(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetRotationToSnapPoint // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x5540250
	struct ADBDPlayer* GetPlayerDependency(struct ADBDPlayer* interactingPlayer); // Function DeadByDaylight.InteractionDefinition.GetPlayerDependency // (Native|Event|Public|BlueprintEvent) // @ game+0x55401b0
	struct TArray<struct UInterruptionDefinition*> GetInterruptionDefinitions(); // Function DeadByDaylight.InteractionDefinition.GetInterruptionDefinitions // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5540120
	struct UInteractor* GetInteractor(); // Function DeadByDaylight.InteractionDefinition.GetInteractor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55400f0
	float GetInteractionTimeMultiplier(struct ADBDPlayer* Character); // Function DeadByDaylight.InteractionDefinition.GetInteractionTimeMultiplier // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x5540050
	float GetInteractionTime(struct ADBDPlayer* Character); // Function DeadByDaylight.InteractionDefinition.GetInteractionTime // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553ffb0
	struct FString GetInteractionText(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetInteractionText // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x553fed0
	float GetInteractionExitTime(struct ADBDPlayer* Character); // Function DeadByDaylight.InteractionDefinition.GetInteractionExitTime // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x553fe30
	struct FText GetInteractionDescriptionText(); // Function DeadByDaylight.InteractionDefinition.GetInteractionDescriptionText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553fe00
	struct AInteractable* GetInteractable(); // Function DeadByDaylight.InteractionDefinition.GetInteractable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553fdd0
	struct FVector GetFocalPointPosition(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetFocalPointPosition // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x553fd20
	struct FAnimationMontageDescriptor GetExitMontage(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetExitMontage // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x553fc60
	float GetExitAnimationPlayRate(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetExitAnimationPlayRate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553fbc0
	struct FMontagePlaybackDefinition GetExitAnimationPlayBackDefinition(struct ADBDPlayer* Player, bool Follower); // Function DeadByDaylight.InteractionDefinition.GetExitAnimationPlayBackDefinition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553fab0
	struct FAnimationMontageDescriptor GetEnterMontage(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetEnterMontage // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x553f9f0
	struct FMontagePlaybackDefinition GetEnterAnimationPlayBackDefinition(struct ADBDPlayer* Player, bool Follower); // Function DeadByDaylight.InteractionDefinition.GetEnterAnimationPlayBackDefinition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553f8e0
	float GetChargePercent(); // Function DeadByDaylight.InteractionDefinition.GetChargePercent // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553f8a0
	bool GetAllowNavigation(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetAllowNavigation // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x553f800
	struct FVector GetActualSnapPointPositionAtStart(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetActualSnapPointPositionAtStart // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x553f750
	struct FVector GetActualSnapPointPosition(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetActualSnapPointPosition // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x553f6a0
	struct TArray<struct AActor*> GetActorsToIgnoreOverlap(); // Function DeadByDaylight.InteractionDefinition.GetActorsToIgnoreOverlap // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x553f620
	float GetActorHeightDelta(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.GetActorHeightDelta // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553f580
	float GetActionSpeedMultiplier(struct ADBDPlayer* Character); // Function DeadByDaylight.InteractionDefinition.GetActionSpeedMultiplier // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553f4e0
	bool DoesPlayerHaveClearPath(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.DoesPlayerHaveClearPath // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553f440
	void CompleteCharge(struct ADBDPlayer* Character); // Function DeadByDaylight.InteractionDefinition.CompleteCharge // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x553f3b0
	enum class EInteractionComparisonPriority ComparePriorityToInteraction(struct UInteractionDefinition* Interaction); // Function DeadByDaylight.InteractionDefinition.ComparePriorityToInteraction // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x553f310
	bool CanOverrideInteraction(struct UInteractionDefinition* Interaction); // Function DeadByDaylight.InteractionDefinition.CanOverrideInteraction // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x553f270
	float CalculateSnapTimeForConstantSpeed(struct ADBDPlayer* Player, float Speed); // Function DeadByDaylight.InteractionDefinition.CalculateSnapTimeForConstantSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553f1a0
	float CalculateSnapTimeForConstantMaxNormalMovementSpeed(struct ADBDPlayer* Player, float speedBoost); // Function DeadByDaylight.InteractionDefinition.CalculateSnapTimeForConstantMaxNormalMovementSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553f0d0
	void Authority_OnInteractionAuthorized(struct ADBDPlayer* Player); // Function DeadByDaylight.InteractionDefinition.Authority_OnInteractionAuthorized // (BlueprintAuthorityOnly|Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void AttachToZone(struct UPrimitiveComponent* zone); // Function DeadByDaylight.InteractionDefinition.AttachToZone // (Final|Native|Public|BlueprintCallable) // @ game+0x553f040
	void AttachToInteractor(struct UInteractor* Interactor); // Function DeadByDaylight.InteractionDefinition.AttachToInteractor // (Final|Native|Public|BlueprintCallable) // @ game+0x553efb0
	void AddMutuallyExclusiveInteraction(struct UInteractionDefinition* Interaction); // Function DeadByDaylight.InteractionDefinition.AddMutuallyExclusiveInteraction // (Final|Native|Public|BlueprintCallable) // @ game+0x553ef20
	void AddDisablingTags(struct FGameplayTag tagToAdd); // Function DeadByDaylight.InteractionDefinition.AddDisablingTags // (Final|Native|Public|BlueprintCallable) // @ game+0x553ee80
};

// Class DeadByDaylight.ChargeableInteractionDefinition
// Size: 0x760 (Inherited: 0x630)
struct UChargeableInteractionDefinition : UInteractionDefinition {
	char pad_630[0x18]; // 0x630(0x18)
	struct FMulticastInlineDelegate SkillCheckResponseAestheticDelegate; // 0x648(0x10)
	struct FMulticastInlineDelegate SkillCheckResponseAuthorityDelegate; // 0x658(0x10)
	bool StopInteractionOnChargeComplete; // 0x668(0x01)
	bool HasProgressivelyHarderSkillChecks; // 0x669(0x01)
	char pad_66A[0x2]; // 0x66a(0x02)
	float ProgressiveDifficultyModifier; // 0x66c(0x04)
	enum class EChargeableInteractionBarType ProgressBarType; // 0x670(0x01)
	char pad_671[0x7]; // 0x671(0x07)
	struct TArray<float> ProgressPips; // 0x678(0x10)
	bool HideProgressBar; // 0x688(0x01)
	bool ShowItemIcon; // 0x689(0x01)
	char pad_68A[0x6]; // 0x68a(0x06)
	struct UChargeableComponent* _chargeableComponent; // 0x690(0x08)
	float _tutorialChargeableMultiplier; // 0x698(0x04)
	char pad_69C[0x54]; // 0x69c(0x54)
	bool ShowSpeedProficiencyForMultipleInteractors; // 0x6f0(0x01)
	char pad_6F1[0x7]; // 0x6f1(0x07)
	struct FGameplayTagContainer _interactionSpecificActionSpeedTags; // 0x6f8(0x20)
	struct FGameplayTagContainer _interactionSpecificActionSpeedMultiplicativeTags; // 0x718(0x20)
	struct FGameplayTagContainer _interactionSpecificActionDurationAdditiveTags; // 0x738(0x20)
	char pad_758[0x8]; // 0x758(0x08)

	bool ShouldShowSpeedProficiencyForMultipleInteractors(); // Function DeadByDaylight.ChargeableInteractionDefinition.ShouldShowSpeedProficiencyForMultipleInteractors // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a6e90
	void SetTutorialChargeableMultiplier(float multiplierValue); // Function DeadByDaylight.ChargeableInteractionDefinition.SetTutorialChargeableMultiplier // (Final|Native|Public|BlueprintCallable) // @ game+0x54a6e10
	void SetSpeedBase(float speedBase); // Function DeadByDaylight.ChargeableInteractionDefinition.SetSpeedBase // (Final|Native|Public|BlueprintCallable) // @ game+0x54a6d90
	void SetSecondsToCharge(float SecondsToCharge); // Function DeadByDaylight.ChargeableInteractionDefinition.SetSecondsToCharge // (Final|Native|Public|BlueprintCallable) // @ game+0x54a6d10
	void SetChargeableComponent(struct UChargeableComponent* ChargeableComponent, bool isNullAllowed); // Function DeadByDaylight.ChargeableInteractionDefinition.SetChargeableComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x54a6b40
	void OnSkillCheckResponseAuthorityBP(struct ADBDPlayer* Player, bool success, bool Bonus, bool hadInput, enum class ESkillCheckCustomType Type); // Function DeadByDaylight.ChargeableInteractionDefinition.OnSkillCheckResponseAuthorityBP // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnSkillCheckResponseAuthority(bool success, bool Bonus, struct ADBDPlayer* Player, bool TriggerLoudNoise, bool hadInput, enum class ESkillCheckCustomType Type); // Function DeadByDaylight.ChargeableInteractionDefinition.OnSkillCheckResponseAuthority // (Native|Protected) // @ game+0x54a6940
	void OnSkillCheckResponseAestheticBP(struct ADBDPlayer* Player, bool success, bool Bonus, bool hadInput, enum class ESkillCheckCustomType Type); // Function DeadByDaylight.ChargeableInteractionDefinition.OnSkillCheckResponseAestheticBP // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnSkillCheckResponseAesthetic(bool success, bool Bonus, struct ADBDPlayer* Player, bool TriggerLoudNoise, bool hadInput, enum class ESkillCheckCustomType Type); // Function DeadByDaylight.ChargeableInteractionDefinition.OnSkillCheckResponseAesthetic // (Native|Protected) // @ game+0x54a6740
	void OnInteractionCompletionStateChanged(struct ADBDPlayer* Player, bool complete); // Function DeadByDaylight.ChargeableInteractionDefinition.OnInteractionCompletionStateChanged // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	bool IsChargeComplete(struct ADBDPlayer* currentlyInteractingPlayer); // Function DeadByDaylight.ChargeableInteractionDefinition.IsChargeComplete // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a6560
	bool HasSkillCheckHappened(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.HasSkillCheckHappened // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a6410
	float GetTunableValue(struct FName TunableValueID, float defaultValue); // Function DeadByDaylight.ChargeableInteractionDefinition.GetTunableValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a6270
	float GetSuccessProbability(); // Function DeadByDaylight.ChargeableInteractionDefinition.GetSuccessProbability // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54a6180
	float GetSkillCheckProbability(struct ADBDPlayer* interactingPlayer); // Function DeadByDaylight.ChargeableInteractionDefinition.GetSkillCheckProbability // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a60e0
	float GetSkillCheckFailureTimePenalty(); // Function DeadByDaylight.ChargeableInteractionDefinition.GetSkillCheckFailureTimePenalty // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x54a60a0
	float GetSkillCheckFailurePercentPenalty(struct ADBDPlayer* Player); // Function DeadByDaylight.ChargeableInteractionDefinition.GetSkillCheckFailurePercentPenalty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a6000
	float GetSkillCheckDifficulityModifier(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.GetSkillCheckDifficulityModifier // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54a5f60
	float GetSkillCheckCharge(struct ADBDPlayer* Player, bool success, bool Bonus, enum class ESkillCheckCustomType Type); // Function DeadByDaylight.ChargeableInteractionDefinition.GetSkillCheckCharge // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x54a5dd0
	int32_t GetPipsPassed(); // Function DeadByDaylight.ChargeableInteractionDefinition.GetPipsPassed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a5d00
	float GetPerkMultiplier(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.GetPerkMultiplier // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54a5c30
	float GetMultiplicativeLuckBonus(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.GetMultiplicativeLuckBonus // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54a5b60
	float GetMaxCharge(); // Function DeadByDaylight.ChargeableInteractionDefinition.GetMaxCharge // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a5b30
	float GetItemEfficiencyModifier(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.GetItemEfficiencyModifier // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54a5a60
	float GetInteractionChargeSpeedMultiplier(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.GetInteractionChargeSpeedMultiplier // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x4d7fe70
	float GetGoodSkillCheckSuccessPercentReward(struct ADBDPlayer* Player); // Function DeadByDaylight.ChargeableInteractionDefinition.GetGoodSkillCheckSuccessPercentReward // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a59c0
	float GetChargeSpeedModifier(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.GetChargeSpeedModifier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a5710
	float GetChargeAmountForTime(float DeltaSeconds, struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.GetChargeAmountForTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a5610
	struct UChargeableComponent* GetChargeableComponent(); // Function DeadByDaylight.ChargeableInteractionDefinition.GetChargeableComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a57b0
	float GetBonusSkillCheckZoneSizeModifier(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.GetBonusSkillCheckZoneSizeModifier // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54a5570
	float GetBonusSkillCheckSuccessPercentReward(struct ADBDPlayer* Player); // Function DeadByDaylight.ChargeableInteractionDefinition.GetBonusSkillCheckSuccessPercentReward // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a54d0
	float GetAdditiveLuckBonus(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.GetAdditiveLuckBonus // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54a5430
	float GetAdditiveChargeTimeReductionAsMultiplier(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.GetAdditiveChargeTimeReductionAsMultiplier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a5390
	void Authority_ResetCharge(struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.Authority_ResetCharge // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x54a5100
	void Authority_ChargeWithItem(float DeltaSeconds, struct ACollectable* Item, struct ADBDPlayer* Character); // Function DeadByDaylight.ChargeableInteractionDefinition.Authority_ChargeWithItem // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x54a4fc0
	void Authority_AddCharge(float DeltaSeconds, struct ADBDPlayer* Character, bool isChargeFromItem); // Function DeadByDaylight.ChargeableInteractionDefinition.Authority_AddCharge // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x54a4cc0
};

// Class DeadByDaylight.Interactable
// Size: 0x338 (Inherited: 0x230)
struct AInteractable : AActor {
	char pad_230[0x68]; // 0x230(0x68)
	struct UPrimitiveComponent* _singleZone; // 0x298(0x08)
	bool _useSingleZone; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
	struct TArray<struct UInteractor*> _interactors; // 0x2a8(0x10)
	struct UInteractableTransformOptimizer* _transformOptimizer; // 0x2b8(0x08)
	char pad_2C0[0x20]; // 0x2c0(0x20)
	struct TMap<struct UPrimitiveComponent*, struct FInteractionArray> _zoneToInteractions; // 0x2e0(0x50)
	struct UGameplayTagContainerComponent* _interactableObjectState; // 0x330(0x08)

	void SetSingleZone(struct UPrimitiveComponent* zone); // Function DeadByDaylight.Interactable.SetSingleZone // (Final|Native|Protected|BlueprintCallable) // @ game+0x553bce0
	void SetInteractorsUsable(bool usable, struct UInteractor* exception); // Function DeadByDaylight.Interactable.SetInteractorsUsable // (Final|Native|Public|BlueprintCallable) // @ game+0x553bc10
	void PreInterruptionEvent(struct ADBDPlayer* interruptor, struct ADBDPlayer* interruptee, struct UInterruptionDefinition* interruption); // Function DeadByDaylight.Interactable.PreInterruptionEvent // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnLevelReadyToPlay_Native(); // Function DeadByDaylight.Interactable.OnLevelReadyToPlay_Native // (Native|Protected) // @ game+0x553b9d0
	void OnLevelReadyToPlay(); // Function DeadByDaylight.Interactable.OnLevelReadyToPlay // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnInteractorLockChanged(bool locked, struct ADBDPlayer* interactingPlayer); // Function DeadByDaylight.Interactable.OnInteractorLockChanged // (Final|Native|Private) // @ game+0x553b900
	bool IsInterruptionPossible(struct ADBDPlayer* interruptor, struct ADBDPlayer* interruptee, struct UInteractor* Interactor, struct UInteractionDefinition* definition, struct UInterruptionDefinition* interruption); // Function DeadByDaylight.Interactable.IsInterruptionPossible // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x553b2d0
	bool IsInteractionDone(struct ADBDPlayer* Player, struct UInteractor* Interactor, struct UInteractionDefinition* definition, enum class EInputInteractionType interactionType); // Function DeadByDaylight.Interactable.IsInteractionDone // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x553b170
	bool IsInteractingWith(struct ADBDPlayer* Player); // Function DeadByDaylight.Interactable.IsInteractingWith // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553b0d0
	bool HasAnOngoingInteraction(); // Function DeadByDaylight.Interactable.HasAnOngoingInteraction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553ad10
	struct ADBDPlayer* GetPlayerOwner(); // Function DeadByDaylight.Interactable.GetPlayerOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553ace0
	struct UGameplayTagContainerComponent* GetObjectState(); // Function DeadByDaylight.Interactable.GetObjectState // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553ac70
	struct TArray<struct UInteractor*> GetInteractors(); // Function DeadByDaylight.Interactable.GetInteractors // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553abf0
	struct TArray<struct ADBDPlayer*> GetInteractingPlayersRaw(); // Function DeadByDaylight.Interactable.GetInteractingPlayersRaw // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553ab70
	struct FVector GetFocalPointPosition(struct ADBDPlayer* Player, struct UInteractionDefinition* definition); // Function DeadByDaylight.Interactable.GetFocalPointPosition // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x553a940
	void AuthorityRequestCancelOngoingInteractions(bool onlyOnHitCancelableInteractions); // Function DeadByDaylight.Interactable.AuthorityRequestCancelOngoingInteractions // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x553a5b0
	struct TArray<struct ADBDPlayer*> Authority_GetInteractingPlayers(); // Function DeadByDaylight.Interactable.Authority_GetInteractingPlayers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x553a670
	void AttachEveryInteractionToZone(struct UPrimitiveComponent* zone); // Function DeadByDaylight.Interactable.AttachEveryInteractionToZone // (Final|Native|Public|BlueprintCallable) // @ game+0x553a520
};

// Class DeadByDaylight.OutlineUpdateStrategy
// Size: 0xc0 (Inherited: 0xb8)
struct UOutlineUpdateStrategy : UActorComponent {
	struct UDBDOutlineComponent* _outlineComponent; // 0xb8(0x08)
};

// Class DeadByDaylight.GameplayModifierContainer
// Size: 0x218 (Inherited: 0xf8)
struct UGameplayModifierContainer : UBaseModifierContainer {
	char pad_F8[0x90]; // 0xf8(0x90)
	struct FModifierTickableConditionReplicatedData _tickableConditionsData; // 0x188(0x18)
	struct TArray<struct FName> _tags; // 0x1a0(0x10)
	bool UseApplyFunction; // 0x1b0(0x01)
	bool BroadcastStatusView; // 0x1b1(0x01)
	char pad_1B2[0x2]; // 0x1b2(0x02)
	struct FName StatusViewID; // 0x1b4(0x0c)
	bool _autoInitializeOnBeginPlay; // 0x1c0(0x01)
	bool _canOptimizeTickActivation; // 0x1c1(0x01)
	char pad_1C2[0x46]; // 0x1c2(0x46)
	struct UTimerObject* _activationTimer; // 0x208(0x08)
	char pad_210[0x8]; // 0x210(0x08)

	void UpdateIsApplicable(); // Function DeadByDaylight.GameplayModifierContainer.UpdateIsApplicable // (Final|Native|Public|BlueprintCallable) // @ game+0x552bcd0
	void UnlistenToDispatcherGameEvent(struct FGameplayTag EventType); // Function DeadByDaylight.GameplayModifierContainer.UnlistenToDispatcherGameEvent // (Final|Native|Protected|BlueprintCallable) // @ game+0x552bae0
	void UnlistenToAllDispatcherGameEvents(); // Function DeadByDaylight.GameplayModifierContainer.UnlistenToAllDispatcherGameEvents // (Final|Native|Protected|BlueprintCallable) // @ game+0x552baa0
	void SetUseApplyFunction(bool Use); // Function DeadByDaylight.GameplayModifierContainer.SetUseApplyFunction // (Final|Native|Public|BlueprintCallable) // @ game+0x552ba10
	void SetModifierValue(struct FGameplayTag Type, float GameplayModifierValue); // Function DeadByDaylight.GameplayModifierContainer.SetModifierValue // (Final|Native|Public|BlueprintCallable) // @ game+0x552b890
	void SetFlag(struct FGameplayTag flag, bool flagValue); // Function DeadByDaylight.GameplayModifierContainer.SetFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x552b7a0
	void RemoveModifier(struct FGameplayTag Type); // Function DeadByDaylight.GameplayModifierContainer.RemoveModifier // (Final|Native|Public|BlueprintCallable) // @ game+0x552b700
	void RemoveAllModifiers(); // Function DeadByDaylight.GameplayModifierContainer.RemoveAllModifiers // (Final|Native|Public|BlueprintCallable) // @ game+0x552b6e0
	void RemoveAllFlags(); // Function DeadByDaylight.GameplayModifierContainer.RemoveAllFlags // (Final|Native|Public|BlueprintCallable) // @ game+0x552b6c0
	void OnRep_TickableConditionsData(); // Function DeadByDaylight.GameplayModifierContainer.OnRep_TickableConditionsData // (Final|Native|Protected) // @ game+0x552b2d0
	void OnRep_ModifierData(); // Function DeadByDaylight.GameplayModifierContainer.OnRep_ModifierData // (Native|Protected) // @ game+0x552b2b0
	void OnRep_ActivationTimer(); // Function DeadByDaylight.GameplayModifierContainer.OnRep_ActivationTimer // (Final|Native|Private) // @ game+0x552b270
	void OnLevelReadyToPlay(); // Function DeadByDaylight.GameplayModifierContainer.OnLevelReadyToPlay // (Native|Event|Protected|BlueprintEvent) // @ game+0x552b110
	void OnInitialized_Internal(); // Function DeadByDaylight.GameplayModifierContainer.OnInitialized_Internal // (Native|Public) // @ game+0x552b010
	void OnInitialized(); // Function DeadByDaylight.GameplayModifierContainer.OnInitialized // (Native|Event|Public|BlueprintEvent) // @ game+0x552aff0
	void OnGameEventDispatched(struct FGameplayTag gameEventType, struct FGameEventData& GameEventData); // Function DeadByDaylight.GameplayModifierContainer.OnGameEventDispatched // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x552ae40
	void OnApplyEnd(); // Function DeadByDaylight.GameplayModifierContainer.OnApplyEnd // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnApplyBegin(); // Function DeadByDaylight.GameplayModifierContainer.OnApplyBegin // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void ListenToDispatcherGameEvent(struct FGameplayTag EventType); // Function DeadByDaylight.GameplayModifierContainer.ListenToDispatcherGameEvent // (Final|Native|Protected|BlueprintCallable) // @ game+0x552a7c0
	bool IsStatusViewActive(); // Function DeadByDaylight.GameplayModifierContainer.IsStatusViewActive // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x552a790
	bool IsActivationTimerDone(); // Function DeadByDaylight.GameplayModifierContainer.IsActivationTimerDone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a730
	bool IsActivationTimerActive(); // Function DeadByDaylight.GameplayModifierContainer.IsActivationTimerActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a700
	bool HasModifierOfType(struct FGameplayTag Type); // Function DeadByDaylight.GameplayModifierContainer.HasModifierOfType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a650
	bool HasFlag(struct FGameplayTag flag); // Function DeadByDaylight.GameplayModifierContainer.HasFlag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a5a0
	float GetRemainingLifetime(); // Function DeadByDaylight.GameplayModifierContainer.GetRemainingLifetime // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x552a560
	float GetPercentageFill(); // Function DeadByDaylight.GameplayModifierContainer.GetPercentageFill // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x552a520
	struct ADBDPlayer* GetOwningPlayer(); // Function DeadByDaylight.GameplayModifierContainer.GetOwningPlayer // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a4f0
	struct UGameplayModifierContainer* GetOriginatingEffect(); // Function DeadByDaylight.GameplayModifierContainer.GetOriginatingEffect // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x552a460
	float GetModifierValue(struct FGameplayTag Type); // Function DeadByDaylight.GameplayModifierContainer.GetModifierValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a3b0
	int32_t GetLevelToDisplay(); // Function DeadByDaylight.GameplayModifierContainer.GetLevelToDisplay // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a380
	enum class EInventoryItemType GetInventoryItemType(); // Function DeadByDaylight.GameplayModifierContainer.GetInventoryItemType // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x482b080
	int32_t GetIconFilePathIndex(); // Function DeadByDaylight.GameplayModifierContainer.GetIconFilePathIndex // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x552a350
	float GetActivationTimerRemainingTime(); // Function DeadByDaylight.GameplayModifierContainer.GetActivationTimerRemainingTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a320
	float GetActivationTimerPercentRemaining(); // Function DeadByDaylight.GameplayModifierContainer.GetActivationTimerPercentRemaining // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a2f0
	float GetActivationTimerElapsedTimePercent(); // Function DeadByDaylight.GameplayModifierContainer.GetActivationTimerElapsedTimePercent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a2c0
	float GetActivationTimerElapsedTime(); // Function DeadByDaylight.GameplayModifierContainer.GetActivationTimerElapsedTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a290
	float GetActivationTimerDuration(); // Function DeadByDaylight.GameplayModifierContainer.GetActivationTimerDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a260
	void FireActiveStatusViewEvent(struct FName StatusViewID, struct FName uniqueSourceID, struct FStatusViewSource StatusViewSource); // Function DeadByDaylight.GameplayModifierContainer.FireActiveStatusViewEvent // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x5529e00
	void Authority_TriggerActivationTimer(float activationTime); // Function DeadByDaylight.GameplayModifierContainer.Authority_TriggerActivationTimer // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5529d80
	void Authority_SetActivationTimerPaused(bool paused); // Function DeadByDaylight.GameplayModifierContainer.Authority_SetActivationTimerPaused // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5529bd0
	void Authority_InstantiateGameplayModifierConditions(); // Function DeadByDaylight.GameplayModifierContainer.Authority_InstantiateGameplayModifierConditions // (Final|Native|Public|BlueprintCallable) // @ game+0x5529aa0
	void Authority_ClearActivationTimer(); // Function DeadByDaylight.GameplayModifierContainer.Authority_ClearActivationTimer // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5529a80
	void Apply(float DeltaTime); // Function DeadByDaylight.GameplayModifierContainer.Apply // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	struct UBaseModifierCondition* AddCondition(struct UBaseModifierCondition* conditionType); // Function DeadByDaylight.GameplayModifierContainer.AddCondition // (Final|Native|Public|BlueprintCallable) // @ game+0x55297e0
};

// Class DeadByDaylight.StatusEffect
// Size: 0x350 (Inherited: 0x218)
struct UStatusEffect : UGameplayModifierContainer {
	char pad_218[0x48]; // 0x218(0x48)
	struct FGameplayModifierData ModifierData; // 0x260(0x30)
	bool shouldDisplay; // 0x290(0x01)
	char pad_291[0x3]; // 0x291(0x03)
	float customParam; // 0x294(0x04)
	bool _removeOnRemainingLifetimeEnded; // 0x298(0x01)
	bool BroadcastAsStatusEffectWhenApplicable; // 0x299(0x01)
	bool BroadcastAsStatusEffectByActivationTimer; // 0x29a(0x01)
	bool BroadcastAsStatusEffectWhenLifeRemains; // 0x29b(0x01)
	bool BroadcastAsStatusEffectByFunction; // 0x29c(0x01)
	bool BroadcastAsStatusEffectAlways; // 0x29d(0x01)
	bool BroadcastOriginatorGameEventNotificationWhenFirstApplicable; // 0x29e(0x01)
	bool ShouldHideStatusEffectIconForOriginatingPlayer; // 0x29f(0x01)
	bool _forceActivationTimerDisplay; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
	struct FStatusEffectInitializationData _statusInitializationData; // 0x2a8(0x28)
	char pad_2D0[0x38]; // 0x2d0(0x38)
	struct TArray<struct TSoftClassPtr<UObject>> _nonStackingEffects; // 0x308(0x10)
	char pad_318[0x38]; // 0x318(0x38)

	bool ShouldDisplayStatusEffectIcon(); // Function DeadByDaylight.StatusEffect.ShouldDisplayStatusEffectIcon // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x55b43f0
	void SetStatusEffectIconPercentage(float value); // Function DeadByDaylight.StatusEffect.SetStatusEffectIconPercentage // (Final|Native|Public|BlueprintCallable) // @ game+0x55b42d0
	void SetShouldDisplay(bool On); // Function DeadByDaylight.StatusEffect.SetShouldDisplay // (Final|Native|Public|BlueprintCallable) // @ game+0x55b4240
	void OnShouldOriginatingPlayerChange(); // Function DeadByDaylight.StatusEffect.OnShouldOriginatingPlayerChange // (Native|Event|Protected|BlueprintEvent) // @ game+0x55b3f90
	void OnShouldDisplayChanged(bool CurrentValue); // Function DeadByDaylight.StatusEffect.OnShouldDisplayChanged // (Native|Event|Protected|BlueprintEvent) // @ game+0x55b3f00
	void OnRep_StatusInitializationData(); // Function DeadByDaylight.StatusEffect.OnRep_StatusInitializationData // (Final|Native|Private) // @ game+0x55b3ee0
	void OnRep_ShouldOriginatingPlayerChange(); // Function DeadByDaylight.StatusEffect.OnRep_ShouldOriginatingPlayerChange // (Final|Native|Protected) // @ game+0x55b3ec0
	void OnRep_ShouldDisplay(); // Function DeadByDaylight.StatusEffect.OnRep_ShouldDisplay // (Final|Native|Protected) // @ game+0x55b3ea0
	void Multicast_SetRemainingLifetimeInitialized(bool remainingLifetimeInitialized); // Function DeadByDaylight.StatusEffect.Multicast_SetRemainingLifetimeInitialized // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x55b3c60
	void Multicast_SetRemainingLifetime(float lifetime); // Function DeadByDaylight.StatusEffect.Multicast_SetRemainingLifetime // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x55b3bd0
	bool IsOriginatorHooked(); // Function DeadByDaylight.StatusEffect.IsOriginatorHooked // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55b3b70
	bool IsOriginatorAlive(); // Function DeadByDaylight.StatusEffect.IsOriginatorAlive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55b3b40
	bool IsKillerInOriginatorRange(float AdditiveRangeModifier); // Function DeadByDaylight.StatusEffect.IsKillerInOriginatorRange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55b3ab0
	bool IsInOriginatorRange(); // Function DeadByDaylight.StatusEffect.IsInOriginatorRange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55b3a80
	void InitializeLifetime(float lifetime); // Function DeadByDaylight.StatusEffect.InitializeLifetime // (Final|Native|Public|BlueprintCallable) // @ game+0x55b3920
	enum class EStatusEffectType GetStatusEffectType(); // Function DeadByDaylight.StatusEffect.GetStatusEffectType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5544cf0
	float GetStatusEffectCooldownRate(); // Function DeadByDaylight.StatusEffect.GetStatusEffectCooldownRate // (Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x55b3610
	bool GetShouldDisplay(); // Function DeadByDaylight.StatusEffect.GetShouldDisplay // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x5545920
	struct ADBDPlayer* GetOriginatingPlayer(); // Function DeadByDaylight.StatusEffect.GetOriginatingPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55b3590
	float GetLifetimeDuration(); // Function DeadByDaylight.StatusEffect.GetLifetimeDuration // (Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x55b3520
	float GetCustomParam(); // Function DeadByDaylight.StatusEffect.GetCustomParam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55b3500
	void FireActiveStatusEffectEvent(float Percentage, int32_t levelToDisplay); // Function DeadByDaylight.StatusEffect.FireActiveStatusEffectEvent // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x55b3430
	void BroadcastOriginatorGameEventNotification(); // Function DeadByDaylight.StatusEffect.BroadcastOriginatorGameEventNotification // (Final|Native|Protected|BlueprintCallable) // @ game+0x55b3200
	void BroadcastGameEventNotification(struct FGameplayNotificationData notificationData, bool addToHistory); // Function DeadByDaylight.StatusEffect.BroadcastGameEventNotification // (Final|Native|Protected|BlueprintCallable) // @ game+0x55b3010
	void Authority_SetRemainingLifetime(float lifetime); // Function DeadByDaylight.StatusEffect.Authority_SetRemainingLifetime // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x55b2f80
	void Authority_RemoveSelf(); // Function DeadByDaylight.StatusEffect.Authority_RemoveSelf // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x55b2f60
	void Authority_OnOriginatingPlayerEndPlay(struct AActor* Actor, enum class EEndPlayReason EndPlayReason); // Function DeadByDaylight.StatusEffect.Authority_OnOriginatingPlayerEndPlay // (Final|Native|Private) // @ game+0x55b2e90
	void Authority_EndSelf(); // Function DeadByDaylight.StatusEffect.Authority_EndSelf // (BlueprintAuthorityOnly|Native|Event|Public|BlueprintEvent) // @ game+0x55b2e70
};

// Class DeadByDaylight.QuestEventEvaluatorBase
// Size: 0xb8 (Inherited: 0x30)
struct UQuestEventEvaluatorBase : UObject {
	char pad_30[0x20]; // 0x30(0x20)
	struct ADBDPlayer* _dbdPlayer; // 0x50(0x08)
	char pad_58[0xa]; // 0x58(0x0a)
	enum class EConditionNeedsType _conditionNeedsType; // 0x62(0x01)
	char pad_63[0x5]; // 0x63(0x05)
	struct TArray<struct UEvaluatorCondition*> _evaluatorConditionsClass; // 0x68(0x10)
	struct TArray<struct UEvaluatorCondition*> _evaluatorConditions; // 0x78(0x10)
	char pad_88[0x30]; // 0x88(0x30)

	void OnGameEvent(struct FGameplayTag gameEventType, struct FGameEventData& GameEventData); // Function DeadByDaylight.QuestEventEvaluatorBase.OnGameEvent // (Native|Protected|HasOutParms) // @ game+0x5588b40
};

// Class DeadByDaylight.EvaluatorCondition
// Size: 0x48 (Inherited: 0x30)
struct UEvaluatorCondition : UObject {
	enum class EConditionSubject _conditionSubject; // 0x30(0x01)
	char pad_31[0x17]; // 0x31(0x17)
};

// Class DeadByDaylight.SpecialBehaviourInteractable
// Size: 0x378 (Inherited: 0x338)
struct ASpecialBehaviourInteractable : AInteractable {
	char pad_338[0x30]; // 0x338(0x30)
	struct TWeakObjectPtr<struct ADBDPlayerState> _specialBehaviourOwner; // 0x368(0x08)
	char pad_370[0x8]; // 0x370(0x08)

	void OnRep_SpecialBehaviourOwner(); // Function DeadByDaylight.SpecialBehaviourInteractable.OnRep_SpecialBehaviourOwner // (Final|Native|Private) // @ game+0x55ad230
};

// Class DeadByDaylight.SourceBasedOutlineUpdateStrategy
// Size: 0x138 (Inherited: 0xc0)
struct USourceBasedOutlineUpdateStrategy : UOutlineUpdateStrategy {
	struct FLinearColor _defaultColorForSurvivor; // 0xc0(0x10)
	struct FLinearColor _defaultColorForSlasher; // 0xd0(0x10)
	char pad_E0[0x58]; // 0xe0(0x58)

	void ResetReveal(); // Function DeadByDaylight.SourceBasedOutlineUpdateStrategy.ResetReveal // (Final|Native|Public|BlueprintCallable) // @ game+0x55ad2e0
	void RemoveRevealSource(struct UObject* Source); // Function DeadByDaylight.SourceBasedOutlineUpdateStrategy.RemoveRevealSource // (Final|Native|Public|BlueprintCallable) // @ game+0x55ad250
	void ChangeDefaultColorForSurvivor(struct FLinearColor NewColor); // Function DeadByDaylight.SourceBasedOutlineUpdateStrategy.ChangeDefaultColorForSurvivor // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x55abb50
	void ChangeDefaultColorForSlasher(struct FLinearColor NewColor); // Function DeadByDaylight.SourceBasedOutlineUpdateStrategy.ChangeDefaultColorForSlasher // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x55abac0
	void AddTimedReveal(struct UObject* Source, struct FLinearColor HighlightColor, int32_t Priority, struct TArray<struct ADBDPlayer*>& affectedCharacters, float Duration); // Function DeadByDaylight.SourceBasedOutlineUpdateStrategy.AddTimedReveal // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x55ab900
	void AddTimedAndRangedReveal(struct UObject* Source, struct AActor* SourceActor, struct FLinearColor HighlightColor, int32_t Priority, struct TArray<struct ADBDPlayer*>& affectedCharacters, float Duration, float Range); // Function DeadByDaylight.SourceBasedOutlineUpdateStrategy.AddTimedAndRangedReveal // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x55ab6b0
	void AddRevealWithOptions(struct UObject* Source, struct FLinearColor HighlightColor, int32_t Priority, struct TArray<struct ADBDPlayer*>& affectedCharacters, struct FRevealOptions Options); // Function DeadByDaylight.SourceBasedOutlineUpdateStrategy.AddRevealWithOptions // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x55ab4a0
	void AddReveal(struct UObject* Source, struct FLinearColor HighlightColor, int32_t Priority, struct TArray<struct ADBDPlayer*>& affectedCharacters); // Function DeadByDaylight.SourceBasedOutlineUpdateStrategy.AddReveal // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x55ab310
	void AddRangedReveal(struct UObject* Source, struct AActor* SourceActor, struct FLinearColor HighlightColor, int32_t Priority, struct TArray<struct ADBDPlayer*>& affectedCharacters, float Range); // Function DeadByDaylight.SourceBasedOutlineUpdateStrategy.AddRangedReveal // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x55ab100
};

// Class DeadByDaylight.SpecialBehaviourIterativeWeightAdjustmentStrategy
// Size: 0x30 (Inherited: 0x30)
struct USpecialBehaviourIterativeWeightAdjustmentStrategy : UObject {
};

// Class DeadByDaylight.DefaultOutlineUpdateStrategy
// Size: 0xe0 (Inherited: 0xc0)
struct UDefaultOutlineUpdateStrategy : UOutlineUpdateStrategy {
	struct FLinearColor _revealedColorToSurvivor; // 0xc0(0x10)
	struct FLinearColor _revealedColorToKiller; // 0xd0(0x10)
};

// Class DeadByDaylight.ActorNavMovementComponent
// Size: 0x168 (Inherited: 0x140)
struct UActorNavMovementComponent : UNavMovementComponent {
	struct AActor* _owningActor; // 0x140(0x08)
	struct UPathFollowingComponent* _pathFollowingComponent; // 0x148(0x08)
	char bPositionCorrected : 1; // 0x150(0x01)
	char pad_150_1 : 7; // 0x150(0x01)
	char pad_151[0x3]; // 0x151(0x03)
	float _maxSpeed; // 0x154(0x04)
	float _acceleration; // 0x158(0x04)
	float _deceleration; // 0x15c(0x04)
	float _brakingDeceleration; // 0x160(0x04)
	char pad_164[0x4]; // 0x164(0x04)

	void SetMaxSpeed(float MaxSpeed); // Function DeadByDaylight.ActorNavMovementComponent.SetMaxSpeed // (Final|Native|Public|BlueprintCallable) // @ game+0x545fd40
	void SetDeceleration(float Deceleration); // Function DeadByDaylight.ActorNavMovementComponent.SetDeceleration // (Final|Native|Public|BlueprintCallable) // @ game+0x545fb30
	void SetAcceleration(float Acceleration); // Function DeadByDaylight.ActorNavMovementComponent.SetAcceleration // (Final|Native|Public|BlueprintCallable) // @ game+0x545fab0
	struct AActor* GetOwningActor(); // Function DeadByDaylight.ActorNavMovementComponent.GetOwningActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x545eb40
};

// Class DeadByDaylight.AbstractAnalyticsManager
// Size: 0x38 (Inherited: 0x38)
struct UAbstractAnalyticsManager : UGameInstanceSubsystem {
};

// Class DeadByDaylight.ArmIKSensorComponent
// Size: 0x138 (Inherited: 0xb8)
struct UArmIKSensorComponent : UActorComponent {
	struct USkeletalMeshComponent* _mesh; // 0xb8(0x08)
	struct TMap<enum class EArm, struct FArmIKSensorDatum> _arms; // 0xc0(0x50)
	float _capsuleRadius; // 0x110(0x04)
	float _capsuleHalfHeight; // 0x114(0x04)
	float _traceLength; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct UCameraComponent* _owningCamera; // 0x120(0x08)
	char pad_128[0x10]; // 0x128(0x10)
};

// Class DeadByDaylight.DBDAttack
// Size: 0x390 (Inherited: 0xb8)
struct UDBDAttack : UActorComponent {
	char pad_B8[0x18]; // 0xb8(0x18)
	enum class EAttackType _attackType; // 0xd0(0x01)
	bool _useMontage; // 0xd1(0x01)
	enum class EDetectionZone _damageZone; // 0xd2(0x01)
	enum class EDetectionZone _lockZone; // 0xd3(0x01)
	enum class EDetectionZone _obstructionZone; // 0xd4(0x01)
	char pad_D5[0x3]; // 0xd5(0x03)
	struct FStatProperty _maxAccelerationMultiplier; // 0xd8(0x88)
	bool _onlyApplyAccelerationMultiplierWhenWalking; // 0x160(0x01)
	char pad_161[0x7]; // 0x161(0x07)
	struct FDBDAttackTargetTracker _targetTracker; // 0x168(0xb8)
	struct TMap<enum class EAttackSubstate, struct UDBDAttackSubstate*> _stateClasses; // 0x220(0x50)
	struct TArray<struct ACharacter*> _localAlreadyHitTargets; // 0x270(0x10)
	struct TArray<struct ADBDPlayer*> _hitTargets; // 0x280(0x10)
	struct TSet<struct ADBDPlayer*> _targetsAwaitingServerValidation; // 0x290(0x50)
	char pad_2E0[0x30]; // 0x2e0(0x30)
	struct TMap<enum class EAttackSubstate, struct UDBDAttackSubstate*> _states; // 0x310(0x50)
	char pad_360[0x27]; // 0x360(0x27)
	enum class EHitValidatorConfigName _hitValidationConfigName; // 0x387(0x01)
	char pad_388[0x8]; // 0x388(0x08)

	void Server_RequestStateChange(enum class EAttackSubstate State); // Function DeadByDaylight.DBDAttack.Server_RequestStateChange // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c3e40
	void Server_HitTarget(struct ADBDPlayer* Target, float TargetLocationTimestamp, struct FActionPredictionKey PredictionKey); // Function DeadByDaylight.DBDAttack.Server_HitTarget // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x54c3d30
	void Server_HitDestroyableActorAttackableComponent(struct UAttackableComponent* AttackableComponent); // Function DeadByDaylight.DBDAttack.Server_HitDestroyableActorAttackableComponent // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x54c3ca0
	void Server_ClearTargets(); // Function DeadByDaylight.DBDAttack.Server_ClearTargets // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x4aa7040
	void Multicast_SendPostHitTargetData(struct ADBDPlayer* owningKiller, struct ADBDPlayer* Target, struct FPostAttackData attackData); // Function DeadByDaylight.DBDAttack.Multicast_SendPostHitTargetData // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x54c39e0
	void Multicast_RequestStateChange(enum class EAttackSubstate State); // Function DeadByDaylight.DBDAttack.Multicast_RequestStateChange // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x54c3960
	void Multicast_HitTarget(struct ADBDPlayer* Target, bool hitCosmeticOnly); // Function DeadByDaylight.DBDAttack.Multicast_HitTarget // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x54c3890
	void Multicast_HitAttackableComponent(struct UAttackableComponent* AttackableComponent); // Function DeadByDaylight.DBDAttack.Multicast_HitAttackableComponent // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54c3800
	void Multicast_ClearTargets(); // Function DeadByDaylight.DBDAttack.Multicast_ClearTargets // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x4af1ac0
	void Local_OnMovementChanged(struct ACharacter* Character, enum class EMovementMode PrevMovementMode, char PreviousCustomMode); // Function DeadByDaylight.DBDAttack.Local_OnMovementChanged // (Final|Native|Protected) // @ game+0x54c3620
	void Client_ReceiveHitResult(struct ADBDPlayer* Target, bool IsValid, struct FActionPredictionKey PredictionKey); // Function DeadByDaylight.DBDAttack.Client_ReceiveHitResult // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x54c3130
	void Client_ReceiveAttackSubstateRequestResult(struct FAttackSubstateRequestResult Result); // Function DeadByDaylight.DBDAttack.Client_ReceiveAttackSubstateRequestResult // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x54c3090
};

// Class DeadByDaylight.DBDAttackSubstate
// Size: 0x118 (Inherited: 0x30)
struct UDBDAttackSubstate : UObject {
	struct FStatProperty _duration; // 0x30(0x88)
	struct UCurveFloat* _speedCurve; // 0xb8(0x08)
	struct FName _montage; // 0xc0(0x0c)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct UCurveFloat* _currentCurve; // 0xd0(0x08)
	char pad_D8[0x40]; // 0xd8(0x40)
};

// Class DeadByDaylight.DBDAttackOpenSubstate
// Size: 0x118 (Inherited: 0x118)
struct UDBDAttackOpenSubstate : UDBDAttackSubstate {
};

// Class DeadByDaylight.DBDAttackHittingSubstate
// Size: 0x1a0 (Inherited: 0x118)
struct UDBDAttackHittingSubstate : UDBDAttackSubstate {
	struct FStatProperty _hittingPercentDamageBegin; // 0x118(0x88)
};

// Class DeadByDaylight.DBDAttackSuccessSubstate
// Size: 0x118 (Inherited: 0x118)
struct UDBDAttackSuccessSubstate : UDBDAttackSubstate {
};

// Class DeadByDaylight.DBDAttackMissSubstate
// Size: 0x118 (Inherited: 0x118)
struct UDBDAttackMissSubstate : UDBDAttackSubstate {
};

// Class DeadByDaylight.DBDAttackObstructSubstate
// Size: 0x118 (Inherited: 0x118)
struct UDBDAttackObstructSubstate : UDBDAttackSubstate {
};

// Class DeadByDaylight.DBDAIController
// Size: 0x638 (Inherited: 0x340)
struct ADBDAIController : AAIController {
	float DefaultSightRange; // 0x340(0x04)
	float CloakedTargetSightRange; // 0x344(0x04)
	struct TMap<enum class EAIDifficultyLevel, int32_t> AIDifficultyMaxPlayerRanks; // 0x348(0x50)
	char pad_398[0x10]; // 0x398(0x10)
	float RotateCameraOnStationaryWaitTime; // 0x3a8(0x04)
	float RotateCameraOnStationaryDegreePerSecond; // 0x3ac(0x04)
	char pad_3B0[0x20]; // 0x3b0(0x20)
	struct APawn* _aiPawn; // 0x3d0(0x08)
	struct APawn* _lastAiPawn; // 0x3d8(0x08)
	struct TMap<struct UObject*, float> _contextualPathSpeedFactors; // 0x3e0(0x50)
	struct UObject* _objOverridingDefaultNavigationFilter; // 0x430(0x08)
	struct UNavigationQueryFilter* _originalDefaultNavigationFilter; // 0x438(0x08)
	char pad_440[0x18]; // 0x440(0x18)
	struct TMap<enum class EPawnInputPressTypes, struct UObject*> _inputLocks; // 0x458(0x50)
	struct UObject* _movementLock; // 0x4a8(0x08)
	char pad_4B0[0x188]; // 0x4b0(0x188)

	void UseItemRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.UseItemRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bec80
	void StruggleRequest(struct UObject* requester, float Input); // Function DeadByDaylight.DBDAIController.StruggleRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54beb90
	bool SetCharacterMovement(enum class ECharacterMovementTypes movementTypes, struct UObject* requester); // Function DeadByDaylight.DBDAIController.SetCharacterMovement // (Final|Native|Public|BlueprintCallable) // @ game+0x54beaa0
	void Server_SetAIPlayerRank(int32_t PlayerRank); // Function DeadByDaylight.DBDAIController.Server_SetAIPlayerRank // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x54be9e0
	void SecondAttackRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.SecondAttackRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54be8c0
	void SecondaryActionRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.SecondaryActionRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54be950
	void RunRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.RunRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54be830
	void InteractRequestRelease(struct UObject* requester); // Function DeadByDaylight.DBDAIController.InteractRequestRelease // (Final|Native|Public|BlueprintCallable) // @ game+0x54bdb40
	void InteractRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.InteractRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54be190
	void Gesture04Request(struct UObject* requester); // Function DeadByDaylight.DBDAIController.Gesture04Request // (Final|Native|Public|BlueprintCallable) // @ game+0x54be000
	void Gesture03Request(struct UObject* requester); // Function DeadByDaylight.DBDAIController.Gesture03Request // (Final|Native|Public|BlueprintCallable) // @ game+0x54bdf70
	void Gesture02Request(struct UObject* requester); // Function DeadByDaylight.DBDAIController.Gesture02Request // (Final|Native|Public|BlueprintCallable) // @ game+0x54bdee0
	void Gesture01Request(struct UObject* requester); // Function DeadByDaylight.DBDAIController.Gesture01Request // (Final|Native|Public|BlueprintCallable) // @ game+0x54bde50
	void FastInteractRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.FastInteractRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bdd80
	void EndUseItemRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.EndUseItemRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bdcf0
	void EndSecondAttackRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.EndSecondAttackRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bdc60
	void EndRunRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.EndRunRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bdbd0
	void EndInteractRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.EndInteractRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bdb40
	void EndFastInteractRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.EndFastInteractRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bdab0
	void EndDropItemRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.EndDropItemRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bda20
	void EndActionRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.EndActionRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bd990
	void EndAbilityTwoRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.EndAbilityTwoRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bd900
	void DropItemRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.DropItemRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bd870
	void CancelMinigameRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.CancelMinigameRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bd7c0
	void AttackRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.AttackRequest // (Native|Public|BlueprintCallable) // @ game+0x54bd6b0
	void ActionRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.ActionRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bd240
	void AbilityTwoRequest(struct UObject* requester); // Function DeadByDaylight.DBDAIController.AbilityTwoRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x54bd1b0
};

// Class DeadByDaylight.DBDAIUtilities
// Size: 0x30 (Inherited: 0x30)
struct UDBDAIUtilities : UBlueprintFunctionLibrary {

	void SetCanEverAffectNavigation(struct UActorComponent* Component, bool affectNavigation); // Function DeadByDaylight.DBDAIUtilities.SetCanEverAffectNavigation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x54c3ec0
	struct UNavigationPath* FindPathWithAgentRadiusToActorSynchronously(struct UObject* WorldContextObject, struct FVector& pathStart, struct AActor* GoalActor, float AgentRadius, float tetherDistance, struct AActor* pathfindingContext, struct UNavigationQueryFilter* FilterClass); // Function DeadByDaylight.DBDAIUtilities.FindPathWithAgentRadiusToActorSynchronously // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x54c3250
	bool DrawDebugAIPerception(); // Function DeadByDaylight.DBDAIUtilities.DrawDebugAIPerception // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x479ec60
	bool DrawDebugAINavigationFilter(); // Function DeadByDaylight.DBDAIUtilities.DrawDebugAINavigationFilter // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x479ec60
	bool DrawDebugAINavigation(); // Function DeadByDaylight.DBDAIUtilities.DrawDebugAINavigation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x479ec60
};

// Class DeadByDaylight.Perk
// Size: 0x3c8 (Inherited: 0x218)
struct UPerk : UGameplayModifierContainer {
	char pad_218[0x60]; // 0x218(0x60)
	struct FGameplayModifierData PerkLevelData[0x3]; // 0x278(0x90)
	char pad_308[0x30]; // 0x308(0x30)
	struct UBasePerkIconStrategy* PerkIconStrategyClass; // 0x338(0x08)
	struct FMulticastInlineDelegate OnTokenCountChangedBP; // 0x340(0x10)
	char pad_350[0x30]; // 0x350(0x30)
	bool _isUsable; // 0x380(0x01)
	bool _keepImposedStatusEffectsOnEndPlay; // 0x381(0x01)
	bool BroadcastWhenApplicable; // 0x382(0x01)
	bool BroadcastOnTimer; // 0x383(0x01)
	bool BroadcastCooldownTimer; // 0x384(0x01)
	bool BroadcastInactiveCooldownTimer; // 0x385(0x01)
	bool BroadcastAlways; // 0x386(0x01)
	bool SetInactiveDuringCooldown; // 0x387(0x01)
	struct UBasePerkIconStrategy* _perkIconStrategy; // 0x388(0x08)
	struct FPerkInitializationData _perkInitializationData; // 0x390(0x08)
	char pad_398[0x4]; // 0x398(0x04)
	int32_t _tokenCount; // 0x39c(0x04)
	int32_t _maxTokenCount; // 0x3a0(0x04)
	enum class EPerkTokenSoundStrategy _tokenSoundStrategy; // 0x3a4(0x01)
	char pad_3A5[0x3]; // 0x3a5(0x03)
	struct UTimerObject* _cooldownTimer; // 0x3a8(0x08)
	char pad_3B0[0x8]; // 0x3b0(0x08)
	struct UTimerObject* _hudIconTimer; // 0x3b8(0x08)
	struct UInteractionDefinition* _activatableInteraction; // 0x3c0(0x08)

	void SetIsUsable(bool value); // Function DeadByDaylight.Perk.SetIsUsable // (Final|Native|Public|BlueprintCallable) // @ game+0x5577cb0
	void OnRep_TokenCount(int32_t oldCount); // Function DeadByDaylight.Perk.OnRep_TokenCount // (Final|Native|Private) // @ game+0x5577910
	void OnRep_PerkInitializationData(); // Function DeadByDaylight.Perk.OnRep_PerkInitializationData // (Final|Native|Private) // @ game+0x55778f0
	void OnRep_IsUsable(); // Function DeadByDaylight.Perk.OnRep_IsUsable // (Final|Native|Private|Const) // @ game+0x55778d0
	void OnRep_CooldownTimer(); // Function DeadByDaylight.Perk.OnRep_CooldownTimer // (Final|Native|Private|Const) // @ game+0x55778b0
	bool IsHudIconTimerDone(); // Function DeadByDaylight.Perk.IsHudIconTimerDone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5577730
	bool IsCooldownTimerDone(); // Function DeadByDaylight.Perk.IsCooldownTimerDone // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5577700
	int32_t GetTokenCount(); // Function DeadByDaylight.Perk.GetTokenCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54e46b0
	int32_t GetPerkLevel(); // Function DeadByDaylight.Perk.GetPerkLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55767b0
	struct UBasePerkIconStrategy* GetPerkIconStrategy(); // Function DeadByDaylight.Perk.GetPerkIconStrategy // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x5576780
	int32_t GetMaxTokenCount(); // Function DeadByDaylight.Perk.GetMaxTokenCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5576450
	bool GetIsUsable(); // Function DeadByDaylight.Perk.GetIsUsable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5576420
	float GetHudIconTimerElapsedTimePercent(); // Function DeadByDaylight.Perk.GetHudIconTimerElapsedTimePercent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55763f0
	struct FGameplayModifierData GetGameplayModifierData(); // Function DeadByDaylight.Perk.GetGameplayModifierData // (Native|Public|BlueprintCallable) // @ game+0x55762c0
	struct UTimerObject* GetCooldownTimer(); // Function DeadByDaylight.Perk.GetCooldownTimer // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x5576290
	void FireActivePerkEvent(float Percentage, int32_t chargeCount); // Function DeadByDaylight.Perk.FireActivePerkEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x5575b80
	void Authority_TriggerHudIconTimer(float Duration); // Function DeadByDaylight.Perk.Authority_TriggerHudIconTimer // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5575b00
	void Authority_TriggerCooldownTimer(float cooldownTime); // Function DeadByDaylight.Perk.Authority_TriggerCooldownTimer // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5575a80
	void Authority_SetTokenCount(int32_t value); // Function DeadByDaylight.Perk.Authority_SetTokenCount // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5575910
	void Authority_SetMaxTokenCount(int32_t value); // Function DeadByDaylight.Perk.Authority_SetMaxTokenCount // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5575880
	void Authority_SetIsUsable(bool value); // Function DeadByDaylight.Perk.Authority_SetIsUsable // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x55757f0
	void Authority_IncrementToken(); // Function DeadByDaylight.Perk.Authority_IncrementToken // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5575650
	void Authority_DecrementToken(); // Function DeadByDaylight.Perk.Authority_DecrementToken // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5575060
};

// Class DeadByDaylight.TotemBoundPerk
// Size: 0x420 (Inherited: 0x3c8)
struct UTotemBoundPerk : UPerk {
	char pad_3C8[0x18]; // 0x3c8(0x18)
	enum class ETotemState TotemBoundState; // 0x3e0(0x01)
	bool _doNotBindToTotemOnInit; // 0x3e1(0x01)
	char pad_3E2[0x6]; // 0x3e2(0x06)
	struct TArray<struct ATotem*> _boundTotems; // 0x3e8(0x10)
	struct TArray<struct ATotem*> _local_boundTotems; // 0x3f8(0x10)
	struct TArray<struct ATotem*> _authorityPrevTotemActors; // 0x408(0x10)
	int32_t _numTotemsToBind; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)

	void OnRep_BoundTotems(); // Function DeadByDaylight.TotemBoundPerk.OnRep_BoundTotems // (Final|Native|Private) // @ game+0x55c8a10
	struct TArray<struct ATotem*> GetTotems(); // Function DeadByDaylight.TotemBoundPerk.GetTotems // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55c8560
	float GetSquaredDistanceToOwner(struct AActor* Survivor); // Function DeadByDaylight.TotemBoundPerk.GetSquaredDistanceToOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55c8460
	struct TArray<struct ATotem*> GetBoundTotems(); // Function DeadByDaylight.TotemBoundPerk.GetBoundTotems // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x55c8210
	void Authority_UnbindFromTotem(struct ATotem* aTotemActor); // Function DeadByDaylight.TotemBoundPerk.Authority_UnbindFromTotem // (Native|Public) // @ game+0x4ceef10
	bool Authority_BindToDullTotems(bool allowAdditionalBoundTotems); // Function DeadByDaylight.TotemBoundPerk.Authority_BindToDullTotems // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x55c7610
};

// Class DeadByDaylight.GameplayModifierCondition
// Size: 0xd0 (Inherited: 0xd0)
struct UGameplayModifierCondition : UBaseModifierCondition {

	void SetOwningGameplayModifier(struct UGameplayModifierContainer* OwningGameplayModifier); // Function DeadByDaylight.GameplayModifierCondition.SetOwningGameplayModifier // (Final|Native|Public|BlueprintCallable) // @ game+0x552b980
	void OnOwningGameplayModifierSet(); // Function DeadByDaylight.GameplayModifierCondition.OnOwningGameplayModifierSet // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	bool IsApplicable(); // Function DeadByDaylight.GameplayModifierCondition.IsApplicable // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x552a760
	struct ADBDPlayer* GetOwningPlayer(); // Function DeadByDaylight.GameplayModifierCondition.GetOwningPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a4c0
	struct UGameplayModifierContainer* GetOwningGameplayModifier(); // Function DeadByDaylight.GameplayModifierCondition.GetOwningGameplayModifier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x552a490
};

// Class DeadByDaylight.ItemModifier
// Size: 0x278 (Inherited: 0x218)
struct UItemModifier : UGameplayModifierContainer {
	struct FGameplayModifierData ModifierData; // 0x218(0x30)
	char pad_248[0x30]; // 0x248(0x30)

	void HandleIncreaseMaxCharge(); // Function DeadByDaylight.ItemModifier.HandleIncreaseMaxCharge // (Final|Native|Public|BlueprintCallable) // @ game+0x554a360
	void HandleIncreaseItemCount(); // Function DeadByDaylight.ItemModifier.HandleIncreaseItemCount // (Final|Native|Public|BlueprintCallable) // @ game+0x554a340
	void HandleIncreaseCharge(); // Function DeadByDaylight.ItemModifier.HandleIncreaseCharge // (Final|Native|Public|BlueprintCallable) // @ game+0x554a320
	float GetItemMaxEnergy(); // Function DeadByDaylight.ItemModifier.GetItemMaxEnergy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x554a2f0
	float GetItemEnergy(); // Function DeadByDaylight.ItemModifier.GetItemEnergy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x554a2c0
	int32_t GetItemCount(); // Function DeadByDaylight.ItemModifier.GetItemCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x554a290
	struct ACollectable* GetBaseItem(); // Function DeadByDaylight.ItemModifier.GetBaseItem // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x554a260
	void AuthoritySetItemMaxEnergy(float energy); // Function DeadByDaylight.ItemModifier.AuthoritySetItemMaxEnergy // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x554a1a0
	void AuthoritySetItemEnergy(float energy); // Function DeadByDaylight.ItemModifier.AuthoritySetItemEnergy // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x554a120
	void AuthoritySetItemCount(int32_t itemCount); // Function DeadByDaylight.ItemModifier.AuthoritySetItemCount // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x554a090
};

// Class DeadByDaylight.ItemAddon
// Size: 0x2b8 (Inherited: 0x278)
struct UItemAddon : UItemModifier {
	struct ACollectable* BaseItemType; // 0x278(0x08)
	bool _needsSetup; // 0x280(0x01)
	char pad_281[0x1f]; // 0x281(0x1f)
	int32_t _tokenCount; // 0x2a0(0x04)
	int32_t _maxTokenCount; // 0x2a4(0x04)
	struct FItemAddonInitializationData _addonInitializationData; // 0x2a8(0x02)
	char pad_2AA[0xe]; // 0x2aa(0x0e)

	void SetUpAddon(); // Function DeadByDaylight.ItemAddon.SetUpAddon // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void OnRep_TokenCount(int32_t oldCount); // Function DeadByDaylight.ItemAddon.OnRep_TokenCount // (Final|Native|Private) // @ game+0x5545d60
	void OnRep_AddonInitializationData(); // Function DeadByDaylight.ItemAddon.OnRep_AddonInitializationData // (Final|Native|Private) // @ game+0x5545d40
	void OnPostItemAddonsCreation(struct ADBDPlayer* Player, struct ACollectable* Item); // Function DeadByDaylight.ItemAddon.OnPostItemAddonsCreation // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void Multicast_SetBaseItem(struct ACollectable* baseItem); // Function DeadByDaylight.ItemAddon.Multicast_SetBaseItem // (Final|Net|NetReliableNative|Event|NetMulticast|Private|NetValidate) // @ game+0x5545bf0
	void Multicast_AddAddonToItem(struct ACollectable* Item); // Function DeadByDaylight.ItemAddon.Multicast_AddAddonToItem // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x55198a0
	bool IsSecondaryAction(); // Function DeadByDaylight.ItemAddon.IsSecondaryAction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5545950
	bool IsReadyForSetUp(); // Function DeadByDaylight.ItemAddon.IsReadyForSetUp // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x5545920
	int32_t GetTokenCount(); // Function DeadByDaylight.ItemAddon.GetTokenCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5545450
	int32_t GetMaxTokenCount(); // Function DeadByDaylight.ItemAddon.GetMaxTokenCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5545420
	void DebugPrintStats(); // Function DeadByDaylight.ItemAddon.DebugPrintStats // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void Authority_SetTokenCount(int32_t value); // Function DeadByDaylight.ItemAddon.Authority_SetTokenCount // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5544a40
	void Authority_SetMaxTokenCount(int32_t value); // Function DeadByDaylight.ItemAddon.Authority_SetMaxTokenCount // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x55449b0
	void Authority_OnCollectablePickedUp(struct ADBDPlayer* Player); // Function DeadByDaylight.ItemAddon.Authority_OnCollectablePickedUp // (Native|Event|Public|BlueprintEvent) // @ game+0x5544920
	void Authority_OnCollectableDropped(struct ADBDPlayer* Player); // Function DeadByDaylight.ItemAddon.Authority_OnCollectableDropped // (Native|Event|Public|BlueprintEvent) // @ game+0x5544890
	void Authority_IncrementToken(); // Function DeadByDaylight.ItemAddon.Authority_IncrementToken // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5544870
	void Authority_DecrementToken(); // Function DeadByDaylight.ItemAddon.Authority_DecrementToken // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5544820
	void Authority_ApplyMetaModifiers(); // Function DeadByDaylight.ItemAddon.Authority_ApplyMetaModifiers // (Final|Native|Private) // @ game+0x5544800
};

// Class DeadByDaylight.Collectable
// Size: 0x4c8 (Inherited: 0x338)
struct ACollectable : AInteractable {
	char pad_338[0x48]; // 0x338(0x48)
	bool DisplayUsePercent; // 0x380(0x01)
	enum class EAtlantaItemProgressionBarEnum ProgressBar; // 0x381(0x01)
	bool OverrideItemIndex; // 0x382(0x01)
	char pad_383[0x1]; // 0x383(0x01)
	int32_t OverridenItemIndex; // 0x384(0x04)
	bool StrafeOnUse; // 0x388(0x01)
	bool VisibleWhenEquipped; // 0x389(0x01)
	bool StopRunningOnUse; // 0x38a(0x01)
	enum class EItemHandPosition HandPosition; // 0x38b(0x01)
	bool DisableArmOverrideDuringInteractions; // 0x38c(0x01)
	bool HasUseInteraction; // 0x38d(0x01)
	enum class ECollectableCategory category; // 0x38e(0x01)
	char pad_38F[0x1]; // 0x38f(0x01)
	struct FName ItemId; // 0x390(0x0c)
	bool FromPlayerSpawn; // 0x39c(0x01)
	char pad_39D[0x3]; // 0x39d(0x03)
	struct UItemModifier* BaseItemModifier; // 0x3a0(0x08)
	struct UItemModifier* ItemModifier1; // 0x3a8(0x08)
	struct UItemModifier* ItemModifier2; // 0x3b0(0x08)
	bool ShouldRegisterToOnSurvivorAdded; // 0x3b8(0x01)
	char pad_3B9[0x67]; // 0x3b9(0x67)
	bool BeingCollected; // 0x420(0x01)
	bool BeingDropped; // 0x421(0x01)
	bool _beingConsumedByEntity; // 0x422(0x01)
	char pad_423[0x5]; // 0x423(0x05)
	struct UInteractor* _itemInteractor; // 0x428(0x08)
	struct UDBDSkeletalMeshComponentBudgeted* _mesh; // 0x430(0x08)
	enum class EInputInteractionType _displayedInputType; // 0x438(0x01)
	bool _isKeyPromptForceDisabled; // 0x439(0x01)
	bool _isBoundToFirstCollector; // 0x43a(0x01)
	bool _isCursedItem; // 0x43b(0x01)
	bool _isSpecialItem; // 0x43c(0x01)
	bool _useInventoryCount; // 0x43d(0x01)
	char pad_43E[0x1a]; // 0x43e(0x1a)
	struct USceneComponent* _placementOrigin; // 0x458(0x08)
	char pad_460[0x10]; // 0x460(0x10)
	struct ADBDPlayer* _collector; // 0x470(0x08)
	struct ADBDPlayer* _firstCollector; // 0x478(0x08)
	enum class ECollectableState _state; // 0x480(0x01)
	char pad_481[0x7]; // 0x481(0x07)
	struct TArray<struct UItemAddon*> _itemAddons; // 0x488(0x10)
	struct TArray<struct UItemModifier*> _itemModifiers; // 0x498(0x10)
	int32_t _itemCount; // 0x4a8(0x04)
	enum class EAttachToSocketNameEnum _attachToSocketName; // 0x4ac(0x01)
	enum class EInventoryType _collectInInventoryType; // 0x4ad(0x01)
	char pad_4AE[0x2]; // 0x4ae(0x02)
	struct FGameplayTag _stateTagForCollector; // 0x4b0(0x0c)
	enum class ELoadoutItemType _itemType; // 0x4bc(0x01)
	bool _discardOnDrop; // 0x4bd(0x01)
	bool _discardWhenConsumed; // 0x4be(0x01)
	bool _disableAttachmentReplication; // 0x4bf(0x01)
	char pad_4C0[0x2]; // 0x4c0(0x02)
	bool _isInUse; // 0x4c2(0x01)
	bool _aimOnUse; // 0x4c3(0x01)
	char pad_4C4[0x4]; // 0x4c4(0x04)

	void SetVisibilityEvent(bool Visibility); // Function DeadByDaylight.Collectable.SetVisibilityEvent // (Native|Event|Protected|BlueprintEvent) // @ game+0x54ae4c0
	void SetItemInteractor(struct UInteractor* Interactor); // Function DeadByDaylight.Collectable.SetItemInteractor // (Final|Native|Public|BlueprintCallable) // @ game+0x54ae310
	void SetIsKeyPromptForceDisabled(bool IsKeyPromptForceDisabled); // Function DeadByDaylight.Collectable.SetIsKeyPromptForceDisabled // (Final|Native|Public) // @ game+0x54ae280
	void SetDisplayedInputType(enum class EInputInteractionType displayedInputType); // Function DeadByDaylight.Collectable.SetDisplayedInputType // (Final|Native|Public) // @ game+0x54ae0e0
	void SetCount(int32_t Count); // Function DeadByDaylight.Collectable.SetCount // (Final|Native|Public|BlueprintCallable) // @ game+0x54ae050
	void OnUseReleased(struct ADBDPlayer* collector); // Function DeadByDaylight.Collectable.OnUseReleased // (Native|Event|Protected|BlueprintEvent) // @ game+0x5482030
	void OnUse(); // Function DeadByDaylight.Collectable.OnUse // (Native|Event|Protected|BlueprintEvent) // @ game+0x3d13470
	void OnRep_State(); // Function DeadByDaylight.Collectable.OnRep_State // (Final|Native|Private) // @ game+0x54adc80
	void OnRep_Collector(struct ADBDPlayer* oldCollector); // Function DeadByDaylight.Collectable.OnRep_Collector // (Final|Native|Private) // @ game+0x54adb70
	void OnPostItemAddonsCreation(struct ADBDPlayer* Player); // Function DeadByDaylight.Collectable.OnPostItemAddonsCreation // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnDropped(struct ADBDPlayer* droppingPlayer); // Function DeadByDaylight.Collectable.OnDropped // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x54ada50
	void OnCustomizationChanged(); // Function DeadByDaylight.Collectable.OnCustomizationChanged // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnCollectorSetBPDelegate__DelegateSignature(struct ADBDPlayer* Player); // DelegateFunction DeadByDaylight.Collectable.OnCollectorSetBPDelegate__DelegateSignature // (Public|Delegate) // @ game+0x5e02c90
	void OnCollectorSetBP__DelegateSignature(struct ADBDPlayer* Player); // DelegateFunction DeadByDaylight.Collectable.OnCollectorSetBP__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x5e02c90
	void OnCollectorSet(struct ADBDPlayer* collector); // Function DeadByDaylight.Collectable.OnCollectorSet // (Native|Event|Protected|BlueprintEvent) // @ game+0x54ad9c0
	void OnAddonsRemoved(struct TArray<struct UItemAddon*>& addons); // Function DeadByDaylight.Collectable.OnAddonsRemoved // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x5e02c90
	void OnAddonsAdded(struct TArray<struct UItemAddon*>& addons); // Function DeadByDaylight.Collectable.OnAddonsAdded // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x5e02c90
	void OnActivateDissolveItem(); // Function DeadByDaylight.Collectable.OnActivateDissolveItem // (BlueprintCosmetic|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x5e02c90
	void Multicast_UseReleased(struct ADBDPlayer* collector); // Function DeadByDaylight.Collectable.Multicast_UseReleased // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x54ad930
	void Multicast_Use(); // Function DeadByDaylight.Collectable.Multicast_Use // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x3dad370
	void Multicast_RemoveItemAddon(struct UItemAddon* addon); // Function DeadByDaylight.Collectable.Multicast_RemoveItemAddon // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54ad8a0
	void Multicast_RemoveAllAddons(); // Function DeadByDaylight.Collectable.Multicast_RemoveAllAddons // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54ad880
	void Multicast_Dropped(struct ADBDPlayer* droppedBy, struct FVector Location, struct FRotator Rotation, enum class EItemDropType itemDropType); // Function DeadByDaylight.Collectable.Multicast_Dropped // (Net|NetReliableNative|Event|NetMulticast|Protected|HasDefaults) // @ game+0x54ad540
	void Multicast_Collected(struct ADBDPlayer* collector, enum class EInventoryType inventoryType); // Function DeadByDaylight.Collectable.Multicast_Collected // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x54ad2e0
	void Local_Dropped_Location(struct ADBDPlayer* droppedBy, struct FVector& Location, struct FRotator& Rotation); // Function DeadByDaylight.Collectable.Local_Dropped_Location // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x54ad1b0
	bool IsStored(); // Function DeadByDaylight.Collectable.IsStored // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ad180
	bool IsSpecialItem(); // Function DeadByDaylight.Collectable.IsSpecialItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ad150
	bool IsRechargeable(); // Function DeadByDaylight.Collectable.IsRechargeable // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x54ad120
	bool IsPickable(); // Function DeadByDaylight.Collectable.IsPickable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ad0f0
	bool IsOnGround(); // Function DeadByDaylight.Collectable.IsOnGround // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ad0c0
	bool IsLocallyControlled(); // Function DeadByDaylight.Collectable.IsLocallyControlled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ad090
	bool IsKeyPromptForceDisabled(); // Function DeadByDaylight.Collectable.IsKeyPromptForceDisabled // (Final|Native|Public|Const) // @ game+0x54ad060
	bool IsInSearchable(); // Function DeadByDaylight.Collectable.IsInSearchable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ad030
	bool IsEquipped(); // Function DeadByDaylight.Collectable.IsEquipped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54acfd0
	bool IsCursedItem(); // Function DeadByDaylight.Collectable.IsCursedItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54acfa0
	bool IsCountDisplayForced(); // Function DeadByDaylight.Collectable.IsCountDisplayForced // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x54acf70
	bool IsCollected(); // Function DeadByDaylight.Collectable.IsCollected // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54acf40
	bool HasGameplayModifierFlag(struct FGameplayTag modifierFlag); // Function DeadByDaylight.Collectable.HasGameplayModifierFlag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ace90
	float GetUsePercentLeft(); // Function DeadByDaylight.Collectable.GetUsePercentLeft // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54acdf0
	float GetModifierSum(struct FGameplayTag modifierType, float defaultValue); // Function DeadByDaylight.Collectable.GetModifierSum // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54acbd0
	float GetModifierMax(struct FGameplayTag modifierType, float defaultValue); // Function DeadByDaylight.Collectable.GetModifierMax // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54acad0
	struct UInteractor* GetItemInteractor(); // Function DeadByDaylight.Collectable.GetItemInteractor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54aca60
	char GetItemIconIndex(); // Function DeadByDaylight.Collectable.GetItemIconIndex // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x54aca30
	struct TArray<struct UItemAddon*> GetItemAddons(); // Function DeadByDaylight.Collectable.GetItemAddons // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x54ac9f0
	struct FString GetIconFilePath(); // Function DeadByDaylight.Collectable.GetIconFilePath // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ac990
	enum class EInputInteractionType GetDisplayedInputType(); // Function DeadByDaylight.Collectable.GetDisplayedInputType // (Final|Native|Public|Const) // @ game+0x54ac920
	int32_t GetCount(); // Function DeadByDaylight.Collectable.GetCount // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54ac8f0
	struct ADBDPlayer* GetCollector(); // Function DeadByDaylight.Collectable.GetCollector // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ac8c0
	void DebugPrintStats(); // Function DeadByDaylight.Collectable.DebugPrintStats // (Native|Event|Public|BlueprintEvent) // @ game+0x54ac7c0
	bool CanUse(struct ADBDPlayer* Player); // Function DeadByDaylight.Collectable.CanUse // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54ac700
	bool CanBeDropped(struct ADBDPlayer* dropper); // Function DeadByDaylight.Collectable.CanBeDropped // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54ac660
	bool CanBeCollected(struct ADBDPlayer* collector, bool assumeWillDropItem); // Function DeadByDaylight.Collectable.CanBeCollected // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54ac580
	void CallOnCollectorSetBP(struct FDelegate Callback); // Function DeadByDaylight.Collectable.CallOnCollectorSetBP // (Final|Native|Public|BlueprintCallable) // @ game+0x54ac4d0
	void BP_OnSurvivorAdded(struct ACamperPlayer* Survivor); // Function DeadByDaylight.Collectable.BP_OnSurvivorAdded // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void Authority_UseReleased(); // Function DeadByDaylight.Collectable.Authority_UseReleased // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x54ac470
	void Authority_Use(); // Function DeadByDaylight.Collectable.Authority_Use // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3d13490
	void Authority_RemoveItemAddon(struct UItemAddon* addon); // Function DeadByDaylight.Collectable.Authority_RemoveItemAddon // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x54ac3e0
	void Authority_OnConsumed(bool forceDiscard); // Function DeadByDaylight.Collectable.Authority_OnConsumed // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x54ac220
	void Authority_OnCollectorEndPlay(struct AActor* Actor, enum class EEndPlayReason EndPlayReason); // Function DeadByDaylight.Collectable.Authority_OnCollectorEndPlay // (Final|Native|Private) // @ game+0x54ac150
	void Authority_Discard(); // Function DeadByDaylight.Collectable.Authority_Discard // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x54ac0a0
	bool Authority_AddItemAddon(struct UItemAddon* addon); // Function DeadByDaylight.Collectable.Authority_AddItemAddon // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x54ac000
};

// Class DeadByDaylight.DBDGameState
// Size: 0x8e0 (Inherited: 0x2a8)
struct ADBDGameState : AGameState {
	char pad_2A8[0x30]; // 0x2a8(0x30)
	struct FMulticastInlineDelegate OnEscapeDoorActivated; // 0x2d8(0x10)
	char pad_2E8[0xa8]; // 0x2e8(0xa8)
	enum class EIntroState IntroState; // 0x390(0x01)
	char pad_391[0x7]; // 0x391(0x07)
	struct FMulticastInlineDelegate OnKillerIntroCompletePercentChanged; // 0x398(0x10)
	struct FMulticastInlineDelegate OnLightingGenerated; // 0x3a8(0x10)
	char pad_3B8[0x30]; // 0x3b8(0x30)
	struct USpecialEventGameplaySpawnerComponent* _specialEventGameplaySpawnerComponent; // 0x3e8(0x08)
	struct USpecialBehaviourGameplaySpawnerComponent* _specialBehaviourGameplaySpawnerComponent; // 0x3f0(0x08)
	struct FMulticastInlineDelegate AuthorityOnAllPlayerLoaded; // 0x3f8(0x10)
	char pad_408[0x18]; // 0x408(0x18)
	struct FMulticastInlineDelegate OnActivatedGeneratorCountChangedDynamic; // 0x420(0x10)
	struct FMulticastInlineDelegate OnSlasherSet; // 0x430(0x10)
	char pad_440[0x18]; // 0x440(0x18)
	struct FMulticastInlineDelegate OnObsessionChanged; // 0x458(0x10)
	int32_t SecondsLeftInLobby; // 0x468(0x04)
	char pad_46C[0x34]; // 0x46c(0x34)
	struct ASlasherPlayer* Slasher; // 0x4a0(0x08)
	struct URenderingFeaturesSequencer* _renderingSequencer; // 0x4a8(0x08)
	char pad_4B0[0x48]; // 0x4b0(0x48)
	int32_t _camperHookedInBasementCount; // 0x4f8(0x04)
	char pad_4FC[0x8]; // 0x4fc(0x08)
	enum class EServerUseNetAsyncLoading _useNetAsyncLoading; // 0x504(0x01)
	bool _gameLevelLoadingStarted; // 0x505(0x01)
	char pad_506[0x2]; // 0x506(0x02)
	struct FBuiltLevelData _builtLevelData; // 0x508(0xb0)
	struct FOfferingData _levelOfferings; // 0x5b8(0x18)
	struct AClipManager* _clipManager; // 0x5d0(0x08)
	struct FGuid _sessionId; // 0x5d8(0x10)
	struct FGuid _lobbyId; // 0x5e8(0x10)
	int32_t _activatedGeneratorCount; // 0x5f8(0x04)
	int32_t _requiredActivatedGeneratorCount; // 0x5fc(0x04)
	bool _escapeDoorActivated; // 0x600(0x01)
	bool _escapeDoorOpened; // 0x601(0x01)
	bool _isHatchOpen; // 0x602(0x01)
	bool _levelReadyToPlay; // 0x603(0x01)
	bool _playerDistributionReady; // 0x604(0x01)
	bool _usingWeakenedMechanic; // 0x605(0x01)
	char pad_606[0x2]; // 0x606(0x02)
	int32_t _survivorLeft; // 0x608(0x04)
	char pad_60C[0x4]; // 0x60c(0x04)
	struct TArray<struct AMeatHook*> _meatHooks; // 0x610(0x10)
	struct TArray<struct ASearchable*> _searchables; // 0x620(0x10)
	struct TArray<struct AGenerator*> _generators; // 0x630(0x10)
	struct TArray<struct AEscapeDoor*> _escapeDoors; // 0x640(0x10)
	struct TArray<struct AHatch*> _hatches; // 0x650(0x10)
	struct TArray<struct AReverseBearTrapRemover*> _reverseBearTrapRemovers; // 0x660(0x10)
	struct TArray<struct ABaseTrap*> _baseTraps; // 0x670(0x10)
	struct TArray<struct APallet*> _pallets; // 0x680(0x10)
	struct TArray<struct AWindow*> _windows; // 0x690(0x10)
	struct TArray<struct ALocker*> _lockers; // 0x6a0(0x10)
	struct TArray<struct ABreakableBase*> _breakableWalls; // 0x6b0(0x10)
	struct TArray<struct ATotem*> _totems; // 0x6c0(0x10)
	struct FBoxSphereBounds _mapBoxSphereBounds; // 0x6d0(0x1c)
	struct FBoxSphereBounds _basementBoxSphereBounds; // 0x6ec(0x1c)
	char pad_708[0x1c]; // 0x708(0x1c)
	int32_t _camperEscapedThroughHatch; // 0x724(0x04)
	struct ACamperPlayer* _obsessionTarget; // 0x728(0x08)
	bool _cachedObsessionEscaped; // 0x730(0x01)
	char pad_731[0x7]; // 0x731(0x07)
	int8_t _numberOfSurvivorsKilledOrSacrificed; // 0x738(0x01)
	char pad_739[0x7]; // 0x739(0x07)
	struct TArray<struct AInteractable*> _traps; // 0x740(0x10)
	struct TArray<struct UDBDDangerPredictionComponent*> _dangerPredictionObjects; // 0x750(0x10)
	char pad_760[0x8]; // 0x760(0x08)
	struct FGamePresetData _gamePresetData; // 0x768(0x90)
	bool _gameLevelLoaded; // 0x7f8(0x01)
	bool _gameLevelCreated; // 0x7f9(0x01)
	bool _gameLevelEnded; // 0x7fa(0x01)
	bool _gameTimedOut; // 0x7fb(0x01)
	enum class EEndGameReason _gameEndedReason; // 0x7fc(0x01)
	bool _isLoadoutFrozen; // 0x7fd(0x01)
	char pad_7FE[0x2]; // 0x7fe(0x02)
	struct UEndGameStateComponent* _endGameState; // 0x800(0x08)
	struct UScourgeHookManagerComponent* _scourgeHookManager; // 0x808(0x08)
	struct UActorPairQueryEvaluatorComponent* _actorPairQueryEvaluatorComponent; // 0x810(0x08)
	char pad_818[0x8]; // 0x818(0x08)
	struct UCharacterCollection* _characterCollection; // 0x820(0x08)
	struct UCollectableCollection* _collectableCollection; // 0x828(0x08)
	struct UServerTimeProviderComponent* _serverTimeProvider; // 0x830(0x08)
	struct UInGameAssetPreloaderComponent* _inGameAssetPreloaderComponent; // 0x838(0x08)
	struct UOnScreenDebugComponent* _onScreenDebugComponent; // 0x840(0x08)
	char pad_848[0x28]; // 0x848(0x28)
	struct FDateTime _matchStartTime; // 0x870(0x08)
	bool _isServerDedicated; // 0x878(0x01)
	char pad_879[0x3]; // 0x879(0x03)
	int32_t _maxSurvivorCount; // 0x87c(0x04)
	struct FString _serverBuildVersion; // 0x880(0x10)
	struct FString _serverContentVersion; // 0x890(0x10)
	struct FString _serverSessionId; // 0x8a0(0x10)
	struct FString _serverRegion; // 0x8b0(0x10)
	struct FString _serverMatchId; // 0x8c0(0x10)
	float _introDuration; // 0x8d0(0x04)
	bool _leaveSpectateRequested; // 0x8d4(0x01)
	char pad_8D5[0xb]; // 0x8d5(0x0b)

	void UpdateInGamePallets(); // Function DeadByDaylight.DBDGameState.UpdateInGamePallets // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x54df4c0
	void UnregisterFromIntroCompleteAndLevelReadyToPlay(struct UObject* inObject); // Function DeadByDaylight.DBDGameState.UnregisterFromIntroCompleteAndLevelReadyToPlay // (Final|Native|Public|BlueprintCallable) // @ game+0x54df430
	void SortOfferings(); // Function DeadByDaylight.DBDGameState.SortOfferings // (Final|Native|Public) // @ game+0x54df410
	void SetPlayersReadyToStart(bool playersReadyToStart); // Function DeadByDaylight.DBDGameState.SetPlayersReadyToStart // (Final|Native|Public|BlueprintCallable) // @ game+0x54df380
	void SetKillerIntroCompletedNormalized(float completedAmount); // Function DeadByDaylight.DBDGameState.SetKillerIntroCompletedNormalized // (Final|Native|Public|BlueprintCallable) // @ game+0x54df270
	void SetGameLevelEnded(enum class EEndGameReason endGameReason); // Function DeadByDaylight.DBDGameState.SetGameLevelEnded // (Final|Native|Public) // @ game+0x54df1f0
	void SetDisplayMapName(bool Display); // Function DeadByDaylight.DBDGameState.SetDisplayMapName // (Final|Native|Public|BlueprintCallable) // @ game+0x54df160
	void SetBuiltLevelData(struct FBuiltLevelData& BuiltLevelData); // Function DeadByDaylight.DBDGameState.SetBuiltLevelData // (Final|Native|Public|HasOutParms) // @ game+0x54df090
	void Server_UpdateGameRole(); // Function DeadByDaylight.DBDGameState.Server_UpdateGameRole // (Final|Native|Public) // @ game+0x54df070
	void ResetGameLevelStatus(); // Function DeadByDaylight.DBDGameState.ResetGameLevelStatus // (Final|Native|Public) // @ game+0x54df050
	void RemoveTrap(struct AInteractable* toRemove); // Function DeadByDaylight.DBDGameState.RemoveTrap // (Final|Native|Public|BlueprintCallable) // @ game+0x54defc0
	void RemoveDangerPredictionObject(struct UDBDDangerPredictionComponent* toRemove); // Function DeadByDaylight.DBDGameState.RemoveDangerPredictionObject // (Final|Native|Public|BlueprintCallable) // @ game+0x54def30
	void OnSlasherSetMultiDelegate__DelegateSignature(struct ASlasherPlayer* SlasherPlayer); // DelegateFunction DeadByDaylight.DBDGameState.OnSlasherSetMultiDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x5e02c90
	void OnRep_UseNetAsyncLoading(); // Function DeadByDaylight.DBDGameState.OnRep_UseNetAsyncLoading // (Final|Native|Private) // @ game+0x54dee80
	void OnRep_SurvivorLeft(int32_t oldValue); // Function DeadByDaylight.DBDGameState.OnRep_SurvivorLeft // (Final|Native|Private) // @ game+0x54dedf0
	void OnRep_SessionId(); // Function DeadByDaylight.DBDGameState.OnRep_SessionId // (Final|Native|Private) // @ game+0x54dedd0
	void OnRep_SecondsLeftInLobby(int32_t oldValue); // Function DeadByDaylight.DBDGameState.OnRep_SecondsLeftInLobby // (Final|Native|Private) // @ game+0x54ded40
	void OnRep_RequiredActivatedGeneratorCount(int32_t oldRequiredActivatedGeneratorCount); // Function DeadByDaylight.DBDGameState.OnRep_RequiredActivatedGeneratorCount // (Final|Native|Private) // @ game+0x54decb0
	void OnRep_OnLevelReadyToPlay(); // Function DeadByDaylight.DBDGameState.OnRep_OnLevelReadyToPlay // (Final|Native|Private) // @ game+0x54dec90
	void OnRep_OnGameLevelCreated(); // Function DeadByDaylight.DBDGameState.OnRep_OnGameLevelCreated // (Final|Native|Private) // @ game+0x54dec70
	void OnRep_ObsessionTarget(struct ACamperPlayer* previousObsessionTarget); // Function DeadByDaylight.DBDGameState.OnRep_ObsessionTarget // (Final|Native|Private) // @ game+0x54debe0
	void OnRep_NumberOfSurvivorsKilledOrSacrificed(int8_t oldValue); // Function DeadByDaylight.DBDGameState.OnRep_NumberOfSurvivorsKilledOrSacrificed // (Final|Native|Private) // @ game+0x54deb60
	void OnRep_LobbyId(); // Function DeadByDaylight.DBDGameState.OnRep_LobbyId // (Final|Native|Private) // @ game+0x54deb40
	void OnRep_HatchOpened(bool oldValue); // Function DeadByDaylight.DBDGameState.OnRep_HatchOpened // (Final|Native|Private) // @ game+0x54deab0
	void OnRep_GamePresetData(); // Function DeadByDaylight.DBDGameState.OnRep_GamePresetData // (Final|Native|Private) // @ game+0x54dea90
	void OnRep_GameLevelLoadingStarted(bool oldValue); // Function DeadByDaylight.DBDGameState.OnRep_GameLevelLoadingStarted // (Final|Native|Private) // @ game+0x54dea00
	void OnRep_EscapeDoorActivated(bool oldValue); // Function DeadByDaylight.DBDGameState.OnRep_EscapeDoorActivated // (Final|Native|Private) // @ game+0x54de970
	void OnRep_BuildLevelData(); // Function DeadByDaylight.DBDGameState.OnRep_BuildLevelData // (Final|Native|Private) // @ game+0x54de950
	void OnRep_ActivatedGeneratorCount(int32_t oldValue); // Function DeadByDaylight.DBDGameState.OnRep_ActivatedGeneratorCount // (Final|Native|Private) // @ game+0x54de8c0
	void OnPlayerGameStateChangedAddIfKilled(struct ADBDPlayerState* PlayerState, enum class EGameState GameState); // Function DeadByDaylight.DBDGameState.OnPlayerGameStateChangedAddIfKilled // (Final|Native|Private) // @ game+0x54de7f0
	void OnLevelReadyToPlayDelegate__DelegateSignature(); // DelegateFunction DeadByDaylight.DBDGameState.OnLevelReadyToPlayDelegate__DelegateSignature // (Public|Delegate) // @ game+0x5e02c90
	void OnIntroCompleteDelegate__DelegateSignature(); // DelegateFunction DeadByDaylight.DBDGameState.OnIntroCompleteDelegate__DelegateSignature // (Public|Delegate) // @ game+0x5e02c90
	void Multicast_UpdateCharacterFromGamePreset(struct ADBDPlayerState_Menu* playerState_Menu, struct FGamePresetData GamePresetData); // Function DeadByDaylight.DBDGameState.Multicast_UpdateCharacterFromGamePreset // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54de530
	void Multicast_SetServerLeftGame(bool hasServerLeftGame); // Function DeadByDaylight.DBDGameState.Multicast_SetServerLeftGame // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54de4a0
	void Multicast_SetLostServerConnection(bool hasLostServerConnection); // Function DeadByDaylight.DBDGameState.Multicast_SetLostServerConnection // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54de410
	void Multicast_SetGameLevelLoaded(bool gameLevelLoaded); // Function DeadByDaylight.DBDGameState.Multicast_SetGameLevelLoaded // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54de380
	void Multicast_SetGameLevelEnded(enum class EEndGameReason endGameReason); // Function DeadByDaylight.DBDGameState.Multicast_SetGameLevelEnded // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x54de300
	void Multicast_SetGameEnded(bool hasServerLeftGame); // Function DeadByDaylight.DBDGameState.Multicast_SetGameEnded // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54de270
	void Multicast_SetBuiltLevelData(struct FBuiltLevelData BuiltLevelData); // Function DeadByDaylight.DBDGameState.Multicast_SetBuiltLevelData // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54de1b0
	void Multicast_SendHVSPlusState(bool Enabled); // Function DeadByDaylight.DBDGameState.Multicast_SendHVSPlusState // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54de120
	void Multicast_SendEnsureToClients(struct FString ensure); // Function DeadByDaylight.DBDGameState.Multicast_SendEnsureToClients // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54de080
	void Multicast_OnGameStarted(); // Function DeadByDaylight.DBDGameState.Multicast_OnGameStarted // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54de060
	void Multicast_BroadcastOnLevelLoadingTimeOutClientEvent(); // Function DeadByDaylight.DBDGameState.Multicast_BroadcastOnLevelLoadingTimeOutClientEvent // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x54de040
	bool IsPlayerDistributionReady(); // Function DeadByDaylight.DBDGameState.IsPlayerDistributionReady // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ddf80
	bool IsOnePlayerLeft(); // Function DeadByDaylight.DBDGameState.IsOnePlayerLeft // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ddf50
	bool IsOfferingReceived(); // Function DeadByDaylight.DBDGameState.IsOfferingReceived // (Final|Native|Public|Const) // @ game+0x54ddf20
	bool IsObsessionTargetAliveInLevel(); // Function DeadByDaylight.DBDGameState.IsObsessionTargetAliveInLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x54ddef0
	bool IsObsessionTargetAlive(); // Function DeadByDaylight.DBDGameState.IsObsessionTargetAlive // (Final|Native|Public|BlueprintCallable) // @ game+0x54ddec0
	bool IsLightingGenerated(); // Function DeadByDaylight.DBDGameState.IsLightingGenerated // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ddea0
	bool IsLevelSetupDone(); // Function DeadByDaylight.DBDGameState.IsLevelSetupDone // (Final|Native|Public|Const) // @ game+0x54dde70
	bool IsLevelReadyToPlay(); // Function DeadByDaylight.DBDGameState.IsLevelReadyToPlay // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dde50
	bool IsIntroCompleted(); // Function DeadByDaylight.DBDGameState.IsIntroCompleted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dde20
	bool IsHatchVisible(); // Function DeadByDaylight.DBDGameState.IsHatchVisible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dddf0
	bool IsEscapeRequirementCompleted(); // Function DeadByDaylight.DBDGameState.IsEscapeRequirementCompleted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dddc0
	bool IsEscapeDoorOpen(); // Function DeadByDaylight.DBDGameState.IsEscapeDoorOpen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ddd60
	bool IsEscapeDoorActivated(); // Function DeadByDaylight.DBDGameState.IsEscapeDoorActivated // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ddd30
	void IntroCompleted(); // Function DeadByDaylight.DBDGameState.IntroCompleted // (Final|Native|Public|BlueprintCallable) // @ game+0x54ddd10
	struct TArray<struct AInteractable*> GetTraps(); // Function DeadByDaylight.DBDGameState.GetTraps // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ddc40
	struct TArray<struct ATotem*> GetTotems(); // Function DeadByDaylight.DBDGameState.GetTotems // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ddbb0
	int32_t GetSurvivorLeft(); // Function DeadByDaylight.DBDGameState.GetSurvivorLeft // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ddb90
	struct USpecialEventGameplaySpawnerComponent* GetSpecialEventGameplaySpawnerComponent(); // Function DeadByDaylight.DBDGameState.GetSpecialEventGameplaySpawnerComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54ddb60
	struct TArray<struct FSelectedOffering> GetSelectedOfferings(); // Function DeadByDaylight.DBDGameState.GetSelectedOfferings // (Final|Native|Public|Const) // @ game+0x54ddb30
	bool GetSelectedOffering(int32_t index, struct FSelectedOffering& SelectedOffering); // Function DeadByDaylight.DBDGameState.GetSelectedOffering // (Final|Native|Public|HasOutParms|Const) // @ game+0x54dda40
	int32_t GetRequiredActivatedGeneratorCount(); // Function DeadByDaylight.DBDGameState.GetRequiredActivatedGeneratorCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dda10
	int32_t GetRemainingGeneratorsNeeded(); // Function DeadByDaylight.DBDGameState.GetRemainingGeneratorsNeeded // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd9e0
	struct ADBDPlayerState* GetPlayerStateByMirrorsID(struct FString ID); // Function DeadByDaylight.DBDGameState.GetPlayerStateByMirrorsID // (Final|Native|Public|Const) // @ game+0x54dd930
	struct ADBDPlayerState* GetPlayerStateByIDString(struct FString ID, bool isReplacementBot); // Function DeadByDaylight.DBDGameState.GetPlayerStateByIDString // (Final|Native|Public|Const) // @ game+0x54dd840
	bool GetPlayersReadyToStart(); // Function DeadByDaylight.DBDGameState.GetPlayersReadyToStart // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dcf20
	void GetPlayerRoleCounts(int32_t& survivorCount, int32_t& killerCount, int32_t& spectatorCount); // Function DeadByDaylight.DBDGameState.GetPlayerRoleCounts // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd700
	struct ACamperPlayer* GetObsessionTarget(); // Function DeadByDaylight.DBDGameState.GetObsessionTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd6e0
	int32_t GetNumberOfOtherActiveSurvivors(struct ADBDPlayer* exception); // Function DeadByDaylight.DBDGameState.GetNumberOfOtherActiveSurvivors // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd640
	int32_t GetNumberOfActiveSurvivors(); // Function DeadByDaylight.DBDGameState.GetNumberOfActiveSurvivors // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd610
	struct FName GetMapThemeName(); // Function DeadByDaylight.DBDGameState.GetMapThemeName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd5d0
	struct ADBDPlayer* GetLocalPlayerPawn(); // Function DeadByDaylight.DBDGameState.GetLocalPlayerPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd5a0
	struct APawn* GetLocalPlayerBasePawn(); // Function DeadByDaylight.DBDGameState.GetLocalPlayerBasePawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd570
	struct TSoftObjectPtr<UAkAudioBank> GetLevelThemeAudioSoundBankAssetPtr(); // Function DeadByDaylight.DBDGameState.GetLevelThemeAudioSoundBankAssetPtr // (Final|Native|Public|Const) // @ game+0x54dd500
	struct FBuiltLevelData GetLevelData(); // Function DeadByDaylight.DBDGameState.GetLevelData // (Final|Native|Public|Const) // @ game+0x54dd4d0
	float GetKillerIntroCompletedNormalized(); // Function DeadByDaylight.DBDGameState.GetKillerIntroCompletedNormalized // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd4b0
	struct ASlasherPlayer* GetKiller(); // Function DeadByDaylight.DBDGameState.GetKiller // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd480
	bool GetIsGameEnded(); // Function DeadByDaylight.DBDGameState.GetIsGameEnded // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd450
	struct TArray<struct AWindow*> GetInGameWindows(); // Function DeadByDaylight.DBDGameState.GetInGameWindows // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd3c0
	struct TArray<struct ASearchable*> GetInGameSearchables(); // Function DeadByDaylight.DBDGameState.GetInGameSearchables // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd330
	struct TArray<struct AReverseBearTrapRemover*> GetInGameReverseBearTrapRemovers(); // Function DeadByDaylight.DBDGameState.GetInGameReverseBearTrapRemovers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd2a0
	struct TArray<struct APallet*> GetInGamePallets(); // Function DeadByDaylight.DBDGameState.GetInGamePallets // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd210
	struct TArray<struct AMeatHook*> GetInGameMeatHooks(); // Function DeadByDaylight.DBDGameState.GetInGameMeatHooks // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd180
	struct TArray<struct AHatch*> GetInGameHatches(); // Function DeadByDaylight.DBDGameState.GetInGameHatches // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd0f0
	struct TArray<struct AGenerator*> GetInGameGenerators(); // Function DeadByDaylight.DBDGameState.GetInGameGenerators // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dd060
	struct TArray<struct AEscapeDoor*> GetInGameEscapeDoors(); // Function DeadByDaylight.DBDGameState.GetInGameEscapeDoors // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dcfd0
	struct TArray<struct ABaseTrap*> GetInGameBaseTraps(); // Function DeadByDaylight.DBDGameState.GetInGameBaseTraps // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dcf40
	bool GetGameLevelLoadingStarted(); // Function DeadByDaylight.DBDGameState.GetGameLevelLoadingStarted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dcf20
	bool GetGameLevelLoaded(); // Function DeadByDaylight.DBDGameState.GetGameLevelLoaded // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dcf00
	struct UEndGameStateComponent* GetEndGameStateComponent(); // Function DeadByDaylight.DBDGameState.GetEndGameStateComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dced0
	struct TArray<struct UDBDDangerPredictionComponent*> GetDangerPredictionObjects(bool isObjectDynamic); // Function DeadByDaylight.DBDGameState.GetDangerPredictionObjects // (Final|Native|Public|BlueprintCallable) // @ game+0x54dce10
	struct UCollectableCollection* GetCollectableCollection(); // Function DeadByDaylight.DBDGameState.GetCollectableCollection // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54d7c30
	struct UCharacterCollection* GetCharacterCollection(); // Function DeadByDaylight.DBDGameState.GetCharacterCollection // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dcde0
	struct TArray<struct UDBDDangerPredictionComponent*> GetAllDangerPredictionObjects(); // Function DeadByDaylight.DBDGameState.GetAllDangerPredictionObjects // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54dcdb0
	void CallOnSlasherSet(struct FDelegate Callback); // Function DeadByDaylight.DBDGameState.CallOnSlasherSet // (Final|Native|Public|BlueprintCallable) // @ game+0x54dcd00
	void CallOnLevelReadyToPlay(struct FDelegate Callback); // Function DeadByDaylight.DBDGameState.CallOnLevelReadyToPlay // (Final|Native|Public|BlueprintCallable) // @ game+0x54dcc50
	void CallOnIntroComplete(struct FDelegate Callback); // Function DeadByDaylight.DBDGameState.CallOnIntroComplete // (Final|Native|Public|BlueprintCallable) // @ game+0x54dcba0
	void BroadcastOnSetBuildLevelData(); // Function DeadByDaylight.DBDGameState.BroadcastOnSetBuildLevelData // (Final|Native|Public) // @ game+0x54dcb80
	void Authority_SignalEscapeDoorActivated(bool newEscapeDoorActivated); // Function DeadByDaylight.DBDGameState.Authority_SignalEscapeDoorActivated // (Final|Native|Public|BlueprintCallable) // @ game+0x54dcaf0
	void Authority_SetSurvivorLeft(int32_t survivorRemaining); // Function DeadByDaylight.DBDGameState.Authority_SetSurvivorLeft // (Final|Native|Public) // @ game+0x54dca60
	void Authority_SetObsessionTarget(struct ACamperPlayer* obsessionTarget); // Function DeadByDaylight.DBDGameState.Authority_SetObsessionTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x54dc9d0
	void Authority_SetLevelReadyToPlay(); // Function DeadByDaylight.DBDGameState.Authority_SetLevelReadyToPlay // (Final|Native|Public|BlueprintCallable) // @ game+0x54dc9b0
	void Authority_SetHatchOpen(bool OPENED); // Function DeadByDaylight.DBDGameState.Authority_SetHatchOpen // (Final|Native|Public|BlueprintCallable) // @ game+0x54dc920
	void Authority_SetGameStarted(); // Function DeadByDaylight.DBDGameState.Authority_SetGameStarted // (Final|Native|Public) // @ game+0x54dc900
	void Authority_SetGameSelectedOffering(struct TArray<struct FSelectedOffering>& offerings); // Function DeadByDaylight.DBDGameState.Authority_SetGameSelectedOffering // (Final|Native|Public|HasOutParms) // @ game+0x54dc850
	void Authority_SetGameLevelLoaded(); // Function DeadByDaylight.DBDGameState.Authority_SetGameLevelLoaded // (Final|Native|Public) // @ game+0x54dc830
	void Authority_SetGameLevelEnded(enum class EEndGameReason endGameReason); // Function DeadByDaylight.DBDGameState.Authority_SetGameLevelEnded // (Final|Native|Public) // @ game+0x54dc7b0
	void Authority_SetGameLevelCreated(); // Function DeadByDaylight.DBDGameState.Authority_SetGameLevelCreated // (Final|Native|Public) // @ game+0x54dc790
	void Authority_SetEscapeDoorOpened(bool OPENED); // Function DeadByDaylight.DBDGameState.Authority_SetEscapeDoorOpened // (Final|Native|Public|BlueprintCallable) // @ game+0x54dc700
	void Authority_SetAllPlayerLoaded(); // Function DeadByDaylight.DBDGameState.Authority_SetAllPlayerLoaded // (Final|Native|Public) // @ game+0x54dc6e0
	void Authority_EvaluateObsessionTarget(struct ADBDPlayer* potentialTarget); // Function DeadByDaylight.DBDGameState.Authority_EvaluateObsessionTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x54dc650
	void Authority_EscapeThroughHatch(); // Function DeadByDaylight.DBDGameState.Authority_EscapeThroughHatch // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x54dc630
	void Authority_EnableObsession(); // Function DeadByDaylight.DBDGameState.Authority_EnableObsession // (Final|Native|Public|BlueprintCallable) // @ game+0x54dc610
	void Authority_DeactivateAI(); // Function DeadByDaylight.DBDGameState.Authority_DeactivateAI // (Final|Native|Public) // @ game+0x54dc5f0
	void AddTrap(struct AInteractable* toAdd); // Function DeadByDaylight.DBDGameState.AddTrap // (Final|Native|Public|BlueprintCallable) // @ game+0x54dc530
	void AddDangerPredictionObject(struct UDBDDangerPredictionComponent* toAdd); // Function DeadByDaylight.DBDGameState.AddDangerPredictionObject // (Final|Native|Public|BlueprintCallable) // @ game+0x54dc4a0
};

// Class DeadByDaylight.AttackableComponent
// Size: 0xb8 (Inherited: 0xb8)
struct UAttackableComponent : UActorComponent {
};

// Class DeadByDaylight.PresentationItemProgressComponent
// Size: 0xc0 (Inherited: 0xb8)
struct UPresentationItemProgressComponent : UActorComponent {
	char pad_B8[0x8]; // 0xb8(0x08)
};

// Class DeadByDaylight.MapSpecificGameStateComponent
// Size: 0xb8 (Inherited: 0xb8)
struct UMapSpecificGameStateComponent : UActorComponent {
};

// Class DeadByDaylight.ScreenIndicatorWorldMarkerComponent
// Size: 0x230 (Inherited: 0x220)
struct UScreenIndicatorWorldMarkerComponent : USceneComponent {
	enum class EHudScreenIndicatorType HudScreenIndicatorType; // 0x218(0x01)
	struct FFloatRange VisibleDistanceRange; // 0x21c(0x10)
};

// Class DeadByDaylight.SurvivorCollectableOutlineUpdateStrategy
// Size: 0xe0 (Inherited: 0xc0)
struct USurvivorCollectableOutlineUpdateStrategy : UOutlineUpdateStrategy {
	struct FLinearColor _outlineColor; // 0xc0(0x10)
	struct FLinearColor _nearlyConsumedColor; // 0xd0(0x10)
};

// Class DeadByDaylight.DBDEmblem
// Size: 0x108 (Inherited: 0xb8)
struct UDBDEmblem : UActorComponent {
	float _points; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct TArray<struct FProgressionPoints> _progressionPoints; // 0xc0(0x10)
	struct FDataTableRowHandle _definition; // 0xd0(0x18)
	char pad_E8[0x20]; // 0xe8(0x20)

	void Client_FinalizeReplication(float Points, struct TArray<struct FProgressionPoints> ProgressionPoints); // Function DeadByDaylight.DBDEmblem.Client_FinalizeReplication // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x54d5dc0
};

// Class DeadByDaylight.AbstractGameFlowHandler
// Size: 0x38 (Inherited: 0x38)
struct UAbstractGameFlowHandler : UGameInstanceSubsystem {
};

// Class DeadByDaylight.AchievementHelper
// Size: 0x30 (Inherited: 0x30)
struct UAchievementHelper : UObject {
};

// Class DeadByDaylight.ActionButton
// Size: 0x5a8 (Inherited: 0x338)
struct UActionButton : UMobileBaseUserWidget {
	struct FSlateBrush DefaultImage; // 0x338(0x90)
	struct UImage* IconImage; // 0x3c8(0x08)
	struct UImage* ToggleSmokeImage; // 0x3d0(0x08)
	struct UButton* Button; // 0x3d8(0x08)
	float DefaultOpacity; // 0x3e0(0x04)
	float ToggledOpacity; // 0x3e4(0x04)
	float DisabledOpacity; // 0x3e8(0x04)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	struct FSlateBrush Normal; // 0x3f0(0x90)
	struct FSlateBrush Toggled; // 0x480(0x90)
	struct FSlateBrush Disabled; // 0x510(0x90)
	enum class EActionButtonState _currentState; // 0x5a0(0x01)
	enum class EActionButtonState _previousState; // 0x5a1(0x01)
	char pad_5A2[0x6]; // 0x5a2(0x06)

	void SetState(enum class EActionButtonState State); // Function DeadByDaylight.ActionButton.SetState // (Final|Native|Public|BlueprintCallable) // @ game+0x545ff80
	void SetSlateBrush(struct FSlateBrush& InBrush); // Function DeadByDaylight.ActionButton.SetSlateBrush // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x545fe70
	void SetPreviousState(); // Function DeadByDaylight.ActionButton.SetPreviousState // (Final|Native|Protected|BlueprintCallable) // @ game+0x545fdc0
	void SetIcon(struct FSlateBrush SlateBrush); // Function DeadByDaylight.ActionButton.SetIcon // (Final|Native|Public|BlueprintCallable) // @ game+0x545fc40
	void PlayBecameAvailableAnimation(); // Function DeadByDaylight.ActionButton.PlayBecameAvailableAnimation // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x5e02c90
};

// Class DeadByDaylight.BasePerkIconStrategy
// Size: 0x38 (Inherited: 0x30)
struct UBasePerkIconStrategy : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	bool GetIsRechargeableActive(struct UPerk* Perk); // Function DeadByDaylight.BasePerkIconStrategy.GetIsRechargeableActive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5481c90
	bool GetIsRechargeable(struct UPerk* Perk); // Function DeadByDaylight.BasePerkIconStrategy.GetIsRechargeable // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5481bf0
	float GetDisplayPercent(struct UPerk* Perk); // Function DeadByDaylight.BasePerkIconStrategy.GetDisplayPercent // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5481b20
};

// Class DeadByDaylight.ActivationAndTimerIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActivationAndTimerIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActivationTimerElapsedCooldownElapsedIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActivationTimerElapsedCooldownElapsedIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActivationTimerElapsedCooldownRemainingIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActivationTimerElapsedCooldownRemainingIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActivationTimerElapsedIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActivationTimerElapsedIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActivationTimerIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActivationTimerIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActivationTimerRemainingCooldownElapsedIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActivationTimerRemainingCooldownElapsedIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActivationTimerRemainingPercentIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActivationTimerRemainingPercentIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActiveOnTimerOrApplicablePerkIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActiveOnTimerOrApplicablePerkIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActiveOnTimerPerkIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActiveOnTimerPerkIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActiveWhenApplicableAndActivationAndCooldownPerkIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActiveWhenApplicableAndActivationAndCooldownPerkIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActiveWhenApplicableAndEnabledPerkIconStrategy
// Size: 0x40 (Inherited: 0x38)
struct UActiveWhenApplicableAndEnabledPerkIconStrategy : UBasePerkIconStrategy {
	char pad_38[0x8]; // 0x38(0x08)
};

// Class DeadByDaylight.ActiveWhenApplicableAndNotCampingPerkIconStrategy
// Size: 0x40 (Inherited: 0x38)
struct UActiveWhenApplicableAndNotCampingPerkIconStrategy : UBasePerkIconStrategy {
	char pad_38[0x8]; // 0x38(0x08)
};

// Class DeadByDaylight.ActiveWhenApplicablePerkIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActiveWhenApplicablePerkIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActiveWhenKOdAndCooldownTimerPerkIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UActiveWhenKOdAndCooldownTimerPerkIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ActorClipperComponent
// Size: 0x138 (Inherited: 0xb8)
struct UActorClipperComponent : UActorComponent {
	struct USphereComponent* Shape; // 0xb8(0x08)
	struct TMap<struct AActor*, struct FClippedActor> _clippedActors; // 0xc0(0x50)
	struct TWeakObjectPtr<struct UPrimitiveCollection> _clippables; // 0x110(0x08)
	char pad_118[0x20]; // 0x118(0x20)

	void SetPrimitiveCollection(struct UPrimitiveCollection* clippables); // Function DeadByDaylight.ActorClipperComponent.SetPrimitiveCollection // (Final|Native|Public|BlueprintCallable) // @ game+0x545fde0
	void OnOwnerLocallyObservedChanged(bool locallyObserved); // Function DeadByDaylight.ActorClipperComponent.OnOwnerLocallyObservedChanged // (Final|Native|Private) // @ game+0x545fa00
	void OnCameraChanged(enum class EDBDCameraSocketID socketId); // Function DeadByDaylight.ActorClipperComponent.OnCameraChanged // (Final|Native|Private) // @ game+0x545f760
};

// Class DeadByDaylight.ActorComponentExt
// Size: 0x30 (Inherited: 0x30)
struct UActorComponentExt : UBlueprintFunctionLibrary {

	bool IsLocallyObserved(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.IsLocallyObserved // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545f600
	bool IsLocallyControlled(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.IsLocallyControlled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545f530
	bool HasAuthority(struct UActorComponent* ActorComponent); // Function DeadByDaylight.ActorComponentExt.HasAuthority // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545f3e0
	struct AActor* GetValidatedOwner(struct UActorComponent* ActorComponent); // Function DeadByDaylight.ActorComponentExt.GetValidatedOwner // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545f350
	struct ACamperPlayer* GetOwningSurvivorChecked(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.GetOwningSurvivorChecked // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545f280
	struct ACamperPlayer* GetOwningSurvivor(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.GetOwningSurvivor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545f1b0
	struct ADBDPlayer* GetOwningPlayerInHierarchy(struct UActorComponent* ActorComponent); // Function DeadByDaylight.ActorComponentExt.GetOwningPlayerInHierarchy // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545f120
	struct ADBDPlayer* GetOwningPlayerChecked(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.GetOwningPlayerChecked // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545f050
	struct ADBDPlayer* GetOwningPlayer(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.GetOwningPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545ef80
	struct APawn* GetOwningPawnChecked(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.GetOwningPawnChecked // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545eeb0
	struct APawn* GetOwningPawn(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.GetOwningPawn // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545ede0
	struct ASlasherPlayer* GetOwningKiller(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.GetOwningKiller // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545ed10
	struct ACharacter* GetOwningCharacterChecked(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.GetOwningCharacterChecked // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545ec40
	struct ACharacter* GetOwningCharacter(struct UActorComponent* ActorComponent, bool recursiveSearch); // Function DeadByDaylight.ActorComponentExt.GetOwningCharacter // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x545eb70
};

// Class DeadByDaylight.ActorDependency
// Size: 0xc8 (Inherited: 0xb8)
struct UActorDependency : UActorComponent {
	struct TArray<struct FDependency> Dependencies; // 0xb8(0x10)
};

// Class DeadByDaylight.ActorDetectorComponent
// Size: 0xe0 (Inherited: 0xb8)
struct UActorDetectorComponent : UActorComponent {
	struct FMulticastInlineDelegate OnActorDetected; // 0xb8(0x10)
	struct TArray<struct UObject*> CollectedTypes; // 0xc8(0x10)
	struct UPrimitiveComponent* _primitive; // 0xd8(0x08)

	void SetDetectionPrimitive(struct UPrimitiveComponent* Primitive); // Function DeadByDaylight.ActorDetectorComponent.SetDetectionPrimitive // (Final|Native|Public|BlueprintCallable) // @ game+0x545fbb0
	void OnOverlapEnter(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DeadByDaylight.ActorDetectorComponent.OnOverlapEnter // (Final|Native|Protected|HasOutParms) // @ game+0x545f7e0
};

// Class DeadByDaylight.ActorKnowledgeCollection
// Size: 0x108 (Inherited: 0xb8)
struct UActorKnowledgeCollection : UActorComponent {
	char pad_B8[0x18]; // 0xb8(0x18)
	struct TArray<struct AActor*> _actors; // 0xd0(0x10)
	struct TArray<struct AActor*> _previousActors; // 0xe0(0x10)
	bool _available; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
	struct ACharacter* _possessor; // 0xf8(0x08)
	enum class EKnowledgeSharingType _sharing; // 0x100(0x01)
	char pad_101[0x7]; // 0x101(0x07)

	void OnRep_Actors(); // Function DeadByDaylight.ActorKnowledgeCollection.OnRep_Actors // (Final|Native|Private) // @ game+0x545fa90
	void Local_SetAvailable(bool value); // Function DeadByDaylight.ActorKnowledgeCollection.Local_SetAvailable // (Final|Native|Public|BlueprintCallable) // @ game+0x545f6d0
	bool IsAvailable(struct ACharacter* Character); // Function DeadByDaylight.ActorKnowledgeCollection.IsAvailable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x545f470
	bool Contains(struct AActor* Actor); // Function DeadByDaylight.ActorKnowledgeCollection.Contains // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x545ea80
	void Authority_SetSharingType(enum class EKnowledgeSharingType value); // Function DeadByDaylight.ActorKnowledgeCollection.Authority_SetSharingType // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x545e9e0
	void Authority_SetPossessor(struct ACharacter* possessor); // Function DeadByDaylight.ActorKnowledgeCollection.Authority_SetPossessor // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x545e950
	void Authority_SetAvailable(bool value); // Function DeadByDaylight.ActorKnowledgeCollection.Authority_SetAvailable // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x545e8c0
	void Authority_Remove(struct AActor* Actor); // Function DeadByDaylight.ActorKnowledgeCollection.Authority_Remove // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x545e830
	void Authority_Empty(); // Function DeadByDaylight.ActorKnowledgeCollection.Authority_Empty // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x545e810
	void Authority_Append(struct TArray<struct AActor*>& Actors); // Function DeadByDaylight.ActorKnowledgeCollection.Authority_Append // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x545e760
	bool Authority_Add(struct AActor* Actor); // Function DeadByDaylight.ActorKnowledgeCollection.Authority_Add // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x545e6c0
};

// Class DeadByDaylight.ActorSpawner
// Size: 0x2f0 (Inherited: 0x220)
struct UActorSpawner : USceneComponent {
	char pad_220[0x8]; // 0x220(0x08)
	enum class EGameplayElementType Type; // 0x228(0x01)
	char pad_229[0x7]; // 0x229(0x07)
	struct TSoftClassPtr<UObject> Visualization; // 0x230(0x30)
	bool ActivatedByDefault; // 0x260(0x01)
	char pad_261[0x7]; // 0x261(0x07)
	struct TArray<struct FActorSpawnerProperties> ActivatedSceneElement; // 0x268(0x10)
	struct TArray<struct FActorSpawnerProperties> DeactivatedSceneElement; // 0x278(0x10)
	float Weight; // 0x288(0x04)
	int32_t SpawnCountMax; // 0x28c(0x04)
	int32_t SpawnPriorityTier; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)
	struct TArray<struct FName> TagsToBePassedOverToActor; // 0x298(0x10)
	bool AttachSpawnedActorToAttachedSocket; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	struct FMulticastInlineDelegate OnAsyncActorSpawned; // 0x2b0(0x10)
	char pad_2C0[0x8]; // 0x2c0(0x08)
	bool WeightInfluenceable; // 0x2c8(0x01)
	bool WeightInfluencer; // 0x2c9(0x01)
	char pad_2CA[0x2]; // 0x2ca(0x02)
	float Cost; // 0x2cc(0x04)
	struct UObject* _toSpawn; // 0x2d0(0x08)
	char pad_2D8[0x8]; // 0x2d8(0x08)
	struct TWeakObjectPtr<struct AActor> _spawnedActorOnAuthority; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)

	bool UseActivatedElement(); // Function DeadByDaylight.ActorSpawner.UseActivatedElement // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5460000
	bool IsEnabled(); // Function DeadByDaylight.ActorSpawner.IsEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x545f510
	void EditorForceSpawnVisualization(); // Function DeadByDaylight.ActorSpawner.EditorForceSpawnVisualization // (Final|Native|Public|BlueprintCallable) // @ game+0x545eb20
	void AuthoritySelect(bool Selected); // Function DeadByDaylight.ActorSpawner.AuthoritySelect // (Final|Native|Public|BlueprintCallable) // @ game+0x545e630
	struct AActor* AuthorityGetSpawnedActor(); // Function DeadByDaylight.ActorSpawner.AuthorityGetSpawnedActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x545e600
	void Authority_SpawnActorAsyncEvent(); // Function DeadByDaylight.ActorSpawner.Authority_SpawnActorAsyncEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x545ea60
};

// Class DeadByDaylight.ObjectRandomizer
// Size: 0x230 (Inherited: 0x220)
struct UObjectRandomizer : USceneComponent {
	struct TArray<struct UActorSpawner*> Spawners; // 0x218(0x10)
	int32_t MinPopulation; // 0x228(0x04)
	int32_t MaxPopulation; // 0x22c(0x04)
};

// Class DeadByDaylight.ActorSpawnerRandomizer
// Size: 0x250 (Inherited: 0x230)
struct UActorSpawnerRandomizer : UObjectRandomizer {
	struct TArray<struct FSpawnerElement> ActivatedSpawnerContentLists; // 0x230(0x10)
	struct TArray<struct FSpawnerElement> DeactivatedSpawnerContentLists; // 0x240(0x10)
};

// Class DeadByDaylight.ActorVariationSpawner
// Size: 0x270 (Inherited: 0x220)
struct UActorVariationSpawner : USceneComponent {
	struct TSoftClassPtr<UObject> Visualization; // 0x218(0x30)
	struct TArray<struct FActorVariationElements> Variations; // 0x248(0x10)
	struct UObject* _toSpawn; // 0x260(0x08)
	char pad_268[0x8]; // 0x268(0x08)
};

// Class DeadByDaylight.AIBotsManager
// Size: 0x70 (Inherited: 0x38)
struct UAIBotsManager : UGameInstanceSubsystem {
	char pad_38[0x38]; // 0x38(0x38)
};

// Class DeadByDaylight.AICharacterBehaviourData
// Size: 0x30 (Inherited: 0x30)
struct UAICharacterBehaviourData : UObject {
};

// Class DeadByDaylight.AICharacterBehaviour
// Size: 0x58 (Inherited: 0x30)
struct UAICharacterBehaviour : UObject {
	char pad_30[0x28]; // 0x30(0x28)

	void Update(float DeltaTime); // Function DeadByDaylight.AICharacterBehaviour.Update // (Native|Public) // @ game+0x48e0450
	void Stop(); // Function DeadByDaylight.AICharacterBehaviour.Stop // (Native|Public) // @ game+0x45f6400
	void Start(); // Function DeadByDaylight.AICharacterBehaviour.Start // (Native|Public) // @ game+0x54651c0
	void SetEnable(bool enable); // Function DeadByDaylight.AICharacterBehaviour.SetEnable // (Final|Native|Public) // @ game+0x5465130
	void Resume(); // Function DeadByDaylight.AICharacterBehaviour.Resume // (Native|Public) // @ game+0x46a27c0
	void Pause(); // Function DeadByDaylight.AICharacterBehaviour.Pause // (Native|Public) // @ game+0x46a27a0
	bool IsEnabled(); // Function DeadByDaylight.AICharacterBehaviour.IsEnabled // (Final|Native|Public|Const) // @ game+0x4634ce0
};

// Class DeadByDaylight.AICharacterBehaviourInteractWithActor
// Size: 0x90 (Inherited: 0x58)
struct UAICharacterBehaviourInteractWithActor : UAICharacterBehaviour {
	struct ADBDPlayer* _aiPlayer; // 0x58(0x08)
	struct ADBDAIPlayerController* _aiPlayerController; // 0x60(0x08)
	struct UAICharacterBehaviourInteractWithActorData* _behaviourData; // 0x68(0x08)
	char pad_70[0x20]; // 0x70(0x20)

	void OnMovementFinished(struct FAIRequestID RequestID, enum class EPathFollowingResult Result); // Function DeadByDaylight.AICharacterBehaviourInteractWithActor.OnMovementFinished // (Final|Native|Private) // @ game+0x5464c40
};

// Class DeadByDaylight.AICharacterBehaviourDropPallet
// Size: 0x98 (Inherited: 0x90)
struct UAICharacterBehaviourDropPallet : UAICharacterBehaviourInteractWithActor {
	struct APallet* _targetPallet; // 0x90(0x08)
};

// Class DeadByDaylight.AICharacterBehaviourInteractWithActorData
// Size: 0x50 (Inherited: 0x30)
struct UAICharacterBehaviourInteractWithActorData : UAICharacterBehaviourData {
	struct AActor* TargetActor; // 0x30(0x08)
	char pad_38[0x10]; // 0x38(0x10)
	enum class ECharacterMovementTypes characterMovementType; // 0x48(0x01)
	bool usePathfinding; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)

	void WatchGameEventTypes(struct TArray<struct FGameplayTag> gameEventTypes); // Function DeadByDaylight.AICharacterBehaviourInteractWithActorData.WatchGameEventTypes // (Final|Native|Public|BlueprintCallable) // @ game+0x5465420
	void WatchGameEventType(struct FGameplayTag gameEventType); // Function DeadByDaylight.AICharacterBehaviourInteractWithActorData.WatchGameEventType // (Final|Native|Public|BlueprintCallable) // @ game+0x5465380
	void Init(struct AActor* Actor, enum class ECharacterMovementTypes characterMovementType, bool usePathfinding); // Function DeadByDaylight.AICharacterBehaviourInteractWithActorData.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x5464050
};

// Class DeadByDaylight.AICharacterBehaviourInteractWithHook
// Size: 0x98 (Inherited: 0x90)
struct UAICharacterBehaviourInteractWithHook : UAICharacterBehaviourInteractWithActor {
	struct AMeatHook* _targetHook; // 0x90(0x08)
};

// Class DeadByDaylight.AICharacterEscapeCarriedData
// Size: 0x38 (Inherited: 0x30)
struct UAICharacterEscapeCarriedData : UAICharacterBehaviourData {
	bool _preventWiggleSuccess; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)

	void Init(bool preventWiggleSuccess); // Function DeadByDaylight.AICharacterEscapeCarriedData.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x5464170
};

// Class DeadByDaylight.AICharacterEscapeCarried
// Size: 0x68 (Inherited: 0x58)
struct UAICharacterEscapeCarried : UAICharacterBehaviour {
	struct ACamperPlayer* _camperPlayer; // 0x58(0x08)
	struct UAICharacterEscapeCarriedData* _behaviourData; // 0x60(0x08)
};

// Class DeadByDaylight.CharacterEvasionBehaviourData
// Size: 0x50 (Inherited: 0x30)
struct UCharacterEvasionBehaviourData : UAICharacterBehaviourData {
	struct AActor* _hunter; // 0x30(0x08)
	struct TArray<struct AActor*> _escapePoints; // 0x38(0x10)
	float _minEscapeDist; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)

	void Init(struct AActor* Hunter, struct TArray<struct AActor*> escapePoints, float minEscapeDist); // Function DeadByDaylight.CharacterEvasionBehaviourData.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x5464840
};

// Class DeadByDaylight.AICharacterEvasionBehaviour
// Size: 0x80 (Inherited: 0x58)
struct UAICharacterEvasionBehaviour : UAICharacterBehaviour {
	struct ADBDPlayer* _prey; // 0x58(0x08)
	struct ADBDAIPlayerController* _preyAIController; // 0x60(0x08)
	struct AActor* _currentEscapePoint; // 0x68(0x08)
	struct UCharacterEvasionBehaviourData* _characterEvasionData; // 0x70(0x08)
	char pad_78[0x8]; // 0x78(0x08)

	void EscapeDestinationReached(struct FAIRequestID RequestID, enum class EPathFollowingResult Result); // Function DeadByDaylight.AICharacterEvasionBehaviour.EscapeDestinationReached // (Final|Native|Private) // @ game+0x5463f80
};

// Class DeadByDaylight.AICharacterHideInLockerBehaviourData
// Size: 0x40 (Inherited: 0x30)
struct UAICharacterHideInLockerBehaviourData : UAICharacterBehaviourData {
	struct ALocker* TargetLocker; // 0x30(0x08)
	enum class ECharacterMovementTypes characterMovementType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)

	void Init(struct ALocker* Locker, enum class ECharacterMovementTypes characterMovementType); // Function DeadByDaylight.AICharacterHideInLockerBehaviourData.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x5464200
};

// Class DeadByDaylight.AICharacterHideInLockerBehaviour
// Size: 0x90 (Inherited: 0x58)
struct UAICharacterHideInLockerBehaviour : UAICharacterBehaviour {
	struct ADBDPlayer* _aiPlayer; // 0x58(0x08)
	struct ADBDAIPlayerController* _aiPlayerController; // 0x60(0x08)
	char pad_68[0x18]; // 0x68(0x18)
	struct UAICharacterHideInLockerBehaviourData* _characterHideInLockerData; // 0x80(0x08)
	char pad_88[0x8]; // 0x88(0x08)

	void OnMovementFinished(struct FAIRequestID RequestID, enum class EPathFollowingResult Result); // Function DeadByDaylight.AICharacterHideInLockerBehaviour.OnMovementFinished // (Final|Native|Private) // @ game+0x5464d10
};

// Class DeadByDaylight.AICharacterRepairGeneratorBehaviourData
// Size: 0x40 (Inherited: 0x30)
struct UAICharacterRepairGeneratorBehaviourData : UAICharacterBehaviourData {
	struct AGenerator* _generator; // 0x30(0x08)
	enum class ECharacterMovementTypes _characterMovementType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)

	void Init(struct AGenerator* Generator, enum class ECharacterMovementTypes characterMovementType); // Function DeadByDaylight.AICharacterRepairGeneratorBehaviourData.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x54642d0
};

// Class DeadByDaylight.AICharacterRepairGeneratorBehaviour
// Size: 0x98 (Inherited: 0x58)
struct UAICharacterRepairGeneratorBehaviour : UAICharacterBehaviour {
	char pad_58[0x10]; // 0x58(0x10)
	struct ADBDPlayer* _aiPlayer; // 0x68(0x08)
	struct ADBDAIPlayerController* _aiPlayerController; // 0x70(0x08)
	struct UInteractor* _targetInteractor; // 0x78(0x08)
	struct UAICharacterRepairGeneratorBehaviourData* _characterRepairGeneratorData; // 0x80(0x08)
	char pad_88[0x10]; // 0x88(0x10)

	void OnMovementFinished(struct FAIRequestID RequestID, enum class EPathFollowingResult Result); // Function DeadByDaylight.AICharacterRepairGeneratorBehaviour.OnMovementFinished // (Final|Native|Private) // @ game+0x5464de0
	void OnGeneratorRepairedEventHandler(bool isAutoCompleted); // Function DeadByDaylight.AICharacterRepairGeneratorBehaviour.OnGeneratorRepairedEventHandler // (Final|Native|Private) // @ game+0x5464bb0
};

// Class DeadByDaylight.AIHealAllyBehaviourData
// Size: 0x38 (Inherited: 0x30)
struct UAIHealAllyBehaviourData : UAICharacterBehaviourData {
	struct ACamperPlayer* _targetAlly; // 0x30(0x08)

	void Init(struct ACamperPlayer* allyToHealTarget); // Function DeadByDaylight.AIHealAllyBehaviourData.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x5464470
};

// Class DeadByDaylight.AIHealAllyBehaviour
// Size: 0x80 (Inherited: 0x58)
struct UAIHealAllyBehaviour : UAICharacterBehaviour {
	struct UAIHealAllyBehaviourData* _behaviourData; // 0x58(0x08)
	struct ADBDAIPlayerController* _aiController; // 0x60(0x08)
	struct ADBDPlayer* _aiPlayer; // 0x68(0x08)
	char pad_70[0x10]; // 0x70(0x10)

	void TargetPositionReached(struct FAIRequestID RequestID, enum class EPathFollowingResult Result); // Function DeadByDaylight.AIHealAllyBehaviour.TargetPositionReached // (Final|Native|Private) // @ game+0x54651e0
	void Init(struct ADBDPlayer* Character, struct UAICharacterBehaviourData* behaviourData); // Function DeadByDaylight.AIHealAllyBehaviour.Init // (Native|Public) // @ game+0x54643a0
};

// Class DeadByDaylight.AimableInterface
// Size: 0x30 (Inherited: 0x30)
struct UAimableInterface : UInterface {
};

// Class DeadByDaylight.AimAssistComponent
// Size: 0xe8 (Inherited: 0xb8)
struct UAimAssistComponent : UActorComponent {
	char pad_B8[0x30]; // 0xb8(0x30)
};

// Class DeadByDaylight.AimingCrosshairComponent
// Size: 0x100 (Inherited: 0xb8)
struct UAimingCrosshairComponent : UActorComponent {
	char pad_B8[0x48]; // 0xb8(0x48)

	void Server_SetCosmetics(enum class EAimingCrosshairState aimingCrosshairState, float Progress); // Function DeadByDaylight.AimingCrosshairComponent.Server_SetCosmetics // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x5465060
	void Multicast_SetCosmetics(enum class EAimingCrosshairState aimingCrosshairState, float Progress); // Function DeadByDaylight.AimingCrosshairComponent.Multicast_SetCosmetics // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x5464ae0
};

// Class DeadByDaylight.AIMoveToInteractData
// Size: 0x48 (Inherited: 0x30)
struct UAIMoveToInteractData : UAICharacterBehaviourData {
	struct AActor* _interactActor; // 0x30(0x08)
	struct AActor* _targetPositionActor; // 0x38(0x08)
	enum class ECharacterMovementTypes _characterMovementTypes; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	void Init(struct AActor* interactActor, enum class ECharacterMovementTypes characterMovementTypes, struct AActor* targetPositionActor); // Function DeadByDaylight.AIMoveToInteractData.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x5464500
};

// Class DeadByDaylight.AIMoveToInteract
// Size: 0x70 (Inherited: 0x58)
struct UAIMoveToInteract : UAICharacterBehaviour {
	struct UAIMoveToInteractData* _aiMoveToInteractData; // 0x58(0x08)
	struct ADBDAIPlayerController* _aiController; // 0x60(0x08)
	char pad_68[0x8]; // 0x68(0x08)

	void InteractionPointReached(struct FAIRequestID RequestID, enum class EPathFollowingResult Result); // Function DeadByDaylight.AIMoveToInteract.InteractionPointReached // (Final|Native|Private) // @ game+0x5464a10
	void Init(struct ADBDPlayer* Character, struct UAICharacterBehaviourData* behaviourData); // Function DeadByDaylight.AIMoveToInteract.Init // (Native|Public) // @ game+0x54643a0
};

// Class DeadByDaylight.AIMoveToPositionData
// Size: 0x40 (Inherited: 0x30)
struct UAIMoveToPositionData : UAICharacterBehaviourData {
	struct AActor* _positionActor; // 0x30(0x08)
	enum class ECharacterMovementTypes _movementType; // 0x38(0x01)
	bool _usePathfinding; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)

	void Init(struct AActor* positionActor, enum class ECharacterMovementTypes movementType, bool usePathfinding); // Function DeadByDaylight.AIMoveToPositionData.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x5464610
};

// Class DeadByDaylight.AIMoveToPosition
// Size: 0x70 (Inherited: 0x58)
struct UAIMoveToPosition : UAICharacterBehaviour {
	struct UAIMoveToPositionData* _aiBehaviourData; // 0x58(0x08)
	struct ADBDAIPlayerController* _aiController; // 0x60(0x08)
	char pad_68[0x8]; // 0x68(0x08)

	void TargetPositionReached(struct FAIRequestID RequestID, enum class EPathFollowingResult Result); // Function DeadByDaylight.AIMoveToPosition.TargetPositionReached // (Final|Native|Private) // @ game+0x54652b0
	void Init(struct ADBDPlayer* Character, struct UAICharacterBehaviourData* behaviourData); // Function DeadByDaylight.AIMoveToPosition.Init // (Native|Public) // @ game+0x54643a0
};

// Class DeadByDaylight.AIPointOfInterestTargetInterface
// Size: 0x30 (Inherited: 0x30)
struct UAIPointOfInterestTargetInterface : UInterface {
};

// Class DeadByDaylight.AISenseConfig_PointOfInterest
// Size: 0x60 (Inherited: 0x50)
struct UAISenseConfig_PointOfInterest : UAISenseConfig {
	struct UAISense_PointOfInterest* Implementation; // 0x50(0x08)
	float MinGeneratorRepairSoundRange; // 0x58(0x04)
	float MaxGeneratorRepairSoundRange; // 0x5c(0x04)
};

// Class DeadByDaylight.AISense_PointOfInterest
// Size: 0xa0 (Inherited: 0x90)
struct UAISense_PointOfInterest : UAISense {
	struct TArray<struct AActor*> _sources; // 0x90(0x10)
};

// Class DeadByDaylight.AISenseConfig_Trail
// Size: 0x68 (Inherited: 0x50)
struct UAISenseConfig_Trail : UAISenseConfig {
	struct UAISense_Trail* Implementation; // 0x50(0x08)
	float MaxRange; // 0x58(0x04)
	float PeripheralVisionAngleDegrees; // 0x5c(0x04)
	struct FAISenseAffiliationFilter DetectionByAffiliation; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
};

// Class DeadByDaylight.AISenseEvent_Trail
// Size: 0x60 (Inherited: 0x30)
struct UAISenseEvent_Trail : UAISenseEvent {
	struct FAITrailEvent Event; // 0x30(0x30)
};

// Class DeadByDaylight.AISense_Trail
// Size: 0xf0 (Inherited: 0x90)
struct UAISense_Trail : UAISense {
	struct TArray<struct FAITrailEvent> Events; // 0x90(0x10)
	char pad_A0[0x50]; // 0xa0(0x50)

	void ReportTrailEvent(struct UObject* worldContextObj, struct FVector Location, struct AActor* Instigator, struct FGameplayTag IgnoreOnPerkTag, float lifetime); // Function DeadByDaylight.AISense_Trail.ReportTrailEvent // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x5464eb0
};

// Class DeadByDaylight.AISlasherChaseAndAttackBehaviourData
// Size: 0x40 (Inherited: 0x30)
struct UAISlasherChaseAndAttackBehaviourData : UAICharacterBehaviourData {
	struct ACamperPlayer* _targetSurvivor; // 0x30(0x08)
	float _sqrtAttackRangeDistance; // 0x38(0x04)
	float _sqrtMaxTargetPositionDiff; // 0x3c(0x04)

	void Init(struct ACamperPlayer* TargetSurvivor, float attackRangeDistance, float locationDistance); // Function DeadByDaylight.AISlasherChaseAndAttackBehaviourData.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x5464730
};

// Class DeadByDaylight.AISlasherChaseAndAttackBehaviour
// Size: 0x80 (Inherited: 0x58)
struct UAISlasherChaseAndAttackBehaviour : UAICharacterBehaviour {
	struct UAISlasherChaseAndAttackBehaviourData* _behaviourData; // 0x58(0x08)
	struct ASlasherPlayer* _slasherPlayer; // 0x60(0x08)
	struct ADBDAIPlayerController* _slasherAIPlayerController; // 0x68(0x08)
	char pad_70[0x10]; // 0x70(0x10)
};

// Class DeadByDaylight.AISlasherMoveToGrabSurvivorBehaviourData
// Size: 0x38 (Inherited: 0x30)
struct UAISlasherMoveToGrabSurvivorBehaviourData : UAICharacterBehaviourData {
	struct ACamperPlayer* _targetSurvivor; // 0x30(0x08)

	void Init(struct ACamperPlayer* TargetSurvivor); // Function DeadByDaylight.AISlasherMoveToGrabSurvivorBehaviourData.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x5464470
};

// Class DeadByDaylight.AISlasherMoveToGrabSurvivorBehaviour
// Size: 0x80 (Inherited: 0x58)
struct UAISlasherMoveToGrabSurvivorBehaviour : UAICharacterBehaviour {
	struct UAISlasherMoveToGrabSurvivorBehaviourData* _behaviourData; // 0x58(0x08)
	struct ASlasherPlayer* _slasherPlayer; // 0x60(0x08)
	struct ADBDAIPlayerController* _slasherAIPlayerController; // 0x68(0x08)
	char pad_70[0x10]; // 0x70(0x10)
};

// Class DeadByDaylight.ScreenBase
// Size: 0x120 (Inherited: 0x30)
struct UScreenBase : UObject {
	bool isAnimationDone; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct UGFxObject* ScreenObject; // 0x38(0x08)
	struct UScreenController* _screenController; // 0x40(0x08)
	char pad_48[0xd8]; // 0x48(0xd8)

	void SetFadesOut(bool fadesOut); // Function DeadByDaylight.ScreenBase.SetFadesOut // (Final|Native|Public|Const) // @ game+0x55951a0
	void OnTextInputMouseClicked(bool IsPassword); // Function DeadByDaylight.ScreenBase.OnTextInputMouseClicked // (Final|Native|Public) // @ game+0x46a2400
	void OnStart(); // Function DeadByDaylight.ScreenBase.OnStart // (Final|Native|Public) // @ game+0x5595180
	void OnNavKey(struct FString navKey); // Function DeadByDaylight.ScreenBase.OnNavKey // (Final|Native|Public) // @ game+0x55950c0
	void OnHideVirtualKeyboardRequested(); // Function DeadByDaylight.ScreenBase.OnHideVirtualKeyboardRequested // (Final|Native|Public) // @ game+0x4032ad0
	void OnEscape(); // Function DeadByDaylight.ScreenBase.OnEscape // (Final|Native|Public) // @ game+0x55950a0
	void OnBack(); // Function DeadByDaylight.ScreenBase.OnBack // (Final|Native|Public) // @ game+0x5594fb0
	void OnAnyKey(float Code); // Function DeadByDaylight.ScreenBase.OnAnyKey // (Final|Native|Public) // @ game+0x5594f30
	void OnAnimationUpdate(int32_t isAnimationDone); // Function DeadByDaylight.ScreenBase.OnAnimationUpdate // (Final|Native|Public) // @ game+0x5594ea0
	void BroadcastOnHighlightedElementClickedEvent(struct FName onBoardingID); // Function DeadByDaylight.ScreenBase.BroadcastOnHighlightedElementClickedEvent // (Final|Native|Public) // @ game+0x5594dd0
};

// Class DeadByDaylight.AlertsScreen
// Size: 0x138 (Inherited: 0x120)
struct UAlertsScreen : UScreenBase {
	char pad_120[0x18]; // 0x120(0x18)

	void RewardAlertSequenceCompleted(); // Function DeadByDaylight.AlertsScreen.RewardAlertSequenceCompleted // (Final|Native|Private|Const) // @ game+0x546c3f0
};

// Class DeadByDaylight.AlwaysVisiblePerkIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UAlwaysVisiblePerkIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.Gate
// Size: 0x248 (Inherited: 0x230)
struct AGate : AActor {
	struct TArray<float> InteractionInputs; // 0x230(0x10)
	float InteractionOutput; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
};

// Class DeadByDaylight.AndGate
// Size: 0x248 (Inherited: 0x248)
struct AAndGate : AGate {
};

// Class DeadByDaylight.AnimationFollowerActor
// Size: 0x298 (Inherited: 0x230)
struct AAnimationFollowerActor : AActor {
	struct UDBDSkeletalMeshComponentBudgeted* _skeletalMeshComponent; // 0x230(0x08)
	struct UAnimationMontageSlave* _montageFollower; // 0x238(0x08)
	struct UMontagePlayer* _montagePlayer; // 0x240(0x08)
	char pad_248[0x50]; // 0x248(0x50)

	void OnMontageStopped(struct FAnimationMontageDescriptor ID); // Function DeadByDaylight.AnimationFollowerActor.OnMontageStopped // (Final|Native|Private) // @ game+0x546c1d0
	void OnMontageStarted(struct FAnimationMontageDescriptor ID, float Rate); // Function DeadByDaylight.AnimationFollowerActor.OnMontageStarted // (Final|Native|Private) // @ game+0x546bf50
	void OnMontageEnd(struct FAnimationMontageDescriptor Montage, bool interrupted); // Function DeadByDaylight.AnimationFollowerActor.OnMontageEnd // (Final|Native|Private) // @ game+0x546be00
	void NativeOnMontageStopped(struct FAnimationMontageDescriptor ID); // Function DeadByDaylight.AnimationFollowerActor.NativeOnMontageStopped // (Native|Protected) // @ game+0x546bcf0
	void NativeOnMontageStarted(struct FAnimationMontageDescriptor ID, float Rate); // Function DeadByDaylight.AnimationFollowerActor.NativeOnMontageStarted // (Native|Protected) // @ game+0x546bbb0
	void NativeOnMontageEnded(struct FAnimationMontageDescriptor Montage, bool interrupted); // Function DeadByDaylight.AnimationFollowerActor.NativeOnMontageEnded // (Native|Protected) // @ game+0x546ba60
	void Cosmetic_OnMontageStopped(); // Function DeadByDaylight.AnimationFollowerActor.Cosmetic_OnMontageStopped // (BlueprintCosmetic|Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void Cosmetic_OnMontageStarted(); // Function DeadByDaylight.AnimationFollowerActor.Cosmetic_OnMontageStarted // (BlueprintCosmetic|Event|Protected|BlueprintEvent) // @ game+0x5e02c90
};

// Class DeadByDaylight.AnimationMontageSlave
// Size: 0xc8 (Inherited: 0xb8)
struct UAnimationMontageSlave : UActorComponent {
	char pad_B8[0x10]; // 0xb8(0x10)

	void SetMontagePlayer(struct UMontagePlayer* MontagePlayer); // Function DeadByDaylight.AnimationMontageSlave.SetMontagePlayer // (Final|Native|Public|BlueprintCallable) // @ game+0x546c4a0
	void SetLeader(struct UMontagePlayer* Leader); // Function DeadByDaylight.AnimationMontageSlave.SetLeader // (Final|Native|Public|BlueprintCallable) // @ game+0x546c410
	void OnMontageStopped(struct FAnimationMontageDescriptor ID); // Function DeadByDaylight.AnimationMontageSlave.OnMontageStopped // (Final|Native|Private) // @ game+0x546c2e0
	void OnMontageStarted(struct FAnimationMontageDescriptor ID, float Rate); // Function DeadByDaylight.AnimationMontageSlave.OnMontageStarted // (Final|Native|Private) // @ game+0x546c090
};

// Class DeadByDaylight.AnimNotifyState_HideCustomizationAttachments
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotifyState_HideCustomizationAttachments : UAnimNotifyState {
	enum class ECustomizationCategory category; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class DeadByDaylight.AnimTagProvider
// Size: 0x30 (Inherited: 0x30)
struct UAnimTagProvider : UInterface {
};

// Class DeadByDaylight.ApplicableActivationTimerElapsedIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UApplicableActivationTimerElapsedIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ApplicableActivationTimerRemainingCooldownElapsedIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UApplicableActivationTimerRemainingCooldownElapsedIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ApplicableActivationTimerRemainingIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UApplicableActivationTimerRemainingIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ApplicableAndStealthRatioIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UApplicableAndStealthRatioIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.ApplicableCooldownPerkIconStrategy
// Size: 0x38 (Inherited: 0x38)
struct UApplicableCooldownPerkIconStrategy : UBasePerkIconStrategy {
};

// Class DeadByDaylight.BasePopupScreen
// Size: 0x120 (Inherited: 0x120)
struct UBasePopupScreen : UScreenBase {
};

// Class DeadByDaylight.GenericPopupScreen
// Size: 0x140 (Inherited: 0x120)
struct UGenericPopupScreen : UBasePopupScreen {
	struct UUMGGenericPopup* _popup; // 0x120(0x08)
	char pad_128[0x18]; // 0x128(0x18)

	void OnChoiceSelected(int32_t selectedButtonType); // Function DeadByDaylight.GenericPopupScreen.OnChoiceSelected // (Final|Native|Private) // @ game+0x55350a0
};

// Class DeadByDaylight.ArchivePassPurchasePopupScreen
// Size: 0x140 (Inherited: 0x140)
struct UArchivePassPurchasePopupScreen : UGenericPopupScreen {
};

// Class DeadByDaylight.ArchivesHelper
// Size: 0x30 (Inherited: 0x30)
struct UArchivesHelper : UObject {
};

// Class DeadByDaylight.ArchivesManager
// Size: 0x70 (Inherited: 0x38)
struct UArchivesManager : UGameInstanceSubsystem {
	char pad_38[0x20]; // 0x38(0x20)
	struct UArchiveStoriesContainer* _storiesContainer; // 0x58(0x08)
	struct UArchiveVignettesContainer* _vignettesContainer; // 0x60(0x08)
	struct URewardTrackContainer* _rewardTrackContainer; // 0x68(0x08)
};

// Class DeadByDaylight.ArchivesSpecialBehavioursHelper
// Size: 0x30 (Inherited: 0x30)
struct UArchivesSpecialBehavioursHelper : UObject {
};

// Class DeadByDaylight.ArchiveStoriesContainer
// Size: 0x448 (Inherited: 0x30)
struct UArchiveStoriesContainer : UObject {
	char pad_30[0x2b8]; // 0x30(0x2b8)
	struct URewardTrackContainer* _rewardTrackContainer; // 0x2e8(0x08)
	char pad_2F0[0xc8]; // 0x2f0(0xc8)
	struct UWalletHandler* _wallet; // 0x3b8(0x08)
	struct UArchiveVignettesContainer* _vignettesContainer; // 0x3c0(0x08)
	char pad_3C8[0x80]; // 0x3c8(0x80)
};

// Class DeadByDaylight.ArchiveTierPurchasePopupScreen
// Size: 0x158 (Inherited: 0x140)
struct UArchiveTierPurchasePopupScreen : UGenericPopupScreen {
	char pad_140[0x18]; // 0x140(0x18)

	void OnConfirmPurchase(int32_t tiersToPurchaseNumber); // Function DeadByDaylight.ArchiveTierPurchasePopupScreen.OnConfirmPurchase // (Final|Native|Private) // @ game+0x5472a10
};

// Class DeadByDaylight.ArchiveVignettesContainer
// Size: 0x108 (Inherited: 0x30)
struct UArchiveVignettesContainer : UObject {
	char pad_30[0xd8]; // 0x30(0xd8)
};

// Class DeadByDaylight.ArchiveWidgetScreen
// Size: 0x150 (Inherited: 0x120)
struct UArchiveWidgetScreen : UScreenBase {
	char pad_120[0x30]; // 0x120(0x30)

	void OnRewardsButtonClick(); // Function DeadByDaylight.ArchiveWidgetScreen.OnRewardsButtonClick // (Final|Native|Private) // @ game+0x5472b70
	void OnQuestsButtonClick(); // Function DeadByDaylight.ArchiveWidgetScreen.OnQuestsButtonClick // (Final|Native|Private) // @ game+0x546c3f0
};

// Class DeadByDaylight.AspectRatioComponentUtilities
// Size: 0x30 (Inherited: 0x30)
struct UAspectRatioComponentUtilities : UBlueprintFunctionLibrary {
};

// Class DeadByDaylight.AssetLibrary
// Size: 0xb0 (Inherited: 0x30)
struct UAssetLibrary : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UObjectLibrary* _objectLibrary; // 0x38(0x08)
	char pad_40[0x64]; // 0x40(0x64)
	float SecondsDelayBetweenBatch; // 0xa4(0x04)
	char pad_A8[0x8]; // 0xa8(0x08)
};

// Class DeadByDaylight.AssetLibraryManager
// Size: 0x100 (Inherited: 0x30)
struct UAssetLibraryManager : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct UObject* _worldContextObject; // 0x40(0x08)
	struct TMap<int32_t, struct UCharacterItemsAssetLibrary*> _characterItemsAssetLibrary; // 0x48(0x50)
	struct UIniAssetLibrary* _globalAssetLibrary; // 0x98(0x08)
	struct UMenuAssetLibrary* _menuAssetLibrary; // 0xa0(0x08)
	struct UGameAssetLibrary* _gameAssetLibrary; // 0xa8(0x08)
	struct UTutorialAssetLibrary* _tutorialAssetLibrary; // 0xb0(0x08)
	char pad_B8[0x8]; // 0xb8(0x08)
	struct Ushopmanager* _shopManager; // 0xc0(0x08)
	char pad_C8[0x10]; // 0xc8(0x10)
	struct TArray<struct FAssetLibraryLoader> _loadingList; // 0xd8(0x10)
	int32_t CharacterItemsAssetLoadCountPerChunk; // 0xe8(0x04)
	int32_t BlindPackAssetLoadCountPerChunk; // 0xec(0x04)
	int32_t MenuAssetLoadCountPerChunk; // 0xf0(0x04)
	int32_t GlobalAssetLoadCountPerChunk; // 0xf4(0x04)
	int32_t GameAssetLoadCountPerChunk; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
};

// Class DeadByDaylight.AssetUtilities
// Size: 0x30 (Inherited: 0x30)
struct UAssetUtilities : UBlueprintFunctionLibrary {
};

// Class DeadByDaylight.AtlantaCustomGameUtilities
// Size: 0x30 (Inherited: 0x30)
struct UAtlantaCustomGameUtilities : UBlueprintFunctionLibrary {

	bool IsInCustomGameLobby(struct UDBDGameInstance* GameInstance); // Function DeadByDaylight.AtlantaCustomGameUtilities.IsInCustomGameLobby // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x54728f0
	bool IsCustomGameEnabled(); // Function DeadByDaylight.AtlantaCustomGameUtilities.IsCustomGameEnabled // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x54728c0
};

// Class DeadByDaylight.BaseTooltipWidget
// Size: 0x370 (Inherited: 0x338)
struct UBaseTooltipWidget : UMobileBaseUserWidget {
	struct UTextBlock* TitleLabel; // 0x338(0x08)
	struct UCanvasPanel* TooltipContainer; // 0x340(0x08)
	struct UUMGHtmlRichText* DescriptionLabel; // 0x348(0x08)
	struct UButton* CloseButton; // 0x350(0x08)
	char pad_358[0x10]; // 0x358(0x10)
	struct UAkAudioEvent* TooltipOpeningSound; // 0x368(0x08)

	void OnQuitButtonClicked(); // Function DeadByDaylight.BaseTooltipWidget.OnQuitButtonClicked // (Final|Native|Protected) // @ game+0x481faf0
};

// Class DeadByDaylight.AtlantaCustomizationTooltipWidget
// Size: 0x388 (Inherited: 0x370)
struct UAtlantaCustomizationTooltipWidget : UBaseTooltipWidget {
	struct UImage* SmokeImage; // 0x370(0x08)
	struct UUMGCustomizationTooltipHeaderWidget* Header; // 0x378(0x08)
	struct UUMGCustomizationTooltipContentWidget* Content; // 0x380(0x08)
};

// Class DeadByDaylight.AtlantaDeepLinkSubsystem
// Size: 0x60 (Inherited: 0x38)
struct UAtlantaDeepLinkSubsystem : UGameInstanceSubsystem {
	char pad_38[0x28]; // 0x38(0x28)
};

// Class DeadByDaylight.DisplayStand
// Size: 0x3b0 (Inherited: 0x230)
struct ADisplayStand : AActor {
	char pad_230[0x18]; // 0x230(0x18)
	struct AActor* _currentActorDisplayed; // 0x248(0x08)
	char pad_250[0x8]; // 0x250(0x08)
	struct UObject* _currentActorDisplayedClass; // 0x258(0x08)
	struct UObject* _nextActorToDisplayClass; // 0x260(0x08)
	char pad_268[0x28]; // 0x268(0x28)
	struct TMap<struct UObject*, struct FTransform> _offsetByClass; // 0x290(0x50)
	struct TMap<struct UObject*, bool> _enableRotationByClass; // 0x2e0(0x50)
	struct TSoftClassPtr<UObject> _defaultCharmClassDisplayable; // 0x330(0x30)
	char pad_360[0x39]; // 0x360(0x39)
	bool _useOffsetMenuAnimations; // 0x399(0x01)
	bool _displayDummyCharacter; // 0x39a(0x01)
	char pad_39B[0x1]; // 0x39b(0x01)
	struct FCharacterDropdown _characterDropdown; // 0x39c(0x08)
	char pad_3A4[0xc]; // 0x3a4(0x0c)

	void OnCurrentActorDestroyed(struct AActor* DestroyedActor); // Function DeadByDaylight.DisplayStand.OnCurrentActorDestroyed // (Final|Native|Private) // @ game+0x5519a80
	void BlockRotation(bool shouldBlockRotation); // Function DeadByDaylight.DisplayStand.BlockRotation // (Final|Native|Public) // @ game+0x5519420
};

// Class DeadByDaylight.AtlantaDisplayStand
// Size: 0x3c0 (Inherited: 0x3b0)
struct AAtlantaDisplayStand : ADisplayStand {
	enum class EAtlantaDisplayStandPosition StandPosition; // 0x3a8(0x01)
	struct USceneComponent* SurvivorPositionMarker; // 0x3b0(0x08)
	struct USceneComponent* KillerPositionMarker; // 0x3b8(0x08)
};

// Class DeadByDaylight.AtlantaEventsTemplateDataAsset
// Size: 0x88 (Inherited: 0x38)
struct UAtlantaEventsTemplateDataAsset : UPrimaryDataAsset {
	struct TMap<enum class EEventsType, struct UUMGAtlantaBaseEventsTemplate*> Data; // 0x38(0x50)
};

// Class DeadByDaylight.AtlantaFriendsListScreenUMG
// Size: 0x1a0 (Inherited: 0x120)
struct UAtlantaFriendsListScreenUMG : UScreenBase {
	char pad_120[0x78]; // 0x120(0x78)
	struct UUMGAtlantaFriendListScreen* _atlantaFriendListScreen; // 0x198(0x08)

	void HandleResearchButtonClicked(struct FText& searchInput); // Function DeadByDaylight.AtlantaFriendsListScreenUMG.HandleResearchButtonClicked // (Final|Native|Protected|HasOutParms) // @ game+0x54727f0
	void HandleClosedButtonClicked(); // Function DeadByDaylight.AtlantaFriendsListScreenUMG.HandleClosedButtonClicked // (Final|Native|Protected) // @ game+0x54727d0
};

// Class DeadByDaylight.AtlantaHudDirectionalStick
// Size: 0x380 (Inherited: 0x338)
struct UAtlantaHudDirectionalStick : UMobileBaseUserWidget {
	struct UCanvasPanel* JoystickAnimationPanel; // 0x338(0x08)
	struct UCanvasPanel* ContainerToRotate; // 0x340(0x08)
	struct UCanvasPanel* ArrowsContainer; // 0x348(0x08)
	struct UImage* JoystickLockImage; // 0x350(0x08)
	struct UImage* JoystickOn; // 0x358(0x08)
	struct UCanvasPanel* AutoRunContainer; // 0x360(0x08)
	bool _isMovementLockAnimationActive; // 0x368(0x01)
	char pad_369[0x17]; // 0x369(0x17)

	void SetMovementLockAnimationStatus(bool value); // Function DeadByDaylight.AtlantaHudDirectionalStick.SetMovementLockAnimationStatus // (Final|Native|Public|BlueprintCallable) // @ game+0x5472b90
};

// Class DeadByDaylight.AtlantaHudLookBackJoystick
// Size: 0x340 (Inherited: 0x338)
struct UAtlantaHudLookBackJoystick : UMobileBaseUserWidget {
	struct UGridPanel* TutorialAnimContainer; // 0x338(0x08)
};

// Class DeadByDaylight.AtlantaHudPowerAttackJoystick
// Size: 0x388 (Inherited: 0x338)
struct UAtlantaHudPowerAttackJoystick : UMobileBaseUserWidget {
	char pad_338[0x8]; // 0x338(0x08)
	struct UCanvasPanel* AnimationContainer; // 0x340(0x08)
	struct FName _availableAnimationName; // 0x348(0x0c)
	struct FName _fadeOutAnimationName; // 0x354(0x0c)
	struct FName _tutoStartAnimationName; // 0x360(0x0c)
	struct FName _tutoLoopAnimationName; // 0x36c(0x0c)
	struct UImage* Icon; // 0x378(0x08)
	char pad_380[0x8]; // 0x380(0x08)

	void OnFinishedTutorialAnimationIn(); // Function DeadByDaylight.AtlantaHudPowerAttackJoystick.OnFinishedTutorialAnimationIn // (Final|Native|Protected) // @ game+0x5472ac0
	void OnFinishedAvailableAnimation(); // Function DeadByDaylight.AtlantaHudPowerAttackJoystick.OnFinishedAvailableAnimation // (Final|Native|Protected) // @ game+0x5472aa0
};

// Class DeadByDaylight.LobbyLevel
// Size: 0x2c0 (Inherited: 0x238)
struct ALobbyLevel : ALevelScriptActor {
	char pad_238[0x48]; // 0x238(0x48)
	struct TArray<struct ADisplayStand*> _registeredDisplayStands; // 0x280(0x10)
	enum class EWorldFlowEvent LobbyLoadedEvent; // 0x290(0x01)
	char pad_291[0x2f]; // 0x291(0x2f)

	void OnShopSubLevelLoaded(); // Function DeadByDaylight.LobbyLevel.OnShopSubLevelLoaded // (Final|Native|Private) // @ game+0x5556d80
	void OnLobbySubLevelLoaded(); // Function DeadByDaylight.LobbyLevel.OnLobbySubLevelLoaded // (Final|Native|Private) // @ game+0x5556d40
	void OnAdditionalSubLevelsLoaded(); // Function DeadByDaylight.LobbyLevel.OnAdditionalSubLevelsLoaded // (Final|Native|Private) // @ game+0x5556d20
};

// Class DeadByDaylight.AtlantaLobbyLevel
// Size: 0x300 (Inherited: 0x2c0)
struct AAtlantaLobbyLevel : ALobbyLevel {
	char pad_2C0[0x10]; // 0x2c0(0x10)
	struct FLightingChannels ForefrontLightingChannel; // 0x2d0(0x01)
	struct FLightingChannels BackgroundLightingChannel; // 0x2d1(0x01)
	char pad_2D2[0x6]; // 0x2d2(0x06)
	struct AAtlantaOfflineLobbyCamera* _offlineLobbyCamera; // 0x2d8(0x08)
	struct AActor* _roleSelectionLobbyCameraPosition; // 0x2e0(0x08)
	struct AActor* _characterSelectionLobbyCameraPosition; // 0x2e8(0x08)
	struct AActor* _loadoutSelectionLobbyCameraPosition; // 0x2f0(0x08)
	char pad_2F8[0x8]; // 0x2f8(0x08)

	void OnFrontPawnSpawned(struct AActor* forefrontPawn); // Function DeadByDaylight.AtlantaLobbyLevel.OnFrontPawnSpawned // (Final|Native|Private) // @ game+0x5472ae0
	void OnBackPawnSpawned(struct AActor* backgroundPawn); // Function DeadByDaylight.AtlantaLobbyLevel.OnBackPawnSpawned // (Final|Native|Private) // @ game+0x5472980
};

// Class DeadByDaylight.AtlantaNavigationScreen
// Size: 0x128 (Inherited: 0x120)
struct UAtlantaNavigationScreen : UScreenBase {
	struct UUMGAtlantaNavigationScreen* _umgScreen; // 0x120(0x08)
};

// Class DeadByDaylight.AtlantaObjectiveWidget
// Size: 0x3a0 (Inherited: 0x338)
struct UAtlantaObjectiveWidget : UMobileBaseUserWidget {
	struct UTextBlock* ObjectiveLabel; // 0x338(0x08)
	char pad_340[0x54]; // 0x340(0x54)
	float _totalFadeOutTime; // 0x394(0x04)
	int32_t _polynomialOrder; // 0x398(0x04)
	char pad_39C[0x4]; // 0x39c(0x04)
};

// Class DeadByDaylight.AtlantaOfflineLobbyCamera
// Size: 0x7d0 (Inherited: 0x7c0)
struct AAtlantaOfflineLobbyCamera : ACameraActor {
	float ZCameraPositionOffsetMultiplier; // 0x7c0(0x04)
	char pad_7C4[0x4]; // 0x7c4(0x04)
	float _kDefaultAspectRatio; // 0x7c8(0x04)
	char pad_7CC[0x4]; // 0x7cc(0x04)

	void SetCameraRotation(struct FRotator rotationVector); // Function DeadByDaylight.AtlantaOfflineLobbyCamera.SetCameraRotation // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x5e02c90
	void SetCameraPosition(struct FVector positionVector); // Function DeadByDaylight.AtlantaOfflineLobbyCamera.SetCameraPosition // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x5e02c90
};

// Class DeadByDaylight.AtlantaPartyFlowHandler
// Size: 0x278 (Inherited: 0x30)
struct UAtlantaPartyFlowHandler : UObject {
	char pad_30[0x248]; // 0x30(0x248)

	void DisplayPartyFlowHandlerInfo(); // Function DeadByDaylight.AtlantaPartyFlowHandler.DisplayPartyFlowHandlerInfo // (Final|Native|Private) // @ game+0x5477940
};

// Class DeadByDaylight.AtlantaPartyFlowUtilities
// Size: 0x30 (Inherited: 0x30)
struct UAtlantaPartyFlowUtilities : UObject {

	bool IsCurrentPlayerInParty(); // Function DeadByDaylight.AtlantaPartyFlowUtilities.IsCurrentPlayerInParty // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x5478010
	bool IsCurrentPlayerAloneInParty(); // Function DeadByDaylight.AtlantaPartyFlowUtilities.IsCurrentPlayerAloneInParty // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x5477fe0
};

// Class DeadByDaylight.AtlantaInstalledContent
// Size: 0x50 (Inherited: 0x30)
struct UAtlantaInstalledContent : UObject {
	char pad_30[0x20]; // 0x30(0x20)

	bool Mount(int32_t PakOrder, struct FString MountPoint); // Function DeadByDaylight.AtlantaInstalledContent.Mount // (Final|Native|Public|BlueprintCallable) // @ game+0x5478040
	float GetInstalledContentSize(); // Function DeadByDaylight.AtlantaInstalledContent.GetInstalledContentSize // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477c40
	float GetFreeDiskSpace(); // Function DeadByDaylight.AtlantaInstalledContent.GetFreeDiskSpace // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477ae0
};

// Class DeadByDaylight.AtlantaPendingContent
// Size: 0x90 (Inherited: 0x50)
struct UAtlantaPendingContent : UAtlantaInstalledContent {
	char pad_50[0x40]; // 0x50(0x40)

	void StartInstall(struct FDelegate OnSucceeded, struct FDelegate OnFailed); // Function DeadByDaylight.AtlantaPendingContent.StartInstall // (Final|Native|Public|BlueprintCallable) // @ game+0x5478980
	float GetTotalDownloadedSize(); // Function DeadByDaylight.AtlantaPendingContent.GetTotalDownloadedSize // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477d50
	float GetRequiredDiskSpace(); // Function DeadByDaylight.AtlantaPendingContent.GetRequiredDiskSpace // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477ca0
	bool GetIsDownloading(); // Function DeadByDaylight.AtlantaPendingContent.GetIsDownloading // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477c70
	float GetInstallProgress(); // Function DeadByDaylight.AtlantaPendingContent.GetInstallProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477b10
	struct FText GetDownloadStatusText(); // Function DeadByDaylight.AtlantaPendingContent.GetDownloadStatusText // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477a40
	float GetDownloadSpeed(); // Function DeadByDaylight.AtlantaPendingContent.GetDownloadSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477a10
	float GetDownloadSize(); // Function DeadByDaylight.AtlantaPendingContent.GetDownloadSize // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x54779e0
};

// Class DeadByDaylight.AtlantaPatchingLibrary
// Size: 0x30 (Inherited: 0x30)
struct UAtlantaPatchingLibrary : UBlueprintFunctionLibrary {

	void RequestContent(struct FString RemoteManifestURL, struct FString CloudURL, struct FString InstallDirectory, struct FDelegate OnSucceeded, struct FDelegate OnFailed, struct UAtlantaPendingContent* MobilePendingContent); // Function DeadByDaylight.AtlantaPatchingLibrary.RequestContent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x5478350
	void PrintPakLocations(); // Function DeadByDaylight.AtlantaPatchingLibrary.PrintPakLocations // (Final|Native|Static|Public) // @ game+0x5478330
	bool HasActiveWiFiConnection(); // Function DeadByDaylight.AtlantaPatchingLibrary.HasActiveWiFiConnection // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477ec0
	struct TArray<struct FString> GetSupportedPlatformNames(); // Function DeadByDaylight.AtlantaPatchingLibrary.GetSupportedPlatformNames // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477cd0
	struct UAtlantaInstalledContent* GetInstalledContent(struct FString InstallDirectory, struct FString ManifestFilename); // Function DeadByDaylight.AtlantaPatchingLibrary.GetInstalledContent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477b40
	struct FString GetActiveDeviceProfileName(); // Function DeadByDaylight.AtlantaPatchingLibrary.GetActiveDeviceProfileName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x5477960
};

// Class DeadByDaylight.AtlantaPromptWidget
// Size: 0x3a0 (Inherited: 0x338)
struct UAtlantaPromptWidget : UMobileBaseUserWidget {
	struct UTextBlock* PromptLabel; // 0x338(0x08)
	char pad_340[0x10]; // 0x340(0x10)
	struct TMap<enum class EPromptType, struct FString> AudioCues; // 0x350(0x50)
};

// Class DeadByDaylight.AtlantaRitualsManager
// Size: 0xc8 (Inherited: 0x30)
struct UAtlantaRitualsManager : UObject {
	struct TWeakObjectPtr<struct UDBDGameInstance> _gameInstance; // 0x30(0x08)
	char pad_38[0x90]; // 0x38(0x90)
};

// Class DeadByDaylight.AtlantaRitualsScreen
// Size: 0x188 (Inherited: 0x120)
struct UAtlantaRitualsScreen : UScreenBase {
	struct UUMGAtlantaRitualsScreen* _umgScreen; // 0x120(0x08)
	char pad_128[0x60]; // 0x128(0x60)

	void OnRefreshRitual(); // Function DeadByDaylight.AtlantaRitualsScreen.OnRefreshRitual // (Final|Native|Private) // @ game+0x54781e0
	void OnExitRequested(); // Function DeadByDaylight.AtlantaRitualsScreen.OnExitRequested // (Final|Native|Private) // @ game+0x54781c0
	void OnClaimRewards(int32_t ritualId); // Function DeadByDaylight.AtlantaRitualsScreen.OnClaimRewards // (Final|Native|Private) // @ game+0x5478130
};

// Class DeadByDaylight.AtlantaRoleSelectionScreen
// Size: 0x128 (Inherited: 0x120)
struct UAtlantaRoleSelectionScreen : UScreenBase {
	struct UUMGRoleSelectionScreen* _umgScreen; // 0x120(0x08)
};

// Class DeadByDaylight.AtlantaSaveGame
// Size: 0x60 (Inherited: 0x30)
struct UAtlantaSaveGame : USaveGame {
	struct FString SaveSlotName; // 0x30(0x10)
	uint32_t UserIndex; // 0x40(0x04)
	struct FName LastGenericLoadingImageId; // 0x44(0x0c)
	struct FName LastSpecificLoadingImageId; // 0x50(0x0c)
	bool IsLastSpecificImage; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
};

// Class DeadByDaylight.AtlantaSkillCheckWidget
// Size: 0x3c8 (Inherited: 0x338)
struct UAtlantaSkillCheckWidget : UMobileBaseUserWidget {
	struct UCanvasPanel* SkillCheckArea; // 0x338(0x08)
	struct UImage* HitArea; // 0x340(0x08)
	struct UImage* Hit; // 0x348(0x08)
	struct UImage* OrangeSmoke; // 0x350(0x08)
	struct UImage* BonusArea; // 0x358(0x08)
	struct UImage* StartMarker; // 0x360(0x08)
	struct UImage* EndMarker; // 0x368(0x08)
	struct UCanvasPanel* HitAreaContainer; // 0x370(0x08)
	struct UCanvasPanel* BonusAreaContainer; // 0x378(0x08)
	struct UCanvasPanel* HitAreaStartMarkerContainer; // 0x380(0x08)
	struct UCanvasPanel* HitAreaEndMarkerContainer; // 0x388(0x08)
	struct UCanvasPanel* MarkerContainer; // 0x390(0x08)
	struct FLinearColor HexColor; // 0x398(0x10)
	struct FLinearColor DefaultColor; // 0x3a8(0x10)
	bool _isPlayAnimation; // 0x3b8(0x01)
	char pad_3B9[0x3]; // 0x3b9(0x03)
	float PathCoveredAngle; // 0x3bc(0x04)
	char pad_3C0[0x8]; // 0x3c0(0x08)

	void SetHexed(bool IsHexed); // Function DeadByDaylight.AtlantaSkillCheckWidget.SetHexed // (Final|Native|Public|BlueprintCallable) // @ game+0x5478710
	void SetActive(bool Active); // Function DeadByDaylight.AtlantaSkillCheckWidget.SetActive // (Final|Native|Public|BlueprintCallable) // @ game+0x5478680
	void OnIsActiveChanged(bool IsActive); // Function DeadByDaylight.AtlantaSkillCheckWidget.OnIsActiveChanged // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	bool IsActive(); // Function DeadByDaylight.AtlantaSkillCheckWidget.IsActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5477ef0
};

// Class DeadByDaylight.AtlantaTooltipManager
// Size: 0x68 (Inherited: 0x30)
struct UAtlantaTooltipManager : UObject {
	struct UBaseTooltipWidget* _activeTooltip; // 0x30(0x08)
	struct UUMGCloseTooltipWidget* _closeTooltipWidget; // 0x38(0x08)
	char pad_40[0x28]; // 0x40(0x28)

	void TryCloseActiveTooltipWithWidget(); // Function DeadByDaylight.AtlantaTooltipManager.TryCloseActiveTooltipWithWidget // (Final|Native|Private) // @ game+0x5478b00
	bool TryCloseActiveTooltip(); // Function DeadByDaylight.AtlantaTooltipManager.TryCloseActiveTooltip // (Final|Native|Public) // @ game+0x5478aa0
};

// Class DeadByDaylight.AtlantaTooltipUtilities
// Size: 0x30 (Inherited: 0x30)
struct UAtlantaTooltipUtilities : UObject {

	bool TryCloseActiveTooltip(); // Function DeadByDaylight.AtlantaTooltipUtilities.TryCloseActiveTooltip // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x5478ad0
};

// Class DeadByDaylight.TutorialLevel
// Size: 0x278 (Inherited: 0x238)
struct ATutorialLevel : ALevelScriptActor {
	bool _tutorialStarted; // 0x238(0x01)
	char pad_239[0x3f]; // 0x239(0x3f)

	void StartTutorial(); // Function DeadByDaylight.TutorialLevel.StartTutorial // (Native|Public|BlueprintCallable) // @ game+0x55cddb0
	void SetHandledTutorialStep(enum class ETutorialStep tutorialStep); // Function DeadByDaylight.TutorialLevel.SetHandledTutorialStep // (Final|Native|Public|BlueprintCallable) // @ game+0x55cd970
	void RemoveObjective(struct FName ObjectiveId); // Function DeadByDaylight.TutorialLevel.RemoveObjective // (Final|Native|Public|BlueprintCallable) // @ game+0x55cd430
	void OnTutorialStepUpdated(enum class ETutorialStep tutorialStep); // Function DeadByDaylight.TutorialLevel.OnTutorialStepUpdated // (Final|Native|Protected) // @ game+0x55cd370
	void OnNotificationDismissed(struct FName notificationId); // Function DeadByDaylight.TutorialLevel.OnNotificationDismissed // (Final|Native|Protected) // @ game+0x55cd2d0
	void HandleTutorialStepReached(); // Function DeadByDaylight.TutorialLevel.HandleTutorialStepReached // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void HandleNotificationDismissed(struct FName notificationId); // Function DeadByDaylight.TutorialLevel.HandleNotificationDismissed // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	void DisplayNotification(struct FName notificationId, float Time); // Function DeadByDaylight.TutorialLevel.DisplayNotification // (Final|Native|Public|BlueprintCallable) // @ game+0x55ccc40
	void DisplayBlockingNotification(struct FName notificationId); // Function DeadByDaylight.TutorialLevel.DisplayBlockingNotification // (Final|Native|Public|BlueprintCallable) // @ game+0x55ccba0
	void CompleteObjective(struct FName ObjectiveId); // Function DeadByDaylight.TutorialLevel.CompleteObjective // (Final|Native|Public|BlueprintCallable) // @ game+0x55cc990
	void AddObjective(struct FName ObjectiveId); // Function DeadByDaylight.TutorialLevel.AddObjective // (Final|Native|Public|BlueprintCallable) // @ game+0x55cc830
};

// Class DeadByDaylight.AtlantaTutorialLevel
// Size: 0x328 (Inherited: 0x278)
struct AAtlantaTutorialLevel : ATutorialLevel {
	char pad_278[0xb0]; // 0x278(0xb0)

	void StartCameraFadeIn(); // Function DeadByDaylight.AtlantaTutorialLevel.StartCameraFadeIn // (Final|Native|Public|BlueprintCallable) // @ game+0x5478960
	void SetTutorialElements(); // Function DeadByDaylight.AtlantaTutorialLevel.SetTutorialElements // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void SetTutorialElement(struct FString elementKey, struct AActor* elementToSet); // Function DeadByDaylight.AtlantaTutorialLevel.SetTutorialElement // (Final|Native|Public|BlueprintCallable) // @ game+0x5478830
	void SetLocallyControlledPlayer(struct ADBDPlayer* locallyControllerPlayer); // Function DeadByDaylight.AtlantaTutorialLevel.SetLocallyControlledPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0x54787a0
	void SetAIEscapePoints(struct TArray<struct AActor*> escapePoints); // Function DeadByDaylight.AtlantaTutorialLevel.SetAIEscapePoints // (Final|Native|Public|BlueprintCallable) // @ game+0x5478590
	void OnTutorialStarted(); // Function DeadByDaylight.AtlantaTutorialLevel.OnTutorialStarted // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnTriggerBeginOverlapActor(struct FString triggerID, struct AActor* overlappingActor); // Function DeadByDaylight.AtlantaTutorialLevel.OnTriggerBeginOverlapActor // (Final|Native|Public|BlueprintCallable) // @ game+0x5478200
	bool IsActorInLineOfSight(struct ADBDAIPlayerController* aiPlayerController, struct APlayerController* PlayerController); // Function DeadByDaylight.AtlantaTutorialLevel.IsActorInLineOfSight // (Final|Native|Public|BlueprintCallable) // @ game+0x5477f10
	void HandleCanStartTutorialChanged(bool canStartTutorial); // Function DeadByDaylight.AtlantaTutorialLevel.HandleCanStartTutorialChanged // (Final|Native|Private) // @ game+0x5477e30
	struct AActor* GetTutorialElement(struct FString elementKey); // Function DeadByDaylight.AtlantaTutorialLevel.GetTutorialElement // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5477d80
};

// Class DeadByDaylight.AtlantaTutorialObjectiveManager
// Size: 0x50 (Inherited: 0x30)
struct UAtlantaTutorialObjectiveManager : UObject {
	struct TArray<struct UAtlantaObjectiveWidget*> _objectivesList; // 0x30(0x10)
	struct UVerticalBox* _objectivesContainer; // 0x40(0x08)
	char pad_48[0x8]; // 0x48(0x08)
};

// Class DeadByDaylight.AtlantaTutorialPlayerHudController
// Size: 0x78 (Inherited: 0x30)
struct UAtlantaTutorialPlayerHudController : UObject {
	char pad_30[0x48]; // 0x30(0x48)

	void ShowHudComponent(enum class EHudComponent hudComponentToShow); // Function DeadByDaylight.AtlantaTutorialPlayerHudController.ShowHudComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x547d050
	void SetVirtualJoystickInputEnabled(bool enable); // Function DeadByDaylight.AtlantaTutorialPlayerHudController.SetVirtualJoystickInputEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x547c9f0
	void HideHudComponent(enum class EHudComponent hudComponentToHide); // Function DeadByDaylight.AtlantaTutorialPlayerHudController.HideHudComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x547be20
};

// Class DeadByDaylight.StateMachine
// Size: 0x130 (Inherited: 0xb8)
struct UStateMachine : UActorComponent {
	char pad_B8[0x9]; // 0xb8(0x09)
	bool _enableJoinInProgress; // 0xc1(0x01)
	char pad_C2[0x56]; // 0xc2(0x56)
	struct TArray<uint16_t> _netStateIDStackInitial; // 0x118(0x10)
	char pad_128[0x8]; // 0x128(0x08)

	void Server_SetStateStack(struct TArray<uint16_t> netStateIDStack); // Function DeadByDaylight.StateMachine.Server_SetStateStack // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x55b4180
	void NetIDStackChanged(); // Function DeadByDaylight.StateMachine.NetIDStackChanged // (Final|Native|Private) // @ game+0x55b3db0
	void Multicast_SetStateStack(struct TArray<uint16_t> netStateIDStack); // Function DeadByDaylight.StateMachine.Multicast_SetStateStack // (Final|Net|NetReliableNative|Event|NetMulticast|Private|NetValidate) // @ game+0x55b3cf0
};

// Class DeadByDaylight.AtlantaTutorialStateMachine
// Size: 0x130 (Inherited: 0x130)
struct UAtlantaTutorialStateMachine : UStateMachine {

	void OnBlockingNotificationDismissed(struct FName blockingNotificationID); // Function DeadByDaylight.AtlantaTutorialStateMachine.OnBlockingNotificationDismissed // (Final|Native|Private) // @ game+0x547c290
};

// Class DeadByDaylight.AtlantaUtilities
// Size: 0x30 (Inherited: 0x30)
struct UAtlantaUtilities : UBlueprintFunctionLibrary {

	bool ShouldUseQuickRoleSwitch(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseQuickRoleSwitch // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547d020
	bool ShouldUseOfflineMatchHistory(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseOfflineMatchHistory // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cff0
	bool ShouldUseAtlantaUI(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaUI // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cfc0
	bool ShouldUseAtlantaStreamVideo(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaStreamVideo // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cf90
	bool ShouldUseAtlantaRituals(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaRituals // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cf60
	bool ShouldUseAtlantaRank(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaRank // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cf30
	bool ShouldUseAtlantaQualitySettings(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaQualitySettings // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cf00
	bool ShouldUseAtlantaPurchasableOperations(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaPurchasableOperations // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547ced0
	bool ShouldUseAtlantaOutlines(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaOutlines // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cea0
	bool ShouldUseAtlantaMatchmaking(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaMatchmaking // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547ce70
	bool ShouldUseAtlantaLighting(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaLighting // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547ce40
	bool ShouldUseAtlantaKrakenContentVersion(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaKrakenContentVersion // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547ce10
	bool ShouldUseAtlantaItemAvailability(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaItemAvailability // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cde0
	bool ShouldUseAtlantaHudEditor(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaHudEditor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x479ec60
	bool ShouldUseAtlantaHudAttackJoystick(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaHudAttackJoystick // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x479ec60
	bool ShouldUseAtlantaGameplayValues(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaGameplayValues // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cdb0
	bool ShouldUseAtlantaFriendList(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaFriendList // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cd80
	bool ShouldUseAtlantaFreeTickets(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaFreeTickets // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cd50
	bool ShouldUseAtlantaFixedMaps(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaFixedMaps // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cd20
	bool ShouldUseAtlantaFearMarket(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaFearMarket // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547ccf0
	bool ShouldUseAtlantaEntity(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaEntity // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547ccc0
	bool ShouldUseAtlantaDreamworldFX(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaDreamworldFX // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cc90
	bool ShouldUseAtlantaDailyRewards(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaDailyRewards // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cc60
	bool ShouldUseAtlantaCustomizedHudSettings(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaCustomizedHudSettings // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cc30
	bool ShouldUseAtlantaCurrencies(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaCurrencies // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cc00
	bool ShouldUseAtlantaContent(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaContent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cbd0
	bool ShouldUseAtlantaCharacterProgression(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaCharacterProgression // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cba0
	bool ShouldUseAtlantaCDNPatching(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaCDNPatching // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cb40
	bool ShouldUseAtlantaCDNBucketChangelist(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaCDNBucketChangelist // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cb10
	bool ShouldUseAtlantaCatalog(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaCatalog // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cb70
	bool ShouldUseAtlantaBundleFilterRules(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaBundleFilterRules // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x479ec60
	bool ShouldUseAtlantaBloodweb(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaBloodweb // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cae0
	bool ShouldUseAtlantaBackendBloodMarketData(); // Function DeadByDaylight.AtlantaUtilities.ShouldUseAtlantaBackendBloodMarketData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547cab0
	bool ShouldSupportMultipleActiveActivatablePerks(); // Function DeadByDaylight.AtlantaUtilities.ShouldSupportMultipleActiveActivatablePerks // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547ca80
	bool SetImageSlateBrush(struct UImage* Image, struct FSlateBrush& Brush, bool bMatchSize); // Function DeadByDaylight.AtlantaUtilities.SetImageSlateBrush // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x547c840
	void SetImageBrushFromSpritePath(struct UImage* Image, struct FString Path); // Function DeadByDaylight.AtlantaUtilities.SetImageBrushFromSpritePath // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x547c770
	void SetImageBrushFromPath(struct UImage* Image, struct FString Path, bool bMatchSize); // Function DeadByDaylight.AtlantaUtilities.SetImageBrushFromPath // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x547c650
	void SetImageBrush(struct UImage* Image, struct UTexture2D* Asset, bool bMatchSize); // Function DeadByDaylight.AtlantaUtilities.SetImageBrush // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x547c550
	void SetButtonStyle(struct UButton* Button, struct FSlateBrush& Brush); // Function DeadByDaylight.AtlantaUtilities.SetButtonStyle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x547c400
	struct FString SecondsToStringWithoutDecimals(int32_t Seconds); // Function DeadByDaylight.AtlantaUtilities.SecondsToStringWithoutDecimals // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547c330
	struct FSlateBrush MakeBrushFromTexture(struct UTexture2D* Texture); // Function DeadByDaylight.AtlantaUtilities.MakeBrushFromTexture // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x547c180
	struct FSlateBrush MakeBrushFromSprite(struct UPaperSprite* Sprite); // Function DeadByDaylight.AtlantaUtilities.MakeBrushFromSprite // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x547c070
	struct UTexture2D* LoadTextureByAsset(struct FString Path); // Function DeadByDaylight.AtlantaUtilities.LoadTextureByAsset // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x547bfd0
	bool IsTutorialEditorDebuggingEnabled(); // Function DeadByDaylight.AtlantaUtilities.IsTutorialEditorDebuggingEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547bfa0
	bool IsPlayerInteractingWithActor(struct ADBDPlayer* Player, struct AActor* Actor); // Function DeadByDaylight.AtlantaUtilities.IsPlayerInteractingWithActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x547bed0
	bool IsInAtlantaTutorialLevel(); // Function DeadByDaylight.AtlantaUtilities.IsInAtlantaTutorialLevel // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547bea0
	struct FString GetStoreVersion(); // Function DeadByDaylight.AtlantaUtilities.GetStoreVersion // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547bda0
	struct UPaperSprite* GetSpriteFromPath(struct FString fullDbPathToImage, struct FString constantDbPathToImageFolder, struct FString constantPathToSpriteFolder); // Function DeadByDaylight.AtlantaUtilities.GetSpriteFromPath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547bc50
	struct UPaperSprite* GetSpriteFromFullPath(struct FString fullSpritePath); // Function DeadByDaylight.AtlantaUtilities.GetSpriteFromFullPath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547bbb0
	struct FText GetPlayerRoleTextUppercase(enum class EPlayerRole PlayerRole); // Function DeadByDaylight.AtlantaUtilities.GetPlayerRoleTextUppercase // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547bad0
	struct FText GetPlayerRoleText(enum class EPlayerRole PlayerRole); // Function DeadByDaylight.AtlantaUtilities.GetPlayerRoleText // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b9f0
	struct FColor GetPaintColorByRarity(enum class EItemRarity Rarity); // Function DeadByDaylight.AtlantaUtilities.GetPaintColorByRarity // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x547b960
	struct FText GetOfferingCategoryText(enum class EOfferingCategory OfferingCategory); // Function DeadByDaylight.AtlantaUtilities.GetOfferingCategoryText // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b880
	struct UPaperSprite* GetMapSpriteFromPath(struct FString mapSpritePath); // Function DeadByDaylight.AtlantaUtilities.GetMapSpriteFromPath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b7e0
	struct FText GetItemRarityText(enum class EItemRarity Rarity); // Function DeadByDaylight.AtlantaUtilities.GetItemRarityText // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b700
	struct FText GetItemAvailabilityText(enum class EItemAvailability Availability); // Function DeadByDaylight.AtlantaUtilities.GetItemAvailabilityText // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b620
	struct UTexture2D* GetIconImageByPath(struct FString IconPath); // Function DeadByDaylight.AtlantaUtilities.GetIconImageByPath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b580
	struct FText GetEmblemQualityText(enum class EEmblemQuality EmblemQuality); // Function DeadByDaylight.AtlantaUtilities.GetEmblemQualityText // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b4a0
	struct FColor GetEmblemColorByQuality(enum class EEmblemQuality EmblemQuality); // Function DeadByDaylight.AtlantaUtilities.GetEmblemColorByQuality // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x547b410
	struct FText GetDifficultyLevelText(enum class EAIDifficultyLevel difficultyLevel); // Function DeadByDaylight.AtlantaUtilities.GetDifficultyLevelText // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b330
	struct UInteractionDefinition* GetCurrentOrAvailableInteractionOfType(struct ADBDPlayer* Player, enum class EInputInteractionType interactionInputType); // Function DeadByDaylight.AtlantaUtilities.GetCurrentOrAvailableInteractionOfType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b260
	struct UInteractionDefinition* GetCurrentInteractionOfType(struct ADBDPlayer* Player, enum class EInputInteractionType interactionInputType); // Function DeadByDaylight.AtlantaUtilities.GetCurrentInteractionOfType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b190
	struct UInteractionDefinition* GetCurrentInteraction(struct ADBDPlayer* Player); // Function DeadByDaylight.AtlantaUtilities.GetCurrentInteraction // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b100
	struct FString GetCurrencyUITexturePath(enum class ECurrencyType CurrencyType); // Function DeadByDaylight.AtlantaUtilities.GetCurrencyUITexturePath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547b030
	struct FSlateColor GetCurrencyColor(enum class ECurrencyType CurrencyType); // Function DeadByDaylight.AtlantaUtilities.GetCurrencyColor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547af70
	float GetControlsTunableByRole(enum class EPlayerRole PlayerRole, struct FName tunableValueName); // Function DeadByDaylight.AtlantaUtilities.GetControlsTunableByRole // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x547ae80
	float GetControlsTunable(struct FName tunableValueName); // Function DeadByDaylight.AtlantaUtilities.GetControlsTunable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x547ade0
	struct FColor GetBackgroundColorByRarity(enum class EItemRarity Rarity); // Function DeadByDaylight.AtlantaUtilities.GetBackgroundColorByRarity // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x547ad50
	struct UInteractionDefinition* GetAvailableInteractionOfType(struct ADBDPlayer* Player, enum class EInputInteractionType interactionInputType); // Function DeadByDaylight.AtlantaUtilities.GetAvailableInteractionOfType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x547ac80
	struct FText GetAlantaInteractionDescriptionText(struct UInteractionDefinition* Interaction); // Function DeadByDaylight.AtlantaUtilities.GetAlantaInteractionDescriptionText // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x547ab90
};

// Class DeadByDaylight.AtlCookedMaps
// Size: 0x48 (Inherited: 0x38)
struct UAtlCookedMaps : UPrimaryDataAsset {
	struct TArray<struct FAtlCookedMapDescription> Descriptions; // 0x38(0x10)
};

// Class DeadByDaylight.AttackTypeEventComponent
// Size: 0xd0 (Inherited: 0xb8)
struct UAttackTypeEventComponent : UActorComponent {
	char pad_B8[0x18]; // 0xb8(0x18)
};

// Class DeadByDaylight.AudioFXComponent
// Size: 0x128 (Inherited: 0xb8)
struct UAudioFXComponent : UActorComponent {
	struct UPrimitiveComponent* _audioAmbientDetector; // 0xb8(0x08)
	char pad_C0[0x68]; // 0xc0(0x68)

	void SetAudioAmbientDetector(struct UPrimitiveComponent* audioAmbientDetector); // Function DeadByDaylight.AudioFXComponent.SetAudioAmbientDetector // (Final|Native|Public|BlueprintCallable) // @ game+0x5482800
	void OnLocallyObservedChanged(bool locallyObserved); // Function DeadByDaylight.AudioFXComponent.OnLocallyObservedChanged // (Final|Native|Private) // @ game+0x54822e0
	void OnDeafenCompleted(); // Function DeadByDaylight.AudioFXComponent.OnDeafenCompleted // (Final|Native|Private) // @ game+0x54821a0
	void Multicast_Deafen(float Duration); // Function DeadByDaylight.AudioFXComponent.Multicast_Deafen // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x5481e10
	void Authority_Deafen(float Duration); // Function DeadByDaylight.AudioFXComponent.Authority_Deafen // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5481830
};

// Class DeadByDaylight.AudioMultipleEmitterActor
// Size: 0x248 (Inherited: 0x230)
struct AAudioMultipleEmitterActor : AActor {
	struct UAudioMultipleEmitterComponent* AudioMultiEmitter; // 0x230(0x08)
	struct TArray<struct AActor*> EmitterActors; // 0x238(0x10)
};

// Class DeadByDaylight.AudioMultipleEmitterComponent
// Size: 0x490 (Inherited: 0x480)
struct UAudioMultipleEmitterComponent : UAkComponent {
	struct TArray<struct UActorComponent*> EmitterActorsComponents; // 0x478(0x10)
};

// Class DeadByDaylight.AuthoritativeMovementComponent
// Size: 0x118 (Inherited: 0xb8)
struct UAuthoritativeMovementComponent : UActorComponent {
	char pad_B8[0x10]; // 0xb8(0x10)
	struct TArray<struct ACharacter*> _charactersToPush; // 0xc8(0x10)
	struct TArray<struct ACharacter*> _stopIgnoreCharacterOnEndOverlap; // 0xd8(0x10)
	char pad_E8[0x8]; // 0xe8(0x08)
	struct UCapsuleComponent* _pawnDetector; // 0xf0(0x08)
	struct TArray<struct ACharacter*> _authoritativeIgnoreOverlapCharacters; // 0xf8(0x10)
	struct TArray<struct ACharacter*> _previousAuthoritativeIgnoreOverlapCharacters; // 0x108(0x10)

	void SetPawnDetector(struct UCapsuleComponent* pawnDetector); // Function DeadByDaylight.AuthoritativeMovementComponent.SetPawnDetector // (Final|Native|Public|BlueprintCallable) // @ game+0x5482910
	void OnRep_AuthoritativeIgnoreOverlapCharacters(); // Function DeadByDaylight.AuthoritativeMovementComponent.OnRep_AuthoritativeIgnoreOverlapCharacters // (Final|Native|Private) // @ game+0x54826f0
	void OnPawnDetectorOverlapExit(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function DeadByDaylight.AuthoritativeMovementComponent.OnPawnDetectorOverlapExit // (Final|Native|Protected) // @ game+0x5482590
	void OnPawnDetectorOverlapEnter(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DeadByDaylight.AuthoritativeMovementComponent.OnPawnDetectorOverlapEnter // (Final|Native|Protected|HasOutParms) // @ game+0x5482370
};

// Class DeadByDaylight.AutomaticLeanComponent
// Size: 0x370 (Inherited: 0xb8)
struct UAutomaticLeanComponent : UActorComponent {
	struct FMulticastInlineDelegate OnLeanStateChanged; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnPotentialLeanStateChanged; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnCanInitiateLeanChanged; // 0xd8(0x10)
	struct FSocketOrBoneCache _cameraIdleLocation; // 0xe8(0x60)
	struct FSocketOrBoneCache _cameraLeftLeanLocation; // 0x148(0x60)
	struct FSocketOrBoneCache _cameraRightLeanLocation; // 0x1a8(0x60)
	struct FSocketOrBoneCache _cameraCrouchLocation; // 0x208(0x60)
	struct FSocketOrBoneCache _cameraCrouchLeftLeanLocation; // 0x268(0x60)
	struct FSocketOrBoneCache _cameraCrouchRightLeanLocation; // 0x2c8(0x60)
	float _middleSphereTraceLength; // 0x328(0x04)
	float _sideSphereTraceLength; // 0x32c(0x04)
	float _sphereTraceRadius; // 0x330(0x04)
	float _standingTraceHeightOffset; // 0x334(0x04)
	float _crouchingTraceHeightOffset; // 0x338(0x04)
	float _sideTraceOffset; // 0x33c(0x04)
	float _maxCameraDistance; // 0x340(0x04)
	float _maxCameraAngle; // 0x344(0x04)
	bool _debugMode; // 0x348(0x01)
	enum class ELeanState _leanState; // 0x349(0x01)
	char pad_34A[0x26]; // 0x34a(0x26)

	void Server_SetLeanState(enum class ELeanState leanState); // Function DeadByDaylight.AutomaticLeanComponent.Server_SetLeanState // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x5482750
	void OnRep_LeanState(); // Function DeadByDaylight.AutomaticLeanComponent.OnRep_LeanState // (Final|Native|Private) // @ game+0x5482710
	void OnPotentialLeanStateChanged__DelegateSignature(enum class ELeanState leanState); // DelegateFunction DeadByDaylight.AutomaticLeanComponent.OnPotentialLeanStateChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x5e02c90
	void OnLeanStateChanged__DelegateSignature(enum class ELeanState leanState); // DelegateFunction DeadByDaylight.AutomaticLeanComponent.OnLeanStateChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x5e02c90
	void OnCanInitiateLeanChanged__DelegateSignature(bool canInitiate); // DelegateFunction DeadByDaylight.AutomaticLeanComponent.OnCanInitiateLeanChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x5e02c90
	void Local_Unlean(); // Function DeadByDaylight.AutomaticLeanComponent.Local_Unlean // (Final|Native|Public|BlueprintCallable) // @ game+0x5481df0
	void Local_Lean(); // Function DeadByDaylight.AutomaticLeanComponent.Local_Lean // (Final|Native|Public|BlueprintCallable) // @ game+0x5481dd0
	bool IsLeaning(); // Function DeadByDaylight.AutomaticLeanComponent.IsLeaning // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5481da0
	enum class ELeanState GetPotentialLeanState(); // Function DeadByDaylight.AutomaticLeanComponent.GetPotentialLeanState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5481d80
	enum class ELeanState GetLeanState(); // Function DeadByDaylight.AutomaticLeanComponent.GetLeanState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5481d30
	float GetAvailableDistanceInFrontOfCamera(); // Function DeadByDaylight.AutomaticLeanComponent.GetAvailableDistanceInFrontOfCamera // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5481b00
	bool CanInitiateLean(); // Function DeadByDaylight.AutomaticLeanComponent.CanInitiateLean // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54818b0
};

// Class DeadByDaylight.AutoQualityAdjuster
// Size: 0x258 (Inherited: 0x230)
struct AAutoQualityAdjuster : AActor {
	float TargetResolutionScale; // 0x230(0x04)
	float MinimumMS; // 0x234(0x04)
	float MaximumMS; // 0x238(0x04)
	float ScaleIncreaseRate; // 0x23c(0x04)
	float ScaleDecreaseRate; // 0x240(0x04)
	float MinimumAllowableScale; // 0x244(0x04)
	char pad_248[0x10]; // 0x248(0x10)
};

// Class DeadByDaylight.BaseBloodwebContentAdapter
// Size: 0x60 (Inherited: 0x30)
struct UBaseBloodwebContentAdapter : UObject {
	struct UBloodwebTunables* _bloodwebTunables; // 0x30(0x08)
	struct UBloodwebEntity* _entity; // 0x38(0x08)
	struct TScriptInterface<IDBDBloodwebDefinitionBase> _bloodwebDefinition; // 0x40(0x10)
	char pad_50[0x10]; // 0x50(0x10)
};

// Class DeadByDaylight.BackendBloodwebContentAdapter
// Size: 0x118 (Inherited: 0x60)
struct UBackendBloodwebContentAdapter : UBaseBloodwebContentAdapter {
	char pad_60[0xb0]; // 0x60(0xb0)
	struct UBloodwebGenerator* _bloodwebBuilder; // 0x110(0x08)
};

// Class DeadByDaylight.BackendCinematicContainer
// Size: 0xf0 (Inherited: 0x30)
struct UBackendCinematicContainer : UObject {
	char pad_30[0xc0]; // 0x30(0xc0)
};

// Class DeadByDaylight.BackendLoadoutManager
// Size: 0xd8 (Inherited: 0x38)
struct UBackendLoadoutManager : UGameInstanceSubsystem {
	char pad_38[0xa0]; // 0x38(0xa0)
};

// Class DeadByDaylight.BannerDataProcessor
// Size: 0x80 (Inherited: 0x30)
struct UBannerDataProcessor : UObject {
	char pad_30[0x50]; // 0x30(0x50)
};

// Class DeadByDaylight.BaseCameraTargetingStrategy
// Size: 0x50 (Inherited: 0x30)
struct UBaseCameraTargetingStrategy : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	float _maxFreeAngle; // 0x38(0x04)
	float _maxInputRotation; // 0x3c(0x04)
	float _interpolationSpeed; // 0x40(0x04)
	float _interpolationSpeedOutsideFreeMoveZone; // 0x44(0x04)
	struct AActor* _target; // 0x48(0x08)
};

// Class DeadByDaylight.BaseEscapeThroughHatch
// Size: 0x630 (Inherited: 0x630)
struct UBaseEscapeThroughHatch : UInteractionDefinition {

	struct AHatch* GetHatch(); // Function DeadByDaylight.BaseEscapeThroughHatch.GetHatch // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x5481bc0
};

// Class DeadByDaylight.BaseHitValidationConfigurator
// Size: 0xc0 (Inherited: 0xb8)
struct UBaseHitValidationConfigurator : UActorComponent {
	char pad_B8[0x8]; // 0xb8(0x08)
};

// Class DeadByDaylight.BaseIndicatorWidget
// Size: 0x380 (Inherited: 0x338)
struct UBaseIndicatorWidget : UMobileBaseUserWidget {
	struct UCanvasPanel* _safeZonePanel; // 0x338(0x08)
	struct UCanvasPanelSlot* _canvasPanelSlot; // 0x340(0x08)
	float RadiusMultiplier; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct UCanvasPanel* IndicatorPanel; // 0x350(0x08)
	struct UCanvasPanel* Indicator; // 0x358(0x08)
	struct UImage* ArrowImage; // 0x360(0x08)
	char pad_368[0x18]; // 0x368(0x18)

	void OnOutAnimationFinished(); // Function DeadByDaylight.BaseIndicatorWidget.OnOutAnimationFinished // (Final|Native|Protected) // @ game+0x4850070
};

// Class DeadByDaylight.KillerProjectile
// Size: 0x338 (Inherited: 0x2b8)
struct AKillerProjectile : APhysicsBasedProjectile {
	char pad_2B8[0x48]; // 0x2b8(0x48)
	struct FGameplayTag _killerProjectileAttemptGameEventTag; // 0x300(0x0c)
	char pad_30C[0x4]; // 0x30c(0x04)
	struct UHitValidatorConfigurator* _hitValidatorConfigurator; // 0x310(0x08)
	struct UHitValidatorComponent* _hitValidatorComponent; // 0x318(0x08)
	enum class EHitValidatorConfigName _hitValidationConfigName; // 0x320(0x01)
	char pad_321[0x17]; // 0x321(0x17)

	void SetActiveSlashable(bool Active); // Function DeadByDaylight.KillerProjectile.SetActiveSlashable // (Final|Native|Public|BlueprintCallable) // @ game+0x554f810
	struct UPrimitiveComponent* GetPlayerPrimitiveComponent(); // Function DeadByDaylight.KillerProjectile.GetPlayerPrimitiveComponent // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x554f1b0
	struct ASlasherPlayer* GetLaunchingKiller(); // Function DeadByDaylight.KillerProjectile.GetLaunchingKiller // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x554f120
};

// Class DeadByDaylight.BaseLinkedVomitProjectile
// Size: 0x3a8 (Inherited: 0x338)
struct ABaseLinkedVomitProjectile : AKillerProjectile {
	bool _useSplashDamage; // 0x338(0x01)
	bool _passThroughSurvivors; // 0x339(0x01)
	char pad_33A[0x6]; // 0x33a(0x06)
	struct UPoolableProjectileComponent* _poolableProjectile; // 0x340(0x08)
	struct FMulticastInlineDelegate OnDeactivateOrLaunch; // 0x348(0x10)
	struct UParticleSystemComponent* _vomitTrail; // 0x358(0x08)
	struct USplineMeshComponent* _splineMesh; // 0x360(0x08)
	struct USphereComponent* _splashDamageSphere; // 0x368(0x08)
	struct UAkComponent* _akAudioVomitProjectile; // 0x370(0x08)
	struct UParticleSystem* _vomitSplashCamper; // 0x378(0x08)
	struct UParticleSystem* _vomitSplash; // 0x380(0x08)
	struct UAkAudioEvent* _akAudioEventAudioEventVomitSplash; // 0x388(0x08)
	struct FVector2D _minDecalSize; // 0x390(0x08)
	struct FVector2D _maxDecalSize; // 0x398(0x08)
	bool _isSuperVomit; // 0x3a0(0x01)
	char pad_3A1[0x7]; // 0x3a1(0x07)

	void OnLinkedVomitProjectileDeactivate__DelegateSignature(); // DelegateFunction DeadByDaylight.BaseLinkedVomitProjectile.OnLinkedVomitProjectileDeactivate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x5e02c90
	void OnAffectSurvivor(struct ACamperPlayer* CamperPlayer); // Function DeadByDaylight.BaseLinkedVomitProjectile.OnAffectSurvivor // (Native|Event|Protected|BlueprintEvent) // @ game+0x5482030
	void OnAffectInteractable(struct AInteractable* Interactable, struct USceneComponent* HitComponent); // Function DeadByDaylight.BaseLinkedVomitProjectile.OnAffectInteractable // (Native|Event|Protected|BlueprintEvent) // @ game+0x5481f60
	void NativeExplode(struct FImpactInfo& ImpactInfo); // Function DeadByDaylight.BaseLinkedVomitProjectile.NativeExplode // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x5481ea0
};

// Class DeadByDaylight.BaseLockerItem
// Size: 0x248 (Inherited: 0x230)
struct ABaseLockerItem : AActor {
	struct ALocker* _owningLocker; // 0x230(0x08)
	char pad_238[0x4]; // 0x238(0x04)
	struct FVector _adjustedRelativePosition; // 0x23c(0x0c)

	void OnRep_OwningLocker(); // Function DeadByDaylight.BaseLockerItem.OnRep_OwningLocker // (Final|Native|Protected) // @ game+0x5482730
	void AdjustPositionOnLocker(); // Function DeadByDaylight.BaseLockerItem.AdjustPositionOnLocker // (Final|Native|Private) // @ game+0x5481810
};

// Class DeadByDaylight.BaseSky
// Size: 0x398 (Inherited: 0x230)
struct ABaseSky : AActor {
	char pad_230[0x8]; // 0x230(0x08)
	bool AdjustCullDistance; // 0x238(0x01)
	char pad_239[0x3]; // 0x239(0x03)
	float IBLContributionMultiplier; // 0x23c(0x04)
	struct FLinearColor ProbesTintColor; // 0x240(0x10)
	float ProbesSaturationValue; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
	struct FBHVRPerDetailModeFloat ASMDepthBias; // 0x258(0xa0)
	struct FBHVRPerDetailModeFloat ASMDepthAttenuation; // 0x2f8(0xa0)

	void ToggleLightingChange(bool toggleOn, struct FName ThemeName); // Function DeadByDaylight.BaseSky.ToggleLightingChange // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x5e02c90
	void SetProbesTint(struct FLinearColor InColor, float inSaturation); // Function DeadByDaylight.BaseSky.SetProbesTint // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x54829a0
	void SetCullDistance(float NewCullDistance); // Function DeadByDaylight.BaseSky.SetCullDistance // (Final|Native|Protected|BlueprintCallable) // @ game+0x5482890
	void OnFadeEnd(struct AActor* Other); // Function DeadByDaylight.BaseSky.OnFadeEnd // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x5482250
	void OnFadeBegin(struct AActor* Other); // Function DeadByDaylight.BaseSky.OnFadeBegin // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x54821c0
	void OnAlphaChanged(float newAlpha, struct AActor* Other); // Function DeadByDaylight.BaseSky.OnAlphaChanged // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x54820c0
	struct UPostProcessComponent* GetPostprocessComponent(); // Function DeadByDaylight.BaseSky.GetPostprocessComponent // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x5481d50
	void CopyComponentsSettingsFromSource(struct UStaticMeshComponent* moonMesh, struct UDirectionalLightComponent* shadowLight, struct UDirectionalLightComponent* godRayLight, struct USkyLightComponent* SkyLight, struct UExponentialHeightFogComponent* HeightFog, struct UPostProcessComponent* postProcess, struct UObject* sourceBaseSkyClass); // Function DeadByDaylight.BaseSky.CopyComponentsSettingsFromSource // (Final|Native|Public|BlueprintCallable) // @ game+0x54818e0
};

// Class DeadByDaylight.BaseTrap
// Size: 0x4d0 (Inherited: 0x4c8)
struct ABaseTrap : ACollectable {
	bool _isTrapSet; // 0x4c8(0x01)
	char pad_4C9[0x7]; // 0x4c9(0x07)

	void SetIsTrapSet(bool value); // Function DeadByDaylight.BaseTrap.SetIsTrapSet // (Native|Public|BlueprintCallable) // @ game+0x5487840
	bool IsTrapSet(); // Function DeadByDaylight.BaseTrap.IsTrapSet // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5487540
};

// Class DeadByDaylight.BearTrapOutlineUpdateStrategy
// Size: 0xf8 (Inherited: 0xc0)
struct UBearTrapOutlineUpdateStrategy : UOutlineUpdateStrategy {
	struct FLinearColor UnrevealedColor; // 0xc0(0x10)
	struct FLinearColor RevealedColorToSurvivor; // 0xd0(0x10)
	struct UCurveLinearColor* KillerOutlineFadeCurve; // 0xe0(0x08)
	char pad_E8[0x8]; // 0xe8(0x08)
	struct UMapActorComponent* _owningBearTrapMapActorComponent; // 0xf0(0x08)

	void SetOwningBearTrapMapActorComponent(struct UMapActorComponent* MapActorComponent); // Function DeadByDaylight.BearTrapOutlineUpdateStrategy.SetOwningBearTrapMapActorComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x54878d0
};

// Class DeadByDaylight.BlessedVignetteController
// Size: 0xc8 (Inherited: 0xb8)
struct UBlessedVignetteController : UActorComponent {
	char pad_B8[0x10]; // 0xb8(0x10)

	void OnDeactivateBlessedVignette(); // Function DeadByDaylight.BlessedVignetteController.OnDeactivateBlessedVignette // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnActivateBlessedVignette(); // Function DeadByDaylight.BlessedVignetteController.OnActivateBlessedVignette // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
};

// Class DeadByDaylight.BlindableBaseComponent
// Size: 0x240 (Inherited: 0xb8)
struct UBlindableBaseComponent : UActorComponent {
	char pad_B8[0x90]; // 0xb8(0x90)
	bool _isBlinded; // 0x148(0x01)
	char pad_149[0x7]; // 0x149(0x07)
	struct FTagStateBool _isBeingBlinded; // 0x150(0x30)
	struct UChargeableComponent* _chargeableComponent; // 0x180(0x08)
	struct TMap<struct AActor*, struct TScriptInterface<IBlindingEffectorInterface>> _authority_blindingEffectors; // 0x188(0x50)
	char pad_1D8[0x68]; // 0x1d8(0x68)

	void SetChargeable(struct UChargeableComponent* value); // Function DeadByDaylight.BlindableBaseComponent.SetChargeable // (Final|Native|Public|BlueprintCallable) // @ game+0x54877b0
	void OnRep_IsBlinded(); // Function DeadByDaylight.BlindableBaseComponent.OnRep_IsBlinded // (Final|Native|Private) // @ game+0x5487770
	void OnChargeableCompletionPercentChanged(struct UChargeableComponent* ChargeableComponent, float TotalPercentComplete); // Function DeadByDaylight.BlindableBaseComponent.OnChargeableCompletionPercentChanged // (Final|Native|Private) // @ game+0x5487590
	bool IsBlinded(); // Function DeadByDaylight.BlindableBaseComponent.IsBlinded // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4696d50
	void Authority_RemoveBlindingEffector(struct TScriptInterface<IBlindingEffectorInterface> effector); // Function DeadByDaylight.BlindableBaseComponent.Authority_RemoveBlindingEffector // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x54873e0
	void Authority_Blinded(enum class EBlindType blindType, float BlindnessDuration, struct AActor* effectorActor); // Function DeadByDaylight.BlindableBaseComponent.Authority_Blinded // (Native|Public|BlueprintCallable) // @ game+0x54872d0
	void Authority_AddBlindingEffector(struct TScriptInterface<IBlindingEffectorInterface> effector); // Function DeadByDaylight.BlindableBaseComponent.Authority_AddBlindingEffector // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5486ef0
};

// Class DeadByDaylight.BlindableComponent
// Size: 0x248 (Inherited: 0x240)
struct UBlindableComponent : UBlindableBaseComponent {
	char pad_240[0x8]; // 0x240(0x08)
};

// Class DeadByDaylight.BlindingEffectorInterface
// Size: 0x30 (Inherited: 0x30)
struct UBlindingEffectorInterface : UInterface {
};

// Class DeadByDaylight.BlindingFXComponent
// Size: 0x108 (Inherited: 0xb8)
struct UBlindingFXComponent : UActorComponent {
	char pad_B8[0x14]; // 0xb8(0x14)
	struct FName _blindnessIntensityParameter; // 0xcc(0x0c)
	struct UCurveFloat* _blindnessMaterialCurve; // 0xd8(0x08)
	struct UCurveFloat* _blindnessCurve; // 0xe0(0x08)
	struct UPostProcessComponent* _postProcess; // 0xe8(0x08)
	struct UMaterialInstanceDynamic* _postProcessMaterial; // 0xf0(0x08)
	char pad_F8[0x10]; // 0xf8(0x10)

	void SetPostProcessMaterial(struct UMaterialInstanceDynamic* value); // Function DeadByDaylight.BlindingFXComponent.SetPostProcessMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x54879f0
	void SetPostProcess(struct UPostProcessComponent* value); // Function DeadByDaylight.BlindingFXComponent.SetPostProcess // (Final|Native|Public|BlueprintCallable) // @ game+0x5487960
};

// Class DeadByDaylight.BlockElement
// Size: 0xa8 (Inherited: 0x30)
struct UBlockElement : UObject {
	struct TWeakObjectPtr<struct UObject> _source; // 0x30(0x08)
	struct TSet<struct TWeakObjectPtr<struct ADBDPlayer>> _affectedPlayers; // 0x38(0x50)
	char pad_88[0x20]; // 0x88(0x20)
};

// Class DeadByDaylight.BlockableComponent
// Size: 0x100 (Inherited: 0xb8)
struct UBlockableComponent : UActorComponent {
	char pad_B8[0x18]; // 0xb8(0x18)
	struct FBlockableReplicatedDatum _replicatedDatum; // 0xd0(0x20)
	struct TArray<struct UBlockElement*> _blockElements; // 0xf0(0x10)

	void OnRep_ReplicatedDatum(); // Function DeadByDaylight.BlockableComponent.OnRep_ReplicatedDatum // (Final|Native|Private|Const) // @ game+0x5487790
	void Authority_RemoveBlock(struct UObject* Source); // Function DeadByDaylight.BlockableComponent.Authority_RemoveBlock // (Final|Native|Public|BlueprintCallable) // @ game+0x5487480
	void Authority_AddTimedBlock(struct UObject* Source, float Duration, struct TSet<struct ADBDPlayer*>& affectedPlayers); // Function DeadByDaylight.BlockableComponent.Authority_AddTimedBlock // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x5487110
	void Authority_AddBlock(struct UObject* Source, struct TSet<struct ADBDPlayer*>& affectedPlayers); // Function DeadByDaylight.BlockableComponent.Authority_AddBlock // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x5486f90
};

// Class DeadByDaylight.BloodDecalEffectIntensity
// Size: 0x50 (Inherited: 0x38)
struct UBloodDecalEffectIntensity : UDataAsset {
	struct FColor IntensifyBloodColor; // 0x38(0x04)
	struct FColor IntensifyBloodColor2; // 0x3c(0x04)
	struct FColor IntensifyBloodColorEmissive; // 0x40(0x04)
	float IntensifyBloodColorEmissiveMinimumIntensity; // 0x44(0x04)
	float IntensifyBloodColorEmissiveMaximumIntensity; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class DeadByDaylight.BloodDecalEffect
// Size: 0x118 (Inherited: 0x38)
struct UBloodDecalEffect : UDataAsset {
	struct UCurveFloat* AnimationTimelineCurve; // 0x38(0x08)
	struct UCurveFloat* DestroyTimelineCurve; // 0x40(0x08)
	struct TArray<struct UTexture2D*> Textures; // 0x48(0x10)
	struct TArray<struct UTexture2D*> Normals; // 0x58(0x10)
	bool EnableVisualEffects; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct UBloodDecalEffectIntensity* BloodDecalEffectIntensity; // 0x70(0x08)
	float ColorInterpolationSpeed; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct UMaterialInterface* DefalultDecalMaterial; // 0x80(0x08)
	char pad_88[0x90]; // 0x88(0x90)
};

// Class DeadByDaylight.Bloodlust
// Size: 0x488 (Inherited: 0x350)
struct UBloodlust : UStatusEffect {
	struct UCurveFloat* BloodlustCurve; // 0x350(0x08)
	char pad_358[0x20]; // 0x358(0x20)
	float _bloodlustTime; // 0x378(0x04)
	char pad_37C[0x2c]; // 0x37c(0x2c)
	struct TArray<struct FGameplayTag> _bloodlustResettingGameEvents; // 0x3a8(0x10)
	char pad_3B8[0xd0]; // 0x3b8(0xd0)

	void OnRep_BloodlustTime(float oldBloodlustTime); // Function DeadByDaylight.Bloodlust.OnRep_BloodlustTime // (Final|Native|Private) // @ game+0x54876f0
	void OnChaseStartedEvent(struct ADBDPlayer* chasedPlayer); // Function DeadByDaylight.Bloodlust.OnChaseStartedEvent // (Final|Native|Private) // @ game+0x5487660
	void OnAllChaseEndedEvent(); // Function DeadByDaylight.Bloodlust.OnAllChaseEndedEvent // (Final|Native|Private) // @ game+0x5487570
	float GetBloodlustTime(); // Function DeadByDaylight.Bloodlust.GetBloodlustTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5487510
	void DBD_SetBloodlust(int32_t Amount, bool enableDecay); // Function DeadByDaylight.Bloodlust.DBD_SetBloodlust // (Final|Exec|Native|Public) // @ game+0x46a2510
};

// Class DeadByDaylight.BloodTrailSettings
// Size: 0x1a0 (Inherited: 0x38)
struct UBloodTrailSettings : UDataAsset {
	float _initialDelay; // 0x38(0x04)
	int32_t _numBloodDropsPerBloodPool; // 0x3c(0x04)
	float _bloodDropsInterval; // 0x40(0x04)
	bool _randomlyRotateBloodDrops; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	float _bloodDropsRandomScatter; // 0x48(0x04)
	enum class ETraceTypeQuery _bloodTraceChannel; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	struct UBloodDecalEffect* _bloodDecalEffect; // 0x50(0x08)
	struct FBHVRPerDetailModeInt _decalPoolSize; // 0x58(0xa0)
	float _recycleThresholdPercentage; // 0xf8(0x04)
	float _recycleDistancePercentage; // 0xfc(0x04)
	struct FBHVRPerDetailModeInt _maxOverlapping; // 0x100(0xa0)
};

// Class DeadByDaylight.BloodTrailComponent
// Size: 0x240 (Inherited: 0xb8)
struct UBloodTrailComponent : UActorComponent {
	struct UBloodTrailSettings* _bloodTrailSettings; // 0xb8(0x08)
	char pad_C0[0x80]; // 0xc0(0x80)
	struct TMap<struct UDBDDecalComponent*, struct FBloodDecal> _bloodDecals; // 0x140(0x50)
	struct UBloodDecalEffect* _bloodDecalEffect; // 0x190(0x08)
	char pad_198[0x90]; // 0x198(0x90)
	struct UDecalSpawner* _decalSpawner; // 0x228(0x08)
	char pad_230[0x10]; // 0x230(0x10)

	void ConditionalStartBleeding(); // Function DeadByDaylight.BloodTrailComponent.ConditionalStartBleeding // (Native|Public|BlueprintCallable) // @ game+0x4aa7040
};

// Class DeadByDaylight.BloodwebTunables
// Size: 0x38 (Inherited: 0x30)
struct UBloodwebTunables : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class DeadByDaylight.BloodwebBackendTunables
// Size: 0xa8 (Inherited: 0x38)
struct UBloodwebBackendTunables : UBloodwebTunables {
	char pad_38[0x70]; // 0x38(0x70)
};

// Class DeadByDaylight.BloodwebClientTunables
// Size: 0x38 (Inherited: 0x38)
struct UBloodwebClientTunables : UBloodwebTunables {
};

// Class DeadByDaylight.BloodwebDistribution
// Size: 0x328 (Inherited: 0x30)
struct UBloodwebDistribution : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct UDBDDesignTunables* _designTunables; // 0x40(0x08)
	struct UBloodwebTunables* _bloodwebTunables; // 0x48(0x08)
	char pad_50[0x2d8]; // 0x50(0x2d8)
};

// Class DeadByDaylight.BloodwebEntity
// Size: 0x78 (Inherited: 0x30)
struct UBloodwebEntity : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UDBDGameInstance* _gameInstance; // 0x38(0x08)
	struct UBloodwebTunables* _bloodwebTunables; // 0x40(0x08)
	struct TScriptInterface<IDBDBloodwebDefinitionBase> _bloodwebDefinition; // 0x48(0x10)
	char pad_58[0x20]; // 0x58(0x20)
};

// Class DeadByDaylight.BloodwebGenerator
// Size: 0x100 (Inherited: 0x30)
struct UBloodwebGenerator : UObject {
	char pad_30[0xc]; // 0x30(0x0c)
	struct FRandomStream _randomizationStream; // 0x3c(0x08)
	char pad_44[0x4]; // 0x44(0x04)
	struct TArray<struct FString> _selectedNodes; // 0x48(0x10)
	struct TArray<struct FName> _selectedContent; // 0x58(0x10)
	char pad_68[0x48]; // 0x68(0x48)
	struct TScriptInterface<IDBDBloodwebDefinitionBase> _bloodwebDefinition; // 0xb0(0x10)
	struct UDBDDesignTunables* _designTunables; // 0xc0(0x08)
	struct UBloodwebTunables* _bloodwebTunables; // 0xc8(0x08)
	float _alternativePathOccurenceFactor; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct UBloodwebDistribution* _dataDistribution; // 0xd8(0x08)
	struct UBloodwebSettings* _bloodwebSettings; // 0xe0(0x08)
	char pad_E8[0x18]; // 0xe8(0x18)
};

// Class DeadByDaylight.BloodwebHandler
// Size: 0x98 (Inherited: 0x30)
struct UBloodwebHandler : UObject {
	char pad_30[0x68]; // 0x30(0x68)
};

// Class DeadByDaylight.BloodwebManager
// Size: 0x200 (Inherited: 0x30)
struct UBloodwebManager : UObject {
	char pad_30[0x60]; // 0x30(0x60)
	struct UBloodwebGenerator* _bloodwebBuilderClass; // 0x90(0x08)
	struct UDBDGameInstance* _gameInstance; // 0x98(0x08)
	struct UDBDDesignTunables* _designTunables; // 0xa0(0x08)
	struct UBaseBloodwebContentAdapter* _bloodWebContentAdapter; // 0xa8(0x08)
	struct UBloodwebHandler* _bloodwebHandler; // 0xb0(0x08)
	struct UBloodwebPathfinder* _bloodwebPathfinder; // 0xb8(0x08)
	char pad_C0[0x140]; // 0xc0(0x140)

	void Init(struct UDBDGameInstance* GameInstance, struct UDBDDesignTunables* Tunables); // Function DeadByDaylight.BloodwebManager.Init // (Final|Native|Public) // @ game+0x548b670
};

// Class DeadByDaylight.BloodwebPathfinder
// Size: 0x50 (Inherited: 0x30)
struct UBloodwebPathfinder : UObject {
	char pad_30[0x20]; // 0x30(0x20)
};

// Class DeadByDaylight.BloodwebSettings
// Size: 0x48 (Inherited: 0x38)
struct UBloodwebSettings : UDataAsset {
	struct TArray<struct FName> _duplicableItems; // 0x38(0x10)
};

// Class DeadByDaylight.BlueprintDebugUtilities
// Size: 0x30 (Inherited: 0x30)
struct UBlueprintDebugUtilities : UBlueprintFunctionLibrary {

	void EnsureOnConditionWithMessage(bool Condition, struct FString ensureMessage); // Function DeadByDaylight.BlueprintDebugUtilities.EnsureOnConditionWithMessage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x548b590
	void EnsureFalseWithMessage(struct FString ensureMessage); // Function DeadByDaylight.BlueprintDebugUtilities.EnsureFalseWithMessage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x4b76a30
};

// Class DeadByDaylight.BlueprintPlatformUtilities
// Size: 0x30 (Inherited: 0x30)
struct UBlueprintPlatformUtilities : UBlueprintFunctionLibrary {

	int32_t ToInteger(struct FDBDPerPlatformInt& PerPlatformInt, struct UObject* objectInWorld); // Function DeadByDaylight.BlueprintPlatformUtilities.ToInteger // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x548b820
	float ToFloat(struct FDBDPerPlatformFloat& PerPlatformFloat, struct UObject* objectInWorld); // Function DeadByDaylight.BlueprintPlatformUtilities.ToFloat // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x548b740
};

// Class DeadByDaylight.BonusPointEventsManager
// Size: 0xe8 (Inherited: 0x30)
struct UBonusPointEventsManager : UObject {
	char pad_30[0xb8]; // 0x30(0xb8)
};

// Class DeadByDaylight.Tile
// Size: 0x348 (Inherited: 0x230)
struct ATile : AActor {
	bool RerunConstructionScript; // 0x230(0x01)
	char pad_231[0x3]; // 0x231(0x03)
	int32_t MinimumSpacing; // 0x234(0x04)
	int32_t MaximumSpacing; // 0x238(0x04)
	bool DiagonalSpacing; // 0x23c(0x01)
	bool TypeSpacing; // 0x23d(0x01)
	char pad_23E[0x2]; // 0x23e(0x02)
	int32_t MaximumCount; // 0x240(0x04)
	struct FVector2D Dimension; // 0x244(0x08)
	char pad_24C[0x4]; // 0x24c(0x04)
	struct TArray<enum class EscapeStrategyType> AvailableEscapeTypes; // 0x250(0x10)
	enum class ETileType Type; // 0x260(0x01)
	enum class EDensity Density; // 0x261(0x01)
	enum class EPathType Path; // 0x262(0x01)
	char pad_263[0x1]; // 0x263(0x01)
	int32_t Number; // 0x264(0x04)
	bool PlaceHolder; // 0x268(0x01)
	bool Replacement; // 0x269(0x01)
	char pad_26A[0x2]; // 0x26a(0x02)
	int32_t SpawnPriorityTier; // 0x26c(0x04)
	float Weight; // 0x270(0x04)
	struct FVector2D Coord; // 0x274(0x08)
	enum class EQuadrantSpawnType QuadrantSpawnType; // 0x27c(0x01)
	enum class EBasementType BasementType; // 0x27d(0x01)
	char pad_27E[0x2]; // 0x27e(0x02)
	struct TArray<struct UTileSpawnPoint*> SpawnPointsCache; // 0x280(0x10)
	struct TArray<struct UObjectRandomizer*> ObjectRandomizersCache; // 0x290(0x10)
	struct TArray<struct UActorSpawner*> ActorSpawnersCache; // 0x2a0(0x10)
	struct TArray<struct UActorVariationSpawner*> ActorVariationSpawnersCache; // 0x2b0(0x10)
	char pad_2C0[0x7c]; // 0x2c0(0x7c)
	struct FRandomStream SharedTileRandomizer; // 0x33c(0x08)
	bool _initialized; // 0x344(0x01)
	char pad_345[0x3]; // 0x345(0x03)

	void OnSetSpawnObject(struct UTileSpawnPoint* TileSpawnPoint, struct AActor* spawnedObject); // Function DeadByDaylight.Tile.OnSetSpawnObject // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void OnRep_Initialized(bool oldValue); // Function DeadByDaylight.Tile.OnRep_Initialized // (Final|Native|Protected) // @ game+0x55c3eb0
	void OnAllTileSpawned(); // Function DeadByDaylight.Tile.OnAllTileSpawned // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void InitOnSpawned(); // Function DeadByDaylight.Tile.InitOnSpawned // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
};

// Class DeadByDaylight.BorderTile
// Size: 0x368 (Inherited: 0x348)
struct ABorderTile : ATile {
	struct TArray<struct FBorderElements> Borders; // 0x348(0x10)
	struct UMapData* _map; // 0x358(0x08)
	char pad_360[0x8]; // 0x360(0x08)
};

// Class DeadByDaylight.BreakableBase
// Size: 0x360 (Inherited: 0x338)
struct ABreakableBase : AInteractable {
	struct UBoxComponent* _breakableCollision; // 0x338(0x08)
	enum class EBreakableState _state; // 0x340(0x01)
	char pad_341[0x7]; // 0x341(0x07)
	struct UAkComponent* _akAudioBreakable; // 0x348(0x08)
	struct UAkAudioEvent* _akAudioBreakEvent; // 0x350(0x08)
	struct USceneComponent* _rootComponent; // 0x358(0x08)

	void PlayAudioBreakable(); // Function DeadByDaylight.BreakableBase.PlayAudioBreakable // (Final|Native|Public|BlueprintCallable) // @ game+0x54912f0
	bool IsUnbroken(); // Function DeadByDaylight.BreakableBase.IsUnbroken // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490970
	void ExplodeVfxSfx(struct FVector ImpulseDir); // Function DeadByDaylight.BreakableBase.ExplodeVfxSfx // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0x5e02c90
	void Explode(struct ADBDPlayer* Player); // Function DeadByDaylight.BreakableBase.Explode // (Final|Native|Public|BlueprintCallable) // @ game+0x5490440
};

// Class DeadByDaylight.BreakableWallOutlineUpdateStrategy
// Size: 0x138 (Inherited: 0x138)
struct UBreakableWallOutlineUpdateStrategy : USourceBasedOutlineUpdateStrategy {
};

// Class DeadByDaylight.BubbleIndicator
// Size: 0x238 (Inherited: 0x230)
struct ABubbleIndicator : AActor {
	float _lifetime; // 0x230(0x04)
	bool _displayToLocallyObserved; // 0x234(0x01)
	bool _isInRange; // 0x235(0x01)
	bool _isPreSpawned; // 0x236(0x01)
	char pad_237[0x1]; // 0x237(0x01)

	void SetSilhouette(struct UStaticMesh* StaticMesh); // Function DeadByDaylight.BubbleIndicator.SetSilhouette // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void DeactivateBubble(); // Function DeadByDaylight.BubbleIndicator.DeactivateBubble // (Final|Native|Protected|BlueprintCallable) // @ game+0x54903e0
	void ActivateBubbleFX(float Duration); // Function DeadByDaylight.BubbleIndicator.ActivateBubbleFX // (Event|Public|BlueprintEvent) // @ game+0x5e02c90
};

// Class DeadByDaylight.BubbleIndicatorNotifier
// Size: 0x30 (Inherited: 0x30)
struct UBubbleIndicatorNotifier : UBlueprintFunctionLibrary {

	void SpawnBubbleIndicator(struct UObject* WorldContextObject, struct ABubbleIndicator* bubbleIndicatorBP, struct FTransform Transform, bool TriggerLoudNoise, bool spawnOnKillerSideOnly, float lifetime, struct UStaticMesh* silhouetteStaticMesh, float audibleRange); // Function DeadByDaylight.BubbleIndicatorNotifier.SpawnBubbleIndicator // (Final|Native|Static|Private|HasDefaults|BlueprintCallable) // @ game+0x5491720
	struct ABubbleIndicator* PreSpawnBubbleIndicator(struct UObject* WorldContextObject, struct ABubbleIndicator* bubbleIndicatorBP, struct UStaticMesh* silhouetteStaticMesh); // Function DeadByDaylight.BubbleIndicatorNotifier.PreSpawnBubbleIndicator // (Final|Native|Static|Private|BlueprintCallable) // @ game+0x54913a0
	void ActivateBubbleIndicator(struct UObject* WorldContextObject, struct ABubbleIndicator* BubbleIndicator, struct FTransform Transform, bool TriggerLoudNoise, float lifetime, float audibleRange); // Function DeadByDaylight.BubbleIndicatorNotifier.ActivateBubbleIndicator // (Final|Native|Static|Private|HasDefaults|BlueprintCallable) // @ game+0x548f320
};

// Class DeadByDaylight.CameraAttachmentComponent
// Size: 0x168 (Inherited: 0xb8)
struct UCameraAttachmentComponent : UActorComponent {
	struct USceneComponent* _anchor; // 0xb8(0x08)
	char pad_C0[0x10]; // 0xc0(0x10)
	struct FCameraAttachment _defaultCameraAttachment; // 0xd0(0x18)
	struct FCameraAttachment _currentCameraAttachment; // 0xe8(0x18)
	char pad_100[0x68]; // 0x100(0x68)

	void Reset(); // Function DeadByDaylight.CameraAttachmentComponent.Reset // (Final|Native|Public|BlueprintCallable) // @ game+0x54914a0
	bool IsAttached(); // Function DeadByDaylight.CameraAttachmentComponent.IsAttached // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54907f0
	void Detach(); // Function DeadByDaylight.CameraAttachmentComponent.Detach // (Final|Native|Public|BlueprintCallable) // @ game+0x5490400
};

// Class DeadByDaylight.CameraFadeComponent
// Size: 0xf0 (Inherited: 0xb8)
struct UCameraFadeComponent : UActorComponent {
	char pad_B8[0x38]; // 0xb8(0x38)

	void OnFadedOut(); // Function DeadByDaylight.CameraFadeComponent.OnFadedOut // (Final|Native|Public|BlueprintCallable) // @ game+0x54911c0
	void OnFadedIn(); // Function DeadByDaylight.CameraFadeComponent.OnFadedIn // (Final|Native|Public|BlueprintCallable) // @ game+0x54911a0
	enum class ECameraFadeState GetCameraFadeState(); // Function DeadByDaylight.CameraFadeComponent.GetCameraFadeState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54904d0
};

// Class DeadByDaylight.CameraHandlerComponent
// Size: 0x1a8 (Inherited: 0xb8)
struct UCameraHandlerComponent : UActorComponent {
	char pad_B8[0x20]; // 0xb8(0x20)
	struct TMap<enum class EDBDCameraSocketID, struct AActor*> _cameraMap; // 0xd8(0x50)
	enum class EDBDCameraSocketID _delayedSocketID; // 0x128(0x01)
	enum class EDBDCameraSocketID _currentSocketID; // 0x129(0x01)
	char pad_12A[0x47]; // 0x12a(0x47)
	bool _manualZoomAllowPerkModifiers; // 0x171(0x01)
	char pad_172[0x6]; // 0x172(0x06)
	struct UCurveFloat* _manualZoomCurveFloat; // 0x178(0x08)
	struct FName _cameraAttachmentSocket; // 0x180(0x0c)
	char pad_18C[0x4]; // 0x18c(0x04)
	struct USceneComponent* _cameraAttachmentComponent; // 0x190(0x08)
	char pad_198[0x8]; // 0x198(0x08)
	bool _isFOVSystemActive; // 0x1a0(0x01)
	char pad_1A1[0x7]; // 0x1a1(0x07)

	void SetSocketID(enum class EDBDCameraSocketID Mode); // Function DeadByDaylight.CameraHandlerComponent.SetSocketID // (Final|Native|Public|BlueprintCallable) // @ game+0x5491670
	void SetAttachmentComponent(struct USceneComponent* attachmentComponent); // Function DeadByDaylight.CameraHandlerComponent.SetAttachmentComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x54914c0
	void PlayVFXOnCurrentCamera(struct UParticleSystemComponent* Component); // Function DeadByDaylight.CameraHandlerComponent.PlayVFXOnCurrentCamera // (Final|Native|Public|BlueprintCallable) // @ game+0x5491310
	enum class EDBDCameraSocketID GetSocketID(); // Function DeadByDaylight.CameraHandlerComponent.GetSocketID // (Final|Native|Public|BlueprintCallable) // @ game+0x5490680
	float GetDesiredFOV(); // Function DeadByDaylight.CameraHandlerComponent.GetDesiredFOV // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54905c0
	struct AActor* GetCurrentCamera(); // Function DeadByDaylight.CameraHandlerComponent.GetCurrentCamera // (Final|Native|Public|BlueprintCallable) // @ game+0x5490500
	void AddCameraToSocket(enum class EDBDCameraSocketID Mode, struct AActor* Camera); // Function DeadByDaylight.CameraHandlerComponent.AddCameraToSocket // (Final|Native|Public|BlueprintCallable) // @ game+0x548f560
};

// Class DeadByDaylight.CameraOffsetController
// Size: 0x108 (Inherited: 0xb8)
struct UCameraOffsetController : UActorComponent {
	char pad_B8[0x50]; // 0xb8(0x50)
};

// Class DeadByDaylight.CamperBloodTrailComponent
// Size: 0x270 (Inherited: 0x240)
struct UCamperBloodTrailComponent : UBloodTrailComponent {
	struct UPerkManager* _camperPerkManager; // 0x240(0x08)
	char pad_248[0x28]; // 0x248(0x28)

	void OnDamageStateChanged(enum class ECamperDamageState oldDamageState, enum class ECamperDamageState CurrentDamageState); // Function DeadByDaylight.CamperBloodTrailComponent.OnDamageStateChanged // (Final|Native|Private) // @ game+0x5491090
};

// Class DeadByDaylight.CharacterDreamworldComponent
// Size: 0x138 (Inherited: 0xb8)
struct UCharacterDreamworldComponent : UActorComponent {
	struct FMulticastInlineDelegate DreamStateChanged; // 0xb8(0x10)
	struct AActor* _mobileDreamworldPostProcessClass; // 0xc8(0x08)
	struct FTagStateBool _isInDreamworld; // 0xd0(0x30)
	struct APostProcessUpdate* _mobileDreamworldPostProcess; // 0x100(0x08)
	char pad_108[0x30]; // 0x108(0x30)

	bool ShouldShowVignette(); // Function DeadByDaylight.CharacterDreamworldComponent.ShouldShowVignette // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a1fd0
	void OnRep_IsInDreamworld(); // Function DeadByDaylight.CharacterDreamworldComponent.OnRep_IsInDreamworld // (Final|Native|Private) // @ game+0x54a1d30
	bool IsInDreamworld(); // Function DeadByDaylight.CharacterDreamworldComponent.IsInDreamworld // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54a18f0
	struct ADBDPlayer* GetLocallyObservedOrLocalCharacter(struct UObject* WorldContextObject); // Function DeadByDaylight.CharacterDreamworldComponent.GetLocallyObservedOrLocalCharacter // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x54a10c0
	void FireWakeUpScoreEvent(struct ADBDPlayer* Instigator); // Function DeadByDaylight.CharacterDreamworldComponent.FireWakeUpScoreEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x54a0390
	void Authority_SetIsInDreamworld(bool NewValue, bool isScripted); // Function DeadByDaylight.CharacterDreamworldComponent.Authority_SetIsInDreamworld // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x4aec730
};

// Class DeadByDaylight.CamperDreamworldComponent
// Size: 0x228 (Inherited: 0x138)
struct UCamperDreamworldComponent : UCharacterDreamworldComponent {
	struct FMulticastInlineDelegate OnCamperTriggeredDreamTrap; // 0x138(0x10)
	struct UStatusEffect* _survivorDreamWorldStatusEffect; // 0x148(0x08)
	struct FSurvivorSleepiness _survivorSleepiness; // 0x150(0x08)
	float _sleepinessProtectionRemainingDuration; // 0x158(0x04)
	float _sleepGainPerSecond; // 0x15c(0x04)
	char pad_160[0x4]; // 0x160(0x04)
	int32_t _wakeUpByOtherCount; // 0x164(0x04)
	bool _showKiller; // 0x168(0x01)
	char pad_169[0x7]; // 0x169(0x07)
	struct FFastTimer _killerGlimpseDurationTimer; // 0x170(0x30)
	char pad_1A0[0x10]; // 0x1a0(0x10)
	struct FFastTimer _killerGlimpseCooldownTimer; // 0x1b0(0x30)
	char pad_1E0[0x10]; // 0x1e0(0x10)
	float _glimpseMinDistance; // 0x1f0(0x04)
	float _glimpseMaxDistance; // 0x1f4(0x04)
	float _killerGlimpseCooldown; // 0x1f8(0x04)
	float _killerGlimpseDuration; // 0x1fc(0x04)
	int32_t _wakeUpBySkillCheckCount; // 0x200(0x04)
	int32_t _fellAsleepCount; // 0x204(0x04)
	bool _forcedAsleep; // 0x208(0x01)
	char pad_209[0x7]; // 0x209(0x07)
	struct AWakerObject* _linkedWaker; // 0x210(0x08)
	bool _useScriptedKillerVisibility; // 0x218(0x01)
	char pad_219[0x7]; // 0x219(0x07)
	bool _showKillerInstantly; // 0x220(0x01)
	char pad_221[0x7]; // 0x221(0x07)

	bool ShouldLookSleepyToLocalPlayer(); // Function DeadByDaylight.CamperDreamworldComponent.ShouldLookSleepyToLocalPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54916f0
	void SetScriptedKillerVisibility(bool useScriptedKillerVisibility); // Function DeadByDaylight.CamperDreamworldComponent.SetScriptedKillerVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x54915e0
	void OnRep_ShowKiller(); // Function DeadByDaylight.CamperDreamworldComponent.OnRep_ShowKiller // (Final|Native|Private) // @ game+0x54912d0
	void Local_SetShowKiller(bool showKiller, bool instantly); // Function DeadByDaylight.CamperDreamworldComponent.Local_SetShowKiller // (Final|Native|Public|BlueprintCallable) // @ game+0x54909a0
	void InitializeTunableValues(struct ASlasherPlayer* killer); // Function DeadByDaylight.CamperDreamworldComponent.InitializeTunableValues // (Final|Native|Private) // @ game+0x5490760
	void HandleShowKillerChanged(bool showKiller, bool instantly); // Function DeadByDaylight.CamperDreamworldComponent.HandleShowKillerChanged // (Event|Protected|BlueprintEvent) // @ game+0x5e02c90
	int32_t GetWakeUpByOtherCount(); // Function DeadByDaylight.CamperDreamworldComponent.GetWakeUpByOtherCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54906b0
	bool CanWakeUpBySkillCheck(); // Function DeadByDaylight.CamperDreamworldComponent.CanWakeUpBySkillCheck // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54903b0
	bool CanWakeUp(); // Function DeadByDaylight.CamperDreamworldComponent.CanWakeUp // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490380
	void BroadcastCamperTriggeredDreamTrap(struct AActor* dreamObject); // Function DeadByDaylight.CamperDreamworldComponent.BroadcastCamperTriggeredDreamTrap // (Final|Native|Public|BlueprintCallable) // @ game+0x5490230
	void Authority_WakeUpByWakerObject(); // Function DeadByDaylight.CamperDreamworldComponent.Authority_WakeUpByWakerObject // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5490210
	void Authority_WakeUpByOther(struct ADBDPlayer* Instigator); // Function DeadByDaylight.CamperDreamworldComponent.Authority_WakeUpByOther // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5490180
	void Authority_WakeUpByHook(); // Function DeadByDaylight.CamperDreamworldComponent.Authority_WakeUpByHook // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5490160
	void Authority_SpawnDreamworldStatusEffect(); // Function DeadByDaylight.CamperDreamworldComponent.Authority_SpawnDreamworldStatusEffect // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|Const) // @ game+0x5490140
	void Authority_PutAsleep(); // Function DeadByDaylight.CamperDreamworldComponent.Authority_PutAsleep // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5490000
	void Authority_OnAttacked(); // Function DeadByDaylight.CamperDreamworldComponent.Authority_OnAttacked // (Final|Native|Private) // @ game+0x548fd50
	void Authority_HandleSkillCheckFailure(bool wakeUpEveryoneInteracting, struct ADBDPlayer* Instigator); // Function DeadByDaylight.CamperDreamworldComponent.Authority_HandleSkillCheckFailure // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x548f920
	int32_t Authority_GetWakeUpBySkillCheckCount(); // Function DeadByDaylight.CamperDreamworldComponent.Authority_GetWakeUpBySkillCheckCount // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x548f8f0
	int32_t Authority_GetFellAsleepCount(); // Function DeadByDaylight.CamperDreamworldComponent.Authority_GetFellAsleepCount // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x548f8c0
};

// Class DeadByDaylight.CamperEndGameComponent
// Size: 0x118 (Inherited: 0xb8)
struct UCamperEndGameComponent : UActorComponent {
	char pad_B8[0x48]; // 0xb8(0x48)
	struct AEndGameEntity* _endGameEntityClass; // 0x100(0x08)
	char pad_108[0x4]; // 0x108(0x04)
	float _delayBeforeSacrifice; // 0x10c(0x04)
	bool _readyToBeSacrificed; // 0x110(0x01)
	char pad_111[0x7]; // 0x111(0x07)

	void OnEndGameSacrificeEnd(); // Function DeadByDaylight.CamperEndGameComponent.OnEndGameSacrificeEnd // (Final|Native|Public|BlueprintCallable) // @ game+0x5491180
	void OnDelayBeforeSacrificeEnd(); // Function DeadByDaylight.CamperEndGameComponent.OnDelayBeforeSacrificeEnd // (Final|Native|Private) // @ game+0x5491160
	bool GetSacrificedByEndGame(); // Function DeadByDaylight.CamperEndGameComponent.GetSacrificedByEndGame // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490650
};

// Class DeadByDaylight.CamperExposerInstance
// Size: 0x260 (Inherited: 0x230)
struct ACamperExposerInstance : AActor {
	bool IsInterior; // 0x230(0x01)
	char pad_231[0x7]; // 0x231(0x07)
	struct FString _audioAgravationLevelRtpc; // 0x238(0x10)
	char pad_248[0x18]; // 0x248(0x18)

	void StartSpawnSequence(bool withRandomDelay); // Function DeadByDaylight.CamperExposerInstance.StartSpawnSequence // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x5491a80
	void StartExitSequence(bool withRandomDelay); // Function DeadByDaylight.CamperExposerInstance.StartExitSequence // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x54919f0
	void SetIsInteriorBP(bool interior); // Function DeadByDaylight.CamperExposerInstance.SetIsInteriorBP // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x5e02c90
	void ExitSequenceComplete(); // Function DeadByDaylight.CamperExposerInstance.ExitSequenceComplete // (Final|Native|Public|BlueprintCallable) // @ game+0x5490420
};

// Class DeadByDaylight.CamperHealthComponent
// Size: 0x2f0 (Inherited: 0xb8)
struct UCamperHealthComponent : UActorComponent {
	struct FMulticastInlineDelegate OnHealedDelegate; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnInjuredBleedoutStarted; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnInjuredBleedoutEnded; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnInjuredBleedoutKO; // 0xe8(0x10)
	char pad_F8[0x30]; // 0xf8(0x30)
	struct FMulticastInlineDelegate OnDamageStateChanged; // 0x128(0x10)
	struct FMulticastInlineDelegate OnDamageStateChangedCosmetic; // 0x138(0x10)
	char pad_148[0x18]; // 0x148(0x18)
	struct FDBDTunableRowHandle _bleedoutBaseDuration; // 0x160(0x28)
	struct FTagStateBool _inInjuredBleedOut; // 0x188(0x30)
	struct FDBDTimer _bleedOutTimer; // 0x1b8(0x28)
	bool _canBleedout; // 0x1e0(0x01)
	char pad_1E1[0x7]; // 0x1e1(0x07)
	struct TArray<struct UInteractionDefinition*> _pauseInjuredBleedoutTimerInteractions; // 0x1e8(0x10)
	int32_t _currentHealthStateCount; // 0x1f8(0x04)
	char pad_1FC[0x4]; // 0x1fc(0x04)
	int32_t _numHealthyHeals; // 0x200(0x04)
	char pad_204[0x4]; // 0x204(0x04)
	struct FDBDTimer _dyingTimer; // 0x208(0x28)
	char pad_230[0x8]; // 0x230(0x08)
	struct UChargeableComponent* _healFromDyingChargeable; // 0x238(0x08)
	struct UChargeableComponent* _healFromInjuredChargeable; // 0x240(0x08)
	struct UChargeableComponent* _mendChargeable; // 0x248(0x08)
	struct ADBDPlayer* _injuredBleedoutInstigator; // 0x250(0x08)
	char pad_258[0x98]; // 0x258(0x98)

	void SetCanBleedout(bool canBleedout); // Function DeadByDaylight.CamperHealthComponent.SetCanBleedout // (Final|Native|Public|BlueprintCallable) // @ game+0x5491550
	void OnRep_InInjuredBleedOut(); // Function DeadByDaylight.CamperHealthComponent.OnRep_InInjuredBleedOut // (Final|Native|Private) // @ game+0x54912b0
	void OnImmobilizedStateChanged(enum class EImmobilizedState oldImmobilizeState, enum class EImmobilizedState newImmobilizeState); // Function DeadByDaylight.CamperHealthComponent.OnImmobilizedStateChanged // (Final|Native|Private) // @ game+0x54911e0
	void OnDamageStateChangedCosmetic__DelegateSignature(); // DelegateFunction DeadByDaylight.CamperHealthComponent.OnDamageStateChangedCosmetic__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x5e02c90
	void Multicast_SetHealthType(enum class EHealthType healthType); // Function DeadByDaylight.CamperHealthComponent.Multicast_SetHealthType // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x5491010
	void Multicast_SetHealthStateFromDamageState(enum class ECamperDamageState damageState, bool FireScoreEvent); // Function DeadByDaylight.CamperHealthComponent.Multicast_SetHealthStateFromDamageState // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x5490f30
	void Multicast_SetDamageState(enum class ECamperDamageState damageState, bool FireScoreEvent, bool sacrificed); // Function DeadByDaylight.CamperHealthComponent.Multicast_SetDamageState // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x5490e10
	void Multicast_SetCurrentHealthStateCount(int32_t newHealth, bool FireScoreEvent); // Function DeadByDaylight.CamperHealthComponent.Multicast_SetCurrentHealthStateCount // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x5490d40
	void Multicast_OnSurvivorGainedHealthStateByOthersEvents(bool healedFromKO, struct ADBDPlayer* healedSurvivor, struct TArray<struct ADBDPlayer*> Healers, struct TArray<bool> healedSurvivorFarEnoughAway); // Function DeadByDaylight.CamperHealthComponent.Multicast_OnSurvivorGainedHealthStateByOthersEvents // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x5490bb0
	void Multicast_OnInjuredBleedoutKO(struct ADBDPlayer* injuredBleedoutInstigator); // Function DeadByDaylight.CamperHealthComponent.Multicast_OnInjuredBleedoutKO // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x5490b20
	void Multicast_OnHealed(struct FCamperHealResult healResult); // Function DeadByDaylight.CamperHealthComponent.Multicast_OnHealed // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x5490a70
	bool IsKO(); // Function DeadByDaylight.CamperHealthComponent.IsKO // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490940
	bool IsInjuredBleedoutTimerExpired(); // Function DeadByDaylight.CamperHealthComponent.IsInjuredBleedoutTimerExpired // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490910
	bool IsInjured(); // Function DeadByDaylight.CamperHealthComponent.IsInjured // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54908e0
	bool IsInInjuredBleedout(); // Function DeadByDaylight.CamperHealthComponent.IsInInjuredBleedout // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54908b0
	bool IsHealthy(); // Function DeadByDaylight.CamperHealthComponent.IsHealthy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490880
	bool IsDyingTimerExpired(); // Function DeadByDaylight.CamperHealthComponent.IsDyingTimerExpired // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490850
	bool IsDead(); // Function DeadByDaylight.CamperHealthComponent.IsDead // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490820
	void IncreaseHPSlotSize(float percent); // Function DeadByDaylight.CamperHealthComponent.IncreaseHPSlotSize // (Final|Native|Public|BlueprintCallable) // @ game+0x54906e0
	float GetPercentInjuredBleedoutTimer(); // Function DeadByDaylight.CamperHealthComponent.GetPercentInjuredBleedoutTimer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490620
	float GetPercentDyingTimer(); // Function DeadByDaylight.CamperHealthComponent.GetPercentDyingTimer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54905f0
	enum class ECamperDamageState GetDamageState(); // Function DeadByDaylight.CamperHealthComponent.GetDamageState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490590
	float GetCurrentTotalHealthBarPercent(); // Function DeadByDaylight.CamperHealthComponent.GetCurrentTotalHealthBarPercent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490560
	struct UChargeableComponent* GetCurrentHPSlot(); // Function DeadByDaylight.CamperHealthComponent.GetCurrentHPSlot // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x5490530
	bool CanHealSelf(); // Function DeadByDaylight.CamperHealthComponent.CanHealSelf // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490350
	bool CanBeHealedFromInjured(); // Function DeadByDaylight.CamperHealthComponent.CanBeHealedFromInjured // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54902f0
	bool CanBeHealed(); // Function DeadByDaylight.CamperHealthComponent.CanBeHealed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54902c0
	bool CanBecomeHealthy(); // Function DeadByDaylight.CamperHealthComponent.CanBecomeHealthy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5490320
	void Authority_SetDamageState(enum class ECamperDamageState damageState, bool FireScoreEvent, bool sacrificed); // Function DeadByDaylight.CamperHealthComponent.Authority_SetDamageState // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x5490020
	void Authority_OnSurvivorRemoved(struct ACamperPlayer* Survivor); // Function DeadByDaylight.CamperHealthComponent.Authority_OnSurvivorRemoved // (Final|Native|Private) // @ game+0x548ff70
	void Authority_OnMendChargeCompletionStateChanged(bool complete, struct TArray<struct AActor*>& instigators); // Function DeadByDaylight.CamperHealthComponent.Authority_OnMendChargeCompletionStateChanged // (Final|Native|Protected|HasOutParms) // @ game+0x548fe70
	void Authority_OnHealthBarCharged(bool complete, struct TArray<struct AActor*>& instigators); // Function DeadByDaylight.CamperHealthComponent.Authority_OnHealthBarCharged // (Final|Native|Public|HasOutParms) // @ game+0x548fd70
	void Authority_MendTryGrantScoresOnChargeApplied(float individualChargeAmount, float totalChargeAmount, struct AActor* chargeInstigator, bool wasCoop, float DeltaTime); // Function DeadByDaylight.CamperHealthComponent.Authority_MendTryGrantScoresOnChargeApplied // (Final|Native|Protected) // @ game+0x548fba0
	void Authority_HealTryGrantScoresOnChargeApplied(float individualChargeAmount, float totalChargeAmount, struct AActor* chargeInstigator, bool wasCoop, float DeltaTime); // Function DeadByDaylight.CamperHealthComponent.Authority_HealTryGrantScoresOnChargeApplied // (Final|Native|Protected) // @ game+0x548f9f0
	void Authority_EndInjuredBleedout(); // Function DeadByDaylight.CamperHealthComponent.Authority_EndInjuredBleedout // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x548f8a0
	void Authority_ApplyDoubleDamage(struct AActor* damageSource, struct ACharacter* damagePlayerOwner); // Function DeadByDaylight.CamperHealthComponent.Authority_ApplyDoubleDamage // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x548f7d0
	void Authority_ApplyDeepWound(struct AActor* damageSource, struct ACharacter* damagePlayerOwner); // Function DeadByDaylight.CamperHealthComponent.Authority_ApplyDeepWound // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x548f700
	void Authority_ApplyDamage(struct AActor* damageSource, struct ACharacter* damagePlayerOwner); // Function DeadByDaylight.CamperHealthComponent.Authority_ApplyDamage // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x548f630
};

// Class DeadByDaylight.PlayerInteractable
// Size: 0x370 (Inherited: 0x338)
struct APlayerInteractable : AInteractable {
	struct UPrimitiveComponent* _mainInteractionZone; // 0x338(0x08)
	struct UInteractor* _selfInteractionsInteractor; // 0x340(0x08)
	struct USceneComponent* _rootComponent; // 0x348(0x08)
	char pad_350[0x20]; // 0x350(0x20)

	void InitInteractable(struct ADBDPlayer* Player); // Function DeadByDaylight.PlayerInteractable.InitInteractable // (Native|Event|Protected|BlueprintEvent) // @ game+0x557c4e0
};

// Class DeadByDaylight.CamperInteractable
// Size: 0x460 (Inherited: 0x370)
struct ACamperInteractable : APlayerInteractable {
	char pad_370[0x8]; // 0x370(0x08)
	struct TArray<struct UInteractor*> HealingInteractors; // 0x378(0x10)
	struct TArray<struct UChargeableInteractionDefinition*> _healInteractions; // 0x388(0x10)
	struct UChargeableComponent* _killCharge; // 0x398(0x08)
	struct UChargeableComponent* _snapOutOfItCharge; // 0x3a0(0x08)
	struct UChargeableComponent* _wakeUpCharge; // 0x3a8(0x08)
	struct UChargeableComponent* _crowDismissCharge; // 0x3b0(0x08)
	struct UActivatorComponent* _activator; // 0x3b8(0x08)
	char pad_3C0[0x68]; // 0x3c0(0x68)
	struct UInteractor* _killInteractor; // 0x428(0x08)
	struct UBoxComponent* _killInteractionZone; // 0x430(0x08)
	struct USphereComponent* _killHealthyInteractionZone; // 0x438(0x08)
	struct UInteractor* _healingInteractor1; // 0x440(0x08)
	char pad_448[0x18]; // 0x448(0x18)

	void UpdateTargetHPSlot(); // Function DeadByDaylight.CamperInteractable.UpdateTargetHPSlot // (Final|Native|Private) // @ game+0x5497200
	void SetKillInteraction(struct UInteractionDefinition* killInteraction); // Function DeadByDaylight.CamperInteractable.SetKillInteraction // (Final|Native|Public|BlueprintCallable) // @ game+0x5497030
	void ServerMoveOut(); // Function DeadByDaylight.CamperInteractable.ServerMoveOut // (Final|Net|Native|Event|Private|NetServer|NetValidate) // @ game+0x5496d60
	struct UInteractor* GetSlasherInteractor(); // Function DeadByDaylight.CamperInteractable.GetSlasherInteractor // (Event|Protected|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x5e02c90
	struct ACamperPlayer* GetOwningSurvivor(); // Function DeadByDaylight.CamperInteractable.GetOwningSurvivor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5495700
};

// Class DeadByDaylight.CamperMaterialHelperController
// Size: 0x140 (Inherited: 0xb8)
struct UCamperMaterialHelperController : UActorComponent {
	char pad_B8[0x78]; // 0xb8(0x78)
	struct TArray<struct FManagedMaterialGroup> _managedGroups; // 0x130(0x10)

	void RemoveGroupsBySource(struct UObject* Source); // Function DeadByDaylight.CamperMaterialHelperController.RemoveGroupsBySource // (Final|Native|Public|BlueprintCallable) // @ game+0x5496bf0
	void AddManagedWithCondition(struct UObject* Source, struct FString Group, struct FDelegate& Condition); // Function DeadByDaylight.CamperMaterialHelperController.AddManagedWithCondition // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x5494960
	void AddManagedGroup(struct UObject* Source, struct FString Group); // Function DeadByDaylight.CamperMaterialHelperController.AddManagedGroup // (Final|Native|Public|BlueprintCallable) // @ game+0x5494880
};

// Class DeadByDaylight.DBDCharacterMovementComponent
// Size: 0xe30 (Inherited: 0xb10)
struct UDBDCharacterMovementComponent : UCharacterMovementComponent {
	char pad_B10[0x18]; // 0xb10(0x18)
	float ProjectedWallSlidingFactor; // 0xb28(0x04)
	float RandomInputFrontMultiplier; // 0xb2c(0x04)
	float RandomInputSideMultiplier; // 0xb30(0x04)
	float RandomInputBackMultiplier; // 0xb34(0x04)
	char pad_B38[0x90]; // 0xb38(0x90)
	bool _forceUseDropStaggerFix; // 0xbc8(0x01)
	char pad_BC9[0x1f]; // 0xbc9(0x1f)
	struct TArray<struct UCurveFloat*> _maxSpeedMultiplierCurvesToRemoveOnTheServer; // 0xbe8(0x10)
	char pad_BF8[0x1a0]; // 0xbf8(0x1a0)
	struct UBaseCharacterVelocityAdditiveStrategy* _velocityAdditiveStrategy; // 0xd98(0x08)
	struct UBaseInputAccelerationConstraintStrategy* _inputAccelerationConstraintStrategy; // 0xda0(0x08)
	struct UBaseCharacterRotationStrategy* _rotationStrategy; // 0xda8(0x08)
	struct AActor* _lookAtTarget; // 0xdb0(0x08)
	char pad_DB8[0x78]; // 0xdb8(0x78)

	void Server_StopMontage(float Timestamp, struct FMontageStopDefinition MontageStopDefinition); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_StopMontage // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c94a0
	void Server_StartSnapping(float Timestamp, struct FSnappingData Data, int32_t snappingCallCount); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_StartSnapping // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c9340
	void Server_SetStopSnapping(float Timestamp, bool snapToFinalDestination); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_SetStopSnapping // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c9260
	void Server_SetMaxSpeedOverride(float Timestamp, float value, bool isSet, int32_t maxSpeedOverrideCallCount); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_SetMaxSpeedOverride // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c90f0
	void Server_SetMaxSpeedMultiplierScalar(float Timestamp, float value); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_SetMaxSpeedMultiplierScalar // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c9020
	void Server_SetMaxAcceleration(float Timestamp, float value); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_SetMaxAcceleration // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c8f50
	void Server_SetIgnorePawnCollisionOverride(float Timestamp, bool isIgnoringPawnCollision, int32_t ignoringCollisionCallCount); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_SetIgnorePawnCollisionOverride // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c8e30
	void Server_SetGroundFriction(float Timestamp, float value); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_SetGroundFriction // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c8d60
	void Server_SetAdditiveMaxSpeedScalar(float Timestamp, float value); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_SetAdditiveMaxSpeedScalar // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c8c90
	void Server_ReplicateControlRotation(char ClientRoll, uint32_t View); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_ReplicateControlRotation // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x54c8bc0
	void Server_RemoveMaxSpeedMovementCurve(float Timestamp, uint32_t curveNetId, enum class EMovementCurveType movementCurveType); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_RemoveMaxSpeedMovementCurve // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c8ab0
	void Server_PlayMontage(float Timestamp, struct FMontagePlaybackDefinition MontagePlaybackDefinition); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_PlayMontage // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c89a0
	void Server_Launch(float Timestamp, struct FVector LaunchVelocity, int32_t launchCallCount); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_Launch // (Final|Net|NetReliableNative|Event|Private|NetServer|HasDefaults) // @ game+0x54c8870
	void Server_AddMaxSpeedMovementCurve(float Timestamp, uint32_t curveNetId, float Duration, float startOffset, enum class EMovementCurveType movementCurveType); // Function DeadByDaylight.DBDCharacterMovementComponent.Server_AddMaxSpeedMovementCurve // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x54c86d0
	void OnPreMontageStop(struct FMontageStopDefinition montageDefinition, struct UAnimMontage* Montage); // Function DeadByDaylight.DBDCharacterMovementComponent.OnPreMontageStop // (Final|Native|Private) // @ game+0x54c8580
	void OnMontageStarted(struct FMontagePlaybackDefinition& montageDefinition, struct UAnimMontage* Montage); // Function DeadByDaylight.DBDCharacterMovementComponent.OnMontageStarted // (Final|Native|Private|HasOutParms) // @ game+0x54c8480
	void DBD_SimulateHack_LocalSurvivorMaxSpeedMultiplierUsingServerRPC(float maxSpeedMultiplier); // Function DeadByDaylight.DBDCharacterMovementComponent.DBD_SimulateHack_LocalSurvivorMaxSpeedMultiplierUsingServerRPC // (Final|Exec|Native|Private) // @ game+0x46a2490
	void DBD_SimulateHack_LocalLaunch(float xVelocity, float yVelocity, float zVelocity); // Function DeadByDaylight.DBDCharacterMovementComponent.DBD_SimulateHack_LocalLaunch // (Final|Exec|Native|Private) // @ game+0x54c7b10
	void Client_TeleportTo(struct FVector_NetQuantize100 Location, struct FYawAndPitchRotator_NetQuantize32 Rotation); // Function DeadByDaylight.DBDCharacterMovementComponent.Client_TeleportTo // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x54c7a20
	void Client_Stop(); // Function DeadByDaylight.DBDCharacterMovementComponent.Client_Stop // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x54c7a00
	void Client_PreventMovement(bool value); // Function DeadByDaylight.DBDCharacterMovementComponent.Client_PreventMovement // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x54c7970
};

// Class DeadByDaylight.CamperMovementComponent
// Size: 0xec0 (Inherited: 0xe30)
struct UCamperMovementComponent : UDBDCharacterMovementComponent {
	char pad_E30[0x18]; // 0xe30(0x18)
	float MaxCrawlSpeed; // 0xe48(0x04)
	float MaxRunSpeed; // 0xe4c(0x04)
	struct FRotator _defaultRotationRate; // 0xe50(0x0c)
	struct FRotator _rotationRateWhileCrawling; // 0xe5c(0x0c)
	struct UCurveFloat* _dropStaggerDuration; // 0xe68(0x08)
	struct UCurveFloat* _dropStaggerMaxSpeed; // 0xe70(0x08)
	char pad_E78[0x48]; // 0xe78(0x48)

	void OnCamperHealthStateChanged(enum class ECamperDamageState oldDamageState, enum class ECamperDamageState CurrentDamageState); // Function DeadByDaylight.CamperMovementComponent.OnCamperHealthStateChanged // (Final|Native|Public) // @ game+0x54962b0
	struct FRotator GetRotationRateWhileCrawling(); // Function DeadByDaylight.CamperMovementComponent.GetRotationRateWhileCrawling // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x5495790
	float GetDropStaggerTimeLeft(); // Function DeadByDaylight.CamperMovementComponent.GetDropStaggerTimeLeft // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5495300
	struct FRotator GetDefaultRotationRate(); // Function DeadByDaylight.CamperMovementComponent.GetDefaultRotationRate // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x54952c0
	void DBD_SurvivorMaxSpeedMultiplier(float maxSpeedMultiplier); // Function DeadByDaylight.CamperMovementComponent.DBD_SurvivorMaxSpeedMultiplier // (Final|Exec|Native|Private) // @ game+0x46a2490
	void DBD_SimulateHack_LocalSurvivorMaxSpeedMultiplier(float maxSpeedMultiplier); // Function DeadByDaylight.CamperMovementComponent.DBD_SimulateHack_LocalSurvivorMaxSpeedMultiplier // (Final|Exec|Native|Private) // @ game+0x46a2490
	void Client_Debug_SetSurvivorMaxSpeedMultiplier(float maxSpeedMultiplier); // Function DeadByDaylight.CamperMovementComponent.Client_Debug_SetSurvivorMaxSpeedMultiplier // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x5494cf0
};

// Class DeadByDaylight.DBDBasePlayer
// Size: 0x580 (Inherited: 0x4d0)
struct ADBDBasePlayer : ACharacter {
	struct FMulticastInlineDelegate OnCustomizationChanged; // 0x4d0(0x10)
	struct FGameplayTagContainer _semanticGameplayTags; // 0x4e0(0x20)
	struct UBaseGroundDetectorComponent* _leftFootGroundDetector; // 0x500(0x08)
	struct UBaseGroundDetectorComponent* _rightFootGroundDetector; // 0x508(0x08)
	struct UBaseGroundDetectorComponent* _leftFrontFootGroundDetector; // 0x510(0x08)
	struct UBaseGroundDetectorComponent* _rightFrontFootGroundDetector; // 0x518(0x08)
	char pad_520[0x8]; // 0x520(0x08)
	int32_t _characterIndex; // 0x528(0x04)
	char pad_52C[0x54]; // 0x52c(0x54)

	bool TeleportWithClothHandling(struct FVector& Location, struct FRotator& Rotation, bool checkCollisions); // Function DeadByDaylight.DBDBasePlayer.TeleportWithClothHandling // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x54c96e0
	void Multicast_SwapCosmetics(struct FName cosmeticId); // Function DeadByDaylight.DBDBasePlayer.Multicast_SwapCosmetics // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x54c83d0
	bool GetShowBlindDebugInfo(); // Function DeadByDaylight.DBDBasePlayer.GetShowBlindDebugInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c81b0
	struct FGameplayTagContainer GetSemanticTag(); // Function DeadByDaylight.DBDBasePlayer.GetSemanticTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c8180
	enum class EPhysicalSurface GetRightFrontFootSurfaceType(); // Function DeadByDaylight.DBDBasePlayer.GetRightFrontFootSurfaceType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c8140
	struct FString GetRightFrontFootAudioSurfaceName(); // Function DeadByDaylight.DBDBasePlayer.GetRightFrontFootAudioSurfaceName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c80c0
	enum class EPhysicalSurface GetRightFootSurfaceType(); // Function DeadByDaylight.DBDBasePlayer.GetRightFootSurfaceType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c8080
	struct FString GetRightFootAudioSurfaceName(); // Function DeadByDaylight.DBDBasePlayer.GetRightFootAudioSurfaceName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c8000
	enum class EPhysicalSurface GetLeftFrontFootSurfaceType(); // Function DeadByDaylight.DBDBasePlayer.GetLeftFrontFootSurfaceType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c7fc0
	struct FString GetLeftFrontFootAudioSurfaceName(); // Function DeadByDaylight.DBDBasePlayer.GetLeftFrontFootAudioSurfaceName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c7f40
	enum class EPhysicalSurface GetLeftFootSurfaceType(); // Function DeadByDaylight.DBDBasePlayer.GetLeftFootSurfaceType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c7f00
	struct FString GetLeftFootAudioSurfaceName(); // Function DeadByDaylight.DBDBasePlayer.GetLeftFootAudioSurfaceName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c7e80
	struct UCustomizedSkeletalMesh* GetCustomizedSkeletalMesh(); // Function DeadByDaylight.DBDBasePlayer.GetCustomizedSkeletalMesh // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x54c7e20
	struct UCustomizedAudioComponent* GetCustomizedAudio(); // Function DeadByDaylight.DBDBasePlayer.GetCustomizedAudio // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c7df0
	struct FName GetCharacterName(); // Function DeadByDaylight.DBDBasePlayer.GetCharacterName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c7c90
	int32_t GetCharacterIndex(); // Function DeadByDaylight.DBDBasePlayer.GetCharacterIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c7c60
	struct UAkComponent* GetAudioComponent(); // Function DeadByDaylight.DBDBasePlayer.GetAudioComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54c7c30
	void DBD_SwapCosmetics(struct FName cosmeticId); // Function DeadByDaylight.DBDBasePlayer.DBD_SwapCosmetics // (Final|Exec|Native|Protected) // @ game+0x54b5290
};

// Class DeadByDaylight.DBDPlayer
// Size: 0x11a0 (Inherited: 0x580)
struct ADBDPlayer : ADBDBasePlayer {
	char pad_580[0x90]; // 0x580(0x90)
	bool AllowInterrupting; // 0x610(0x01)
	char pad_611[0x3]; // 0x611(0x03)
	float MinFallHeight; // 0x614(0x04)
	char pad_618[0x1]; // 0x618(0x01)
	bool IsInInteractionUpdate; // 0x619(0x01)
	bool IsInteractionChargeCompleted; // 0x61a(0x01)
	char pad_61B[0x1]; // 0x61b(0x01)
	float PitchLimitLower; // 0x61c(0x04)
	float PitchLimitUpper; // 0x620(0x04)
	struct FVector StrafingOffset; // 0x624(0x0c)
	float PelvisHeight; // 0x630(0x04)
	float PelvisHeightForPounceOnStandingCamper; // 0x634(0x04)
	float PelvisHeightForPounceOnCrouchingCamper; // 0x638(0x04)
	char pad_63C[0x34]; // 0x63c(0x34)
	struct FMulticastInlineDelegate Authority_OnAttackedDelegate; // 0x670(0x10)
	struct FMulticastInlineDelegate OnDamageTargetDelegate; // 0x680(0x10)
	struct FMulticastInlineDelegate OnSensed; // 0x690(0x10)
	struct FMulticastInlineDelegate OnAnimNotify_Pickup; // 0x6a0(0x10)
	struct FMulticastInlineDelegate OnAnimNotify_Release; // 0x6b0(0x10)
	struct FMulticastInlineDelegate Authority_OnSecondaryActionInput; // 0x6c0(0x10)
	struct FMulticastInlineDelegate OnFirstPersonModeChanged; // 0x6d0(0x10)
	struct FMulticastInlineDelegate OnDreamworldComponentSet; // 0x6e0(0x10)
	struct FMulticastInlineDelegate OnForwardInputLockedChanged; // 0x6f0(0x10)
	struct USpringArmComponent* CameraBoom; // 0x700(0x08)
	char pad_708[0x30]; // 0x708(0x30)
	bool ForceSkillChecks; // 0x738(0x01)
	char pad_739[0x7]; // 0x739(0x07)
	struct FTransform IKLeftHandTransform; // 0x740(0x30)
	struct FTransform IKRightHandTransform; // 0x770(0x30)
	float CameraResetSpeed; // 0x7a0(0x04)
	char pad_7A4[0x4]; // 0x7a4(0x04)
	float AverageSpeedBufferTime; // 0x7a8(0x04)
	float AlmostCurrentSpeedBufferTime; // 0x7ac(0x04)
	struct UCurveFloat* GamepadYawCurve; // 0x7b0(0x08)
	struct UCurveFloat* GamepadPitchCurve; // 0x7b8(0x08)
	struct UCurveFloat* GamepadSettingToYawRateCurve; // 0x7c0(0x08)
	struct UCurveFloat* GamepadSettingToPitchRateCurve; // 0x7c8(0x08)
	struct UCurveFloat* JoyconSettingToYawRateCurve; // 0x7d0(0x08)
	struct UCurveFloat* JoyconSettingToPitchRateCurve; // 0x7d8(0x08)
	struct FMulticastInlineDelegate OnIsCrouchedChanged; // 0x7e0(0x10)
	struct FMulticastInlineDelegate OnRunningAndMovingChanged; // 0x7f0(0x10)
	char pad_800[0x20]; // 0x800(0x20)
	struct FMulticastInlineDelegate OnLocallyObservedChangedForPlayer; // 0x820(0x10)
	struct UCameraComponent* Camera; // 0x830(0x08)
	struct UMaterialHelper* MaterialHelper; // 0x838(0x08)
	char pad_840[0x30]; // 0x840(0x30)
	struct APlayerInteractable* Interactable; // 0x870(0x08)
	char pad_878[0x18]; // 0x878(0x18)
	struct UCharacterInventoryComponent* _characterInventoryComponent; // 0x890(0x08)
	struct FName CarryJointName; // 0x898(0x0c)
	float _pitchOffsetForInteractionPriority; // 0x8a4(0x04)
	struct UBoxOcclusionQueryComponent* _renderedPixelCounter; // 0x8a8(0x08)
	struct UBoxComponent* _standingOcclusionBox; // 0x8b0(0x08)
	struct UBoxComponent* _crouchingOcclusionBox; // 0x8b8(0x08)
	struct UActivatorComponent* _activator; // 0x8c0(0x08)
	bool IsInteracting; // 0x8c8(0x01)
	char pad_8C9[0x3]; // 0x8c9(0x03)
	float _aiCanBeSeenTestCrouchScale; // 0x8cc(0x04)
	float _aiCanBeSeenTestRightOffset; // 0x8d0(0x04)
	float _aiCanBeSeenTestHighOffset; // 0x8d4(0x04)
	float _aiCanBeSeenTestLowOffset; // 0x8d8(0x04)
	float ClearPathTestRadiusMultiplier; // 0x8dc(0x04)
	float ClearPathTestHeightMultiplier; // 0x8e0(0x04)
	float LocationClearTestRadiusMultiplier; // 0x8e4(0x04)
	float LocationClearTestHeightMultiplier; // 0x8e8(0x04)
	float ClearPathTestStepHeight; // 0x8ec(0x04)
	float MouseTurnSpeedMultiplier; // 0x8f0(0x04)
	float MouseLookUpSpeedMultiplier; // 0x8f4(0x04)
	struct USoundCue* DeathSound; // 0x8f8(0x08)
	enum class ECamperState CurrentCamperState; // 0x900(0x01)
	char pad_901[0x3]; // 0x901(0x03)
	struct FName CollectableAttachPoint; // 0x904(0x0c)
	struct UStateMachine* _stateMachine; // 0x910(0x08)
	struct UPlayerInteractionHandler* _interactionHandler; // 0x918(0x08)
	struct UMontagePlayer* _montagePlayer; // 0x920(0x08)
	struct UPerkManager* _perkManager; // 0x928(0x08)
	struct UDBDPlayerData* _playerData; // 0x930(0x08)
	struct APlayerInteractable* _interactable; // 0x938(0x08)
	char pad_940[0x50]; // 0x940(0x50)
	struct ADBDPlayer* _carryingPlayer; // 0x990(0x08)
	char pad_998[0x8]; // 0x998(0x08)
	struct ADBDPlayer* _interactingPlayer; // 0x9a0(0x08)
	char pad_9A8[0x30]; // 0x9a8(0x30)
	enum class EAttackSubstate _nextAttackSubstate; // 0x9d8(0x01)
	char pad_9D9[0x7]; // 0x9d9(0x07)
	struct TArray<struct ADBDPlayer*> _hitTargets; // 0x9e0(0x10)
	struct UCharacterDreamworldComponent* _dreamworldComponent; // 0x9f0(0x08)
	struct UCharacterChaseVisualComponent* _characterChaseVisualComponent; // 0x9f8(0x08)
	struct UCameraHandlerComponent* _cameraHandlerComponent; // 0xa00(0x08)
	struct UReversibleActionSystemComponent* _reversibleActionSystemComponent; // 0xa08(0x08)
	struct USceneComponent* _itemDropOffPosition; // 0xa10(0x08)
	struct UAIPerceptionStimuliSourceComponent* _perceptionStimuliComponent; // 0xa18(0x08)
	struct TArray<struct AActor*> _ignoreActors; // 0xa20(0x10)
	struct TArray<struct FEffectCameraTypeSettings> EffectCameraTypeSettings; // 0xa30(0x10)
	struct TMap<struct USceneComponent*, bool> _detectionZoneEnabledMap; // 0xa40(0x50)
	char pad_A90[0x30]; // 0xa90(0x30)
	struct UChargeableComponent* _blindingChargeableComponent; // 0xac0(0x08)
	char pad_AC8[0x90]; // 0xac8(0x90)
	bool _shouldUpdateStateMachineDriverOnPossessed; // 0xb58(0x01)
	char pad_B59[0x7]; // 0xb59(0x07)
	struct UBlindableComponent* _blindableComponent; // 0xb60(0x08)
	char pad_B68[0x4]; // 0xb68(0x04)
	float _tutorialChargeableInteractionMultiplier; // 0xb6c(0x04)
	char pad_B70[0x8]; // 0xb70(0x08)
	struct UPollableEventListener* _eventListener; // 0xb78(0x08)
	char pad_B80[0x8]; // 0xb80(0x08)
	struct UChaseComponent* _chaseComponent; // 0xb88(0x08)
	struct UZoneDetectorComponent* _meatHookZoneDetector; // 0xb90(0x08)
	struct UZoneDetectorComponent* _basementZoneDetector; // 0xb98(0x08)
	char pad_BA0[0x40]; // 0xba0(0x40)
	struct FGameplayTagContainer _animGameplayTags; // 0xbe0(0x20)
	char pad_C00[0x58]; // 0xc00(0x58)
	struct UInteractionDefinition* _bookmarkedInteraction; // 0xc58(0x08)
	struct TMap<enum class EDetectionZone, struct UPrimitiveComponent*> _detectionZoneMap; // 0xc60(0x50)
	char pad_CB0[0x60]; // 0xcb0(0x60)
	struct UAuthoritativeMovementComponent* _authoritativeMovementComponent; // 0xd10(0x08)
	char pad_D18[0x308]; // 0xd18(0x308)
	float _screenAspectRatio; // 0x1020(0x04)
	char pad_1024[0x1c]; // 0x1024(0x1c)
	struct UGameplayTagContainerComponent* _objectState; // 0x1040(0x08)
	struct UAudioFXComponent* _audioFXComponent; // 0x1048(0x08)
	struct UPlayerPerspectiveComponent* _playerPerspectiveComponent; // 0x1050(0x08)
	char pad_1058[0x8]; // 0x1058(0x08)
	struct UCharacterSightComponent* _characterSightComponent; // 0x1060(0x08)
	char pad_1068[0x8]; // 0x1068(0x08)
	struct UCharacterSightableComponent* _characterSightableComponent; // 0x1070(0x08)
	char pad_1078[0x10]; // 0x1078(0x10)
	struct UNavigationStateComponent* _navigationStateComponent; // 0x1088(0x08)
	struct UInteractionDetectorComponent* _interactionDetectorComponent; // 0x1090(0x08)
	struct UPrimitivesRegistererComponent* _clippablePrimitivesRegistererComponent; // 0x1098(0x08)
	struct UClippableProviderComponent* _clippableProviderComponent; // 0x10a0(0x08)
	struct UDynamicCapsuleResizerComponent* _dynCapsuleResizer; // 0x10a8(0x08)
	struct UPlayerGameRelevancyComponent* _playerGameRelevancyComponent; // 0x10b0(0x08)
	struct UContextualQuestComponent* _contextualQuestComponent; // 0x10b8(0x08)
	char pad_10C0[0x20]; // 0x10c0(0x20)
	struct UActorComponent* _questEventHandler; // 0x10e0(0x08)
	struct UChargeableProgressProviderComponent* _presentationChargeableProgressComponent; // 0x10e8(0x08)
	char pad_10F0[0x18]; // 0x10f0(0x18)
	struct UCurveFloat* _currentGamepadYawCurve; // 0x1108(0x08)
	struct UCurveFloat* _currentGamepadPitchCurve; // 0x1110(0x08)
	struct ADBDPlayerState* _associatedPlayerStateCache; // 0x1118(0x08)
	struct FOnMovementCacheStruct _onMovementCacheStruct; // 0x1120(0x0c)
	char pad_112C[0x4]; // 0x112c(0x04)
	struct UOtherCharactersVerticalCollisionsHandler* _otherCharactersVerticalCollisionsHandler; // 0x1130(0x08)
	char pad_1138[0x68]; // 0x1138(0x68)

	void UpdateLoadoutFromInventory(); // Function DeadByDaylight.DBDPlayer.UpdateLoadoutFromInventory // (Final|Native|Public|Const) // @ game+0x54f4da0
	bool TryInteractionType(enum class EInputInteractionType interactionInputType, struct ADBDPlayer* requester, bool usingInputPersistence, bool force); // Function DeadByDaylight.DBDPlayer.TryInteractionType // (Final|Native|Public|BlueprintCallable) // @ game+0x54f4c20
	bool TryInteraction(struct UInteractionDefinition* Interaction, struct ADBDPlayer* requester, bool force, bool usingInputPersistence); // Function DeadByDaylight.DBDPlayer.TryInteraction // (Final|Native|Public|BlueprintCallable) // @ game+0x54f4aa0
	bool TryFireScoreEvent(enum class EDBDScoreTypes scoreType, float PercentToAward); // Function DeadByDaylight.DBDPlayer.TryFireScoreEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x54f49c0
	void TriggerAnimNotify(enum class EAnimNotifyType animNotifyType); // Function DeadByDaylight.DBDPlayer.TriggerAnimNotify // (Final|Native|Public|BlueprintCallable) // @ game+0x54f4940
	void StopMontage(); // Function DeadByDaylight.DBDPlayer.StopMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x54f4920
	void SnapCharacter(bool snapPosition, struct FVector position, float stopSnapDistance, bool snapRotation, struct FRotator Rotation, float Time, bool useZCoord, bool sweepOnFinalSnap, bool snapRoll); // Function DeadByDaylight.DBDPlayer.SnapCharacter // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x54f4640
	bool ShouldPlayCarryAnim(); // Function DeadByDaylight.DBDPlayer.ShouldPlayCarryAnim // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54f4610
	bool ShouldFall(); // Function DeadByDaylight.DBDPlayer.ShouldFall // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x54f45e0
	void SetShouldPlayCarryAnim(bool ShouldPlayCarryAnim); // Function DeadByDaylight.DBDPlayer.SetShouldPlayCarryAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x54f4550
	void SetReverseMontage(bool Reverse); // Function DeadByDaylight.DBDPlayer.SetReverseMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x54f44c0
