// WidgetBlueprintGeneratedClass WBP_CoreWatermark.WBP_CoreWatermark_C
// Size: 0x3b8 (Inherited: 0x350)
struct UWBP_CoreWatermark_C : UCoreWatermarkWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct UCanvasPanel* CanvasPanel; // 0x358(0x08)
	struct UDBDTextBlock* WatermarkDBDText1; // 0x360(0x08)
	struct UDBDTextBlock* WatermarkDBDText10; // 0x368(0x08)
	struct UDBDTextBlock* WatermarkDBDText11; // 0x370(0x08)
	struct UDBDTextBlock* WatermarkDBDText2; // 0x378(0x08)
	struct UDBDTextBlock* WatermarkDBDText3; // 0x380(0x08)
	struct UDBDTextBlock* WatermarkDBDText4; // 0x388(0x08)
	struct UDBDTextBlock* WatermarkDBDText5; // 0x390(0x08)
	struct UDBDTextBlock* WatermarkDBDText6; // 0x398(0x08)
	struct UDBDTextBlock* WatermarkDBDText7; // 0x3a0(0x08)
	struct UDBDTextBlock* WatermarkDBDText8; // 0x3a8(0x08)
	struct UDBDTextBlock* WatermarkDBDText9; // 0x3b0(0x08)

	void Construct(); // Function WBP_CoreWatermark.WBP_CoreWatermark_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x5e02c90
	void ExecuteUbergraph_WBP_CoreWatermark(int32_t EntryPoint); // Function WBP_CoreWatermark.WBP_CoreWatermark_C.ExecuteUbergraph_WBP_CoreWatermark // (Final|UbergraphFunction|HasDefaults) // @ game+0x5e02c90
};

